package org.appxi.cbeta;

import java.util.HashMap;
import java.util.Map;

public final class BookInfo {
    public enum Kind {
        jin("经"),
        lv("律"),
        lun("论"),
        jinShi("论：经释"),
        lvShi("论：律释"),
        lunShi("论：论释"),

        yiGui("仪轨、念诵法"),
        zhuanJi("传记"),
        shi("史"),
        jiLu("记录、纪事"),
        zhi("山志、寺志"),
        yuLu("语录"),

        xu("序"),
        muLu("目录"),
        wenXian("文献"),
        yinYi("音译"),
        
        other("其他");

        public final String label;

        Kind(String label) {
            this.label = label;
        }

        private BookInfo of2(String title, String... authors) {
            return new BookInfo(this, title, null, authors);
        }
        private BookInfo of3(String title, String period, String... authors) {
            return new BookInfo(this, title, new String[]{period}, authors);
        }
        private BookInfo of4(String title, String[] periods, String... authors) {
            return new BookInfo(this, title, periods, authors);
        }
    }

    public static final Map<String, BookInfo> data = new HashMap<>(9000);

    static {
        addA();
        addB();
        addC();
        addD();
        addF();
        addG();
        addI();
        addJ();
        addK();
        addL();
        addM();
        addN();
        addP();
        addS();
        addT();
        addT1000();
        addT2000();
        addU();
        addX();
        addY();
        addZ();
    }

    public static void add(Object... kvPairs) {
        for (int i = 0; i < kvPairs.length; ) {
            data.put((String) kvPairs[i++], (BookInfo) kvPairs[i++]);
        }
    }

    private static void addA() {
        add(
                "A1057", Kind.yinYi.of3("新譯大方廣佛華嚴經音義", "唐", "慧菀"), // 唐 慧菀述
                
                "A1267", Kind.muLu.of3("大唐開元釋教廣品歷章", "唐", "玄逸"), // 唐 玄逸撰
                "A1490", Kind.muLu.of3("天聖釋教總錄", "宋", "惟淨"), // 宋 惟淨等編修
                "A1493", Kind.muLu.of3("大中祥符法寶錄", "宋", "楊億"), // 宋 楊億等編修
                "A1494", Kind.muLu.of3("景祐新修法寶錄", "宋", "呂夷簡"), // 宋 呂夷簡等編修
                
                "A1504", Kind.jin.of3("佛說大乘僧伽吒法義經", "宋", "金總持"), // 宋 金總持等譯
                "A1505", Kind.jin.of3("佛說清淨毘奈耶最上大乘經", "宋", "智吉祥"), // 宋 智吉祥等譯
                
                "A1548", Kind.lunShi.of3("因明論理門十四過類疏", "唐", "窺基"), // 唐 窺基撰
                "A1561", Kind.lunShi.of3("瑜伽師地論義演", "唐", "清素", "澄淨") // 唐 清素．澄淨述
        );
    }

    private static void addB() {
        add(
                "B0001", Kind.lun.of2("均如大師華嚴學全書", "均如", "金知見"), // 均如著　金知見編
                "B0002", Kind.lun.of2("華嚴經疏論纂要", "道霈"), // 道霈編

                "B0003", Kind.jin.of2("南傳長部經典", "江鍊百"), // 江鍊百譯
                "B0004", Kind.jin.of2("南傳中部經典", "芝峯"), // 芝峯譯
                "B0005", Kind.jin.of2("南傳小部經典", "夏丏尊"), // 夏丏尊譯
                "B0006", Kind.jin.of2("泰國大藏經小部經", "黃謹良"), // 黃謹良譯

                "B0007", Kind.lun.of2("發趣論", "范寄東"), // 范寄東譯
                "B0008", Kind.lunShi.of2("大發趣論註", "覺音", "范寄東"), // 覺音造　范寄東譯
                "B0009", Kind.lunShi.of2("冠導阿毗達磨俱舍論", "佐伯旭雅"), // 佐伯旭雅編

                "B0010", Kind.jin.of2("南傳轉法輪經", "丘哌博"), // 丘哌博譯
                "B0011", Kind.jin.of2("轉法輪經", "岫廬"), // 岫廬譯
                "B0012", Kind.jin.of2("三寶經", "法舫"), // 法舫譯
                "B0013", Kind.jin.of2("吉祥經", "法舫"), // 法舫譯
                "B0014", Kind.jin.of2("婆羅門正法經", "法舫"), // 法舫譯
                "B0015", Kind.jin.of2("南傳羯臘摩經", "丘寶光", "徐鄂雲"), // 丘寶光．徐鄂雲同譯
                "B0016", Kind.jin.of2("南傳大悲經", "法舫"), // 法舫譯
                "B0017", Kind.jin.of2("南傳法句經", "了參"), // 了參譯
                "B0018", Kind.jin.of2("南傳大般湼槃經", "巴宙"), // 巴宙譯
                "B0019", Kind.jin.of2("南傳念安般經", "湯用彤"), // 湯用彤譯

                "B0020", Kind.jinShi.of3("隨念三寶經淺說", "现代", "法尊", "雲根"), // 法尊口述 雲根記
                "B0021", Kind.jinShi.of2("毒語心經", "白隱慧鶴", "南天棒鄧州"), // 白隱慧鶴註釋 南天棒鄧州提唱
                "B0022", Kind.jinShi.of2("新譯薄伽梵母智慧到彼岸心經詮釋", "貢噶呼圖克圖"), // 貢噶呼圖克圖譯
                "B0023", Kind.jinShi.of2("金剛般若波羅蜜經講義", "江味農"), // 江味農著
                "B0024", Kind.jinShi.of2("佛說阿彌陀經註釋會要", "鳩摩羅什", "法舫"), // 鳩摩羅什譯　法舫譯

                "B0025", Kind.lun.of2("阿毗達摩攝義論", "阿耨樓陀", "法舫"), // 阿耨樓陀造　法舫譯

                "B0026", Kind.lvShi.of2("四分比丘尼戒本註解", "佛瑩"), // 佛瑩編
                "B0027", Kind.lvShi.of3("瑜伽師地論戒品纂釋", "明", "宗喀巴", "湯薌銘"), // 宗喀巴釋論　湯薌銘譯纂
                "B0028", Kind.lvShi.of3("菩提正道菩薩戒論", "明", "宗喀巴", "湯薌銘"), // 宗喀巴造　湯薌銘譯
                "B0029", Kind.lvShi.of3("菩薩戒品釋", "现代", "宗喀巴", "法尊"), // 宗喀巴造　法尊譯
                
                "B0030", Kind.lunShi.of3("現觀莊嚴論中八品七十義略解", "现代", "法尊"), // 法尊述
                "B0031", Kind.lunShi.of3("現觀莊嚴論略釋", "现代", "彌勒", "法尊"), // 彌勒造頌 法尊譯釋
                "B0032", Kind.lunShi.of3("七十空性論科攝", "现代", "龍樹", "法尊", "弘悲"), // 龍樹造 法尊譯 弘悲科攝
                "B0033", Kind.lunShi.of3("大乘修心七義論釋", "古印度", "無著賢", "慧海"), // 無著造 慧海等譯

                "B0034", Kind.lun.of3("辨法法性論", "现代", "彌勒", "法尊"), // 彌勒造 法尊譯
                "B0035", Kind.lun.of4("西藏傳本攝大乘論", new String[]{"古印度", "民國"}, "無著", "呂澂"), // 無著造 呂澂譯
                "B0036", Kind.lun.of3("三自性論", "古印度", "世親", "劉孝蘭"), // 世親造 劉孝蘭譯
                
                "B0037", Kind.lunShi.of3("集量論釋略抄", "民國", "呂澂"), // 呂澂輯
                "B0038", Kind.lunShi.of3("安慧三十唯識釋略抄", "民國", "呂澂"), // 呂澂輯
                "B0039", Kind.lunShi.of3("觀所緣釋論會譯", "民國", "呂澂", "印滄"), // 呂澂．印滄編
                "B0040", Kind.lunShi.of3("集量論略解", "现代", "陳那", "法尊"), // 陳那著 法尊譯編
                
                "B0041", Kind.lun.of2("正理滴論（譯自梵文本）", "法稱", "王森"), // 法稱著 王森譯
                "B0042", Kind.lun.of2("正理滴論（譯自西藏文本）", "法稱", "楊化群"), // 法稱著 楊化群譯
                
                "B0043", Kind.lunShi.of3("釋量論略解", "现代", "法稱", "僧成", "法尊"), // 法稱著 僧成釋 法尊譯
                "B0044", Kind.lunShi.of3("入中論善顯密意疏", "现代", "宗喀巴", "法尊"), // 宗喀巴造 法尊譯
                "B0045", Kind.lunShi.of3("入中論講記", "现代", "月稱", "法尊"), // 月稱造頌 法尊譯講
                "B0046", Kind.lunShi.of3("中論略義", "明", "宗喀巴", "潭影"), // 宗喀巴著 潭影譯
                "B0047", Kind.lunShi.of2("中論文句釋", "僧成", "常浩"), // 僧成釋 常浩譯
                
                "B0048", Kind.lun.of3("辨了不了義善說藏論", "现代", "宗喀巴", "法尊"), // 宗喀巴造 法尊譯
                "B0049", Kind.lun.of2("菩提道炬論", "阿底霞", "超一"), // 阿底霞造 超一譯
                "B0050", Kind.lun.of3("地道建立", "现代", "三寶無畏王", "法尊"), // 三寶無畏王造 法尊譯
                "B0051", Kind.lun.of3("菩提道次恒修教授", "现代", "札迦", "法尊"), // 札迦說 法尊譯
                "B0052", Kind.lun.of3("緣起讚", "现代", "宗喀巴", "法尊"), // 宗喀巴著 法尊譯
                "B0053", Kind.lun.of2("集諸學頌", "寂靜", "超一"), // 寂靜造 超一譯
                "B0054", Kind.lun.of3("菩提道次第論攝頌", "明", "宗喀巴", "超一"), // 宗喀巴造 超一譯
                "B0055", Kind.lun.of3("菩提道次第論極略頌", "明", "宗喀巴", "超一"), // 宗喀巴著 超一譯
                "B0056", Kind.lun.of2("西藏法寶貫珠", "達瓦桑杜", "伊文思溫慈", "趙洪鑄"), // 達瓦桑杜譯英 伊文思溫慈編註 趙洪鑄譯漢
                "B0057", Kind.lun.of3("密宗道次第論", "现代", "克主", "法尊"), // 克主著 法尊譯
                
                "B0058", Kind.lunShi.of2("涅般道大手印瑜伽法要釋", "白蓮花", "光明心"), // 白蓮花造 光明心譯
                
                "B0059", Kind.lun.of2("明行道六成就法", "珀瑪迦爾", "張妙定蓮菩提金剛正"), // 珀瑪迦爾著 張妙定蓮菩提金剛正譯
                "B0060", Kind.lun.of2("頗哇心要轉識自在法", "達瓦桑杜", "伊文思溫慈", "張妙定蓮菩提金剛正"), // 達瓦桑杜譯英 伊文思溫慈纂集 張妙定蓮菩提金剛正譯漢
                
                "B0061", Kind.lunShi.of2("椎擊三要訣勝法解", "大善解功德主", "貢噶", "滿空"), // 大善解功德主著 貢噶傳 滿空譯
                "B0062", Kind.lunShi.of2("貢噶上師恒河大手印直講", "貢噶"), // 貢噶講
                "B0063", Kind.lunShi.of2("大密妙義深道六法引導廣論纂要", "吉祥", "鍾伯毅"), // 吉祥造 鍾伯毅纂
                
                "B0064", Kind.lun.of3("大圓滿", "现代", "郭元興", "慈威"), // 郭元興著 慈威校註
                "B0065", Kind.lun.of3("菩提道次第略論", "明", "宗喀巴", "邢肅芝"), // 宗喀巴著 邢肅芝譯
                
                "B0066", Kind.lunShi.of3("菩提道次第直講", "明", "宗喀巴", "大勇", "智湛"), // 宗喀巴著 大勇口譯 智湛筆錄
                
                "B0067", Kind.lun.of3("菩提道次第廣論", "现代", "宗喀巴", "法尊"), // 宗喀巴著 法尊譯
                "B0068", Kind.lun.of3("密宗道次第廣論", "现代", "宗喀巴", "法尊"), // 宗喀巴著 法尊譯
                
                "B0069", Kind.zhuanJi.of3("七系付法傳", "现代", "多羅那他", "郭元興"), // 多羅那他著 郭元興譯
                
                "B0070", Kind.lun.of2("安樂妙寶", "金慧暢"), // 金慧暢編
                
                "B0071", Kind.zhuanJi.of2("蓮華生大士應化史略", "諾那呼圖克圖逞列匠磋"), // 諾那呼圖克圖逞列匠磋譯
                "B0072", Kind.zhuanJi.of3("阿底峽尊者傳", "现代", "法尊"), // 法尊譯述
                "B0073", Kind.zhuanJi.of2("木納記", "惹穹多傑札把", "多傑", "張心若"), // 惹穹多傑札把著 多傑譯述 張心若筆錄
                "B0074", Kind.zhuanJi.of3("宗喀巴大師傳", "现代", "法尊"), // 法尊譯述
                "B0075", Kind.zhuanJi.of2("西藏王臣護法記", "第五世達賴喇嘛", "郭和卿"), // 第五世達賴喇嘛著 郭和卿譯

                "B0076", Kind.shi.of2("印度佛教史", "達喇那他", "王沂暖"), // 達喇那他著 王沂暖譯
                
                "B0077", Kind.zhuanJi.of2("洛陽伽藍記校釋", "楊衒之", "周祖謨"), // 楊衒之著 周祖謨校釋
                "B0078", Kind.zhuanJi.of2("洛陽伽藍記校注", "楊衒之", "范祥雍"), // 楊衒之著 范祥雍校注
                "B0079", Kind.zhuanJi.of2("釋氏六帖", "義楚"), // 義楚集
                "B0080", Kind.zhuanJi.of3("大唐西域記", "唐", "玄奘", "辯機"), // 玄奘口述 辯機編纂
                "B0081", Kind.zhuanJi.of2("雙峰山曹侯溪寶林傳", "智炬"), // 智炬著
                "B0082", Kind.zhuanJi.of2("傳燈玉英集", "王隨"), // 王隨編
                
                "B0084", Kind.muLu.of2("藏逸經書標目", "密藏"), // 密藏編
                
                "B0085", Kind.zhuanJi.of2("憨山大師年譜疏註", "福善", "福徵"), // 福善記錄 福徵述疏
                "B0086", Kind.zhuanJi.of2("南朝寺考", "劉世珩"), // 劉世珩著
                
                "B0087", Kind.lun.of2("合訂天台三聖二和詩集", "寒山", "豐干", "拾得", "梵琦", "濟岳"), // 寒山．豐干．拾得原詩 梵琦．濟岳和
                "B0088", Kind.lun.of2("古今圖書集成選輯（上）"), //
                
                "B0089", Kind.zhuanJi.of2("太平廣記選輯", "李昉"), // 李昉等編纂
                "B0090", Kind.zhuanJi.of2("酉陽雜俎選輯", "段成式"), // 段成式著
                "B0091", Kind.zhuanJi.of2("正史選輯"), //
                "B0092", Kind.zhuanJi.of2("唐會要、五代會要、明書、明會典選輯"), //
                "B0093", Kind.zhuanJi.of2("象教皮編", "陳士元"), // 陳士元編
                "B0094", Kind.zhuanJi.of2("冊府元龜選輯", "王欽若", "楊億"), // 王欽若、楊億等著
                "B0095", Kind.zhuanJi.of2("入唐求法巡禮行記", "圓仁"), // 圓仁著
                "B0096", Kind.zhuanJi.of2("佛教繪畫史料"), //
                
                "B0097", Kind.lun.of2("歸元鏡", "智達"), // 智達著
                "B0098", Kind.lun.of2("高旻寺規約", "來果"), // 來果著
                "B0099", Kind.lun.of2("相宗絡索", "王夫之"), // 王夫之著
                "B0101", Kind.lun.of2("絕觀論", "菩提達磨"), // 菩提達磨（？）著
                "B0103", Kind.lun.of2("禪林象器箋", "無著道忠"), // 無著道忠著
                "B0116", Kind.lun.of2("金剛般若波羅蜜經集註", "明成祖朱棣"), // 明成祖朱棣集註
                "B0117", Kind.lun.of2("三藏法數", "一如", "丁福保"), // 一如等編 丁福保重校
                "B0118", Kind.lun.of2("律宗燈譜", "源諒", "劉霞彩"), // 源諒著 劉霞彩編
                "B0119", Kind.lun.of2("天然和尚年譜", "汪宗衍"), // 江宗衍著
                "B0130", Kind.lun.of2("靈峰宗論", "智旭"), // 智旭著
                "B0131", Kind.lun.of2("法海觀瀾", "智旭"), // 智旭輯
                "B0132", Kind.lun.of2("尚直編", "空谷景隆"), // 空谷景隆著
                "B0133", Kind.lun.of2("尚理編", "空谷景隆"), // 空谷景隆著
                "B0134", Kind.lun.of2("闢邪集", "鍾始聲"), // 鍾始聲著
                "B0135", Kind.lun.of2("蒲室集", "笑隱大訢"), // 笑隱大訢著
                "B0136", Kind.lun.of2("選佛譜", "智旭"), // 智旭著
                "B0137", Kind.lun.of2("正名錄", "智楷"), // 智楷著
                "B0138", Kind.lun.of2("開元寺志", "元賢"), // 元賢纂修
                "B0139", Kind.lun.of2("獻花巖志", "陳沂"), // 陳沂著
                "B0140", Kind.lun.of2("雪峰志", "徐𤊹"), // 徐𤊹纂輯
                "B0141", Kind.lun.of2("嵩山少林寺輯志", "傅梅"), // 輯自傅梅撰《嵩書》
                "B0142", Kind.lun.of2("新校定的敦煌寫本神會和尚遺著兩種", "胡適"), // 胡適校定
                "B0143", Kind.lun.of2("神會和尚語錄的第三個敦煌寫本：南陽和尚問答雜徵義", "劉澄", "胡適"), // 胡適校定
                "B0144", Kind.lun.of2("祖堂集", "靜師", "筠禪師"), // 靜、筠二禪德編著
                "B0145", Kind.lun.of2("天目中峰廣錄", "中峰明本"), // 中峰明本著
                "B0146", Kind.lun.of2("房山雲居寺石經──經文、題記、碑銘等拓片之選輯"), //
                "B0147", Kind.lun.of2("三階教殘卷", "矢吹慶輝"), // 矢吹慶輝輯
                "B0148", Kind.lun.of2("東坡禪喜集", "徐長孺"), // 徐長孺輯
                "B0149", Kind.lun.of2("鳴道集說", "李屏山"), // 李屏山著
                "B0150", Kind.lun.of2("道餘錄", "姚廣孝"), // 姚廣孝著
                
                "B0151", Kind.zhuanJi.of2("新續高僧傳", "喻謙"), // 喻謙著
                
                "B0152", Kind.lun.of2("普濟玉琳國師語錄", "音緯"), // 音緯等編
                "B0153", Kind.lun.of2("法藏碎金錄", "晁逈"), // 晁逈著
                "B0155", Kind.lun.of2("聖朝破邪集", "徐昌治"), // 徐昌治編
                "B0156", Kind.lun.of2("佛法金湯", "屠隆"), // 屠隆著
                "B0157", Kind.lun.of2("楊仁山居士遺著", "楊文會"), // 楊文會著
                "B0158", Kind.lun.of2("陰騭文圖", "費丹旭", "許光清"), // 費丹旭繪圖 許光清集證
                "B0159", Kind.lun.of2("了凡四訓", "袁了凡"), // 袁了凡著
                
                "B0160", Kind.zhuanJi.of2("金陵梵剎志", "葛寅亮"), // 葛寅亮著
                "B0161", Kind.zhuanJi.of2("武林梵志", "吳之鯨"), // 吳之鯨著
                "B0163", Kind.zhuanJi.of2("重修曹溪通志", "馬元", "釋真樸"), // 馬元、釋真樸重修

                "B0169", Kind.shi.of2("朝鮮寺剎史料"), //
                "B0170", Kind.shi.of2("朝鮮佛教通史", "李能和"), // 李能和著
                
                "B0171", Kind.lun.of2("八宗綱要鈔", "凝然"), // 凝然述
                "B0172", Kind.lun.of2("出定後語", "富永仲基"), // 富永仲基著
                "B0173", Kind.lun.of2("元亨釋書", "師鍊"), // 師鍊著
                
                "B0174", Kind.zhuanJi.of2("參天台五台山記", "成尋"), // 成尋著
                
                "B0175", Kind.lun.of2("喫茶養生記", "榮西"), // 榮西著
                "B0176", Kind.lun.of2("四宗要文", "日朝", "英園"), // 日朝著 英園纂補
                "B0177", Kind.lun.of2("本朝諸宗要集", "義觀"), // 義觀述
                "B0178", Kind.lun.of2("東大寺六宗未決義"), //
                "B0179", Kind.lun.of2("八海含藏", "師鍊"), // 師鍊著
                "B0180", Kind.lun.of2("華嚴通關", "定仙"), // 定仙著
                "B0181", Kind.lun.of2("諸宗教理同異釋", "賴瑜"), // 賴瑜釋
                "B0182", Kind.lun.of2("內典塵露章", "凝然"), // 凝然述
                "B0183", Kind.lun.of2("禪祖念佛集", "慧中"), // 慧中集
                "B0184", Kind.lun.of2("顯揚正法復古集", "普寂"), // 普寂著
                "B0185", Kind.lun.of2("初學題額集", "良山"), // 良山集
                "B0186", Kind.lun.of2("三國佛法傳通緣起", "凝然"), // 凝然述
                "B0187", Kind.lun.of2("二障義", "元曉"), // 元曉著
                "B0189", Kind.lun.of2("大華嚴一乘法界圖註并序", "雪岑"), // 雪岑著
                
                "B0190", Kind.jinShi.of2("華嚴經釋題", "雪岑"), // 雪岑著
                
                "B0191", Kind.lun.of2("義相法師法性偈", "有聞", "聖奎"), // 有聞科註 聖奎證正
                "B0192", Kind.lun.of2("釋文紀", "梅鼎祚"), // 梅鼎祚輯
                "B0193", Kind.lun.of2("吳都法乘", "周永年"), // 周永年編
                
                "B0194", Kind.muLu.of2("中華大藏經總目錄", "蔡念生"), // 蔡念生編
                
                "B0195", Kind.lun.of2("頓悟大乘政理決", "王錫"), // 王錫著
                "B0196", Kind.lun.of2("大乘中宗見解"), //
                
                "B0197", Kind.zhuanJi.of2("摩訶婆羅多的故事", "拉賈戈帕拉查理", "唐季雍"), // 拉賈戈帕拉查理改寫 唐季雍譯
                
                "B0198", Kind.lun.of2("博伽梵歌", "雅蘇瑪蒂書達．踏薩"), // 雅蘇瑪蒂書達．踏薩譯
                
                "Ba001", Kind.other.of3("出版說明", "现代", "藍吉富"), // 藍吉富
                
                "Ba002", Kind.lun.of3("全書內容簡介", "现代", "藍吉富"), // 藍吉富
                
                "Ba003", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                "Ba004", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                "Ba005", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                "Ba006", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                "Ba007", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                "Ba008", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                "Ba009", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                
                "Ba010", Kind.lun.of3("洛陽伽藍記解題", "现代", "藍吉富"), // 藍吉富
                "Ba011", Kind.lun.of3("釋氏六帖解題", "现代", "藍吉富"), // 藍吉富
                "Ba012", Kind.lun.of3("大唐西域記解題", "现代", "藍吉富"), // 藍吉富
                
                "Ba013", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                "Ba014", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                "Ba015", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                "Ba016", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                "Ba017", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                "Ba018", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                
                "Ba019", Kind.lun.of3("禪林象器箋序", "现代", "藍吉富"), // 藍吉富
                
                "Ba020", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                "Ba021", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                "Ba022", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                "Ba023", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                "Ba024", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                "Ba025", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                "Ba026", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                "Ba027", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                "Ba028", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                "Ba029", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                "Ba030", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                "Ba031", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                "Ba032", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                "Ba033", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                "Ba034", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                
                "Ba035", Kind.lun.of3("吳都法乘簡介", "现代", "藍吉富"), // 藍吉富
                
                "Ba036", Kind.other.of3("編輯說明", "现代", "藍吉富"), // 藍吉富
                "Ba037", Kind.other.of3("編輯說明", "现代", "藍吉富") // 藍吉富
        );
    }

    private static void addC() {
        add(
                "C1163", Kind.yinYi.of3("一切經音義", "唐", "玄應"), // 唐 玄應撰
                "C1169", Kind.yinYi.of3("紹興重雕大藏音", "宋", "處觀"), // 宋 處觀著
                
                "C1665", Kind.jin.of3("菩薩名經", "宋", "羅濬"), // 宋 羅濬集
                "C1666", Kind.jin.of2("梵本大悲神咒"), //
                
                "C1679", Kind.lun.of3("御製佛賦", "宋", "趙炅"), // 宋 趙炅撰
                "C1680", Kind.lun.of3("御製詮源歌", "宋", "趙炅"), // 宋 趙炅撰
                "C1710", Kind.lun.of4("古尊宿語錄", new String[]{"宋", "明"}, "頤藏", "淨戒"), // 宋 頤藏主集　明 淨戒重校
                "C1720", Kind.lun.of4("禪宗頌古聯珠通集", new String[]{"宋", "元", "明"}, "法應", "普會", "淨戒"), // 宋 法應集　元 普會續集　明 淨戒重校
                
                "C1821", Kind.jinShi.of4("楞伽經纂", new String[]{"劉宋", "宋"}, "求那跋陀羅", "楊彥國"), // 劉宋 求那跋陀羅譯經　宋 楊彥國詮註
                
                "C1937", Kind.muLu.of3("大明重刊三藏聖教目錄", "明", "雙徑山僧眾"), // 明 雙徑山僧眾編
                
                "CC0001", Kind.zhuanJi.of4("續比丘尼傳", new String[]{"明", "民國"}, "釋震華") // 民國 釋震華編述
        );
    }

    private static void addD() {
        add(
                "D8679", Kind.jin.of2("佛說佛名經（存卷四）"), //
                "D8680", Kind.jin.of2("佛說佛名經（存卷七）"), //
                "D8701", Kind.jin.of2("盂蘭盆經講經文（前殘）"), //
                
                "D8724", Kind.jinShi.of3("報恩金剛經文十二段", "唐", "楊仙鸖"), // 唐 楊仙鸖撰
                
                "D8774", Kind.lv.of2("羯磨文（前殘）"), //
                "D8775", Kind.lv.of2("式叉摩那尼六法"), //
                
                "D8779", Kind.yiGui.of3("鳩摩羅什法師誦法（後殘）", "東晉", "釋慧融"), // 東晉 釋慧融等集

                "D8780", Kind.lun.of2("小鈔"), //
                "D8790", Kind.lun.of2("佛性觀（前殘）"), //
                
                "D8814", Kind.jin.of2("佛頂尊勝陀羅尼等靈異神咒二十道"), //
                "D8817", Kind.jin.of2("佛說觀世音三昧經"), //
                "D8820", Kind.jin.of2("新菩薩經"), //
                
                "D8838", Kind.jinShi.of3("金剛般若波羅蜜經（註解）", "元", "釋思聰"), // 元 釋思聰註解
                "D8842", Kind.jinShi.of3("般若心經註解", "日本", "釋圓耳"), // 日本 釋圓耳撰
                "D8853", Kind.jinShi.of2("梵網古跡抄"), //
                "D8859", Kind.jinShi.of3("楞嚴妙指", "明", "釋弘演"), // 明 釋弘演撰
                "D8862", Kind.jinShi.of3("楞嚴經四依解", "明", "釋觀衡"), // 明 釋觀衡述
                "D8863", Kind.jinShi.of3("大日經疏指心鈔", "唐", "釋一行"), // 唐 釋一行撰
                "D8864", Kind.jinShi.of3("大日經劫心義章", "日本", "釋運敞"), // 日本 釋運敞撰
                
                "D8869", Kind.lun.of2("惟教三昧（存卷下　前殘）"), //
                "D8871", Kind.lun.of2("□者眷屬"), //
                
                "D8874", Kind.lun.of3("成實論義記（存卷中　前殘）", "唐", "釋其甲"), // 唐 釋其甲撰
                "D8879", Kind.lun.of3("成唯識論訂正", "明", "釋廣伸"), // 明 釋廣伸撰
                "D8880", Kind.lun.of3("成唯識論述記序釋", "日本", "釋善珠"), // 日本 釋善珠撰
                "D8881", Kind.lun.of3("菩提心論問題", "日本", "釋善珠"), // 日本 釋善珠撰
                "D8882", Kind.lun.of3("菩提心論口筆", "日本", "釋實順"), // 日本 釋實順撰
                "D8883", Kind.lun.of2("百法問答聞書抄"), //
                "D8885", Kind.lun.of3("因明入正理論後記", "清", "吳樹虛"), // 清 吳樹虛撰
                "D8888", Kind.lun.of3("表無表章詮要鈔", "唐", "釋窺基"), // 唐 釋窺基撰
                "D8889", Kind.lun.of3("教相樞要鈔", "日本", "釋高範"), // 日本 釋高範撰
                "D8890", Kind.lun.of3("唐三藏法師唯識量質疑錄", "清", "吳樹虛"), // 清 吳樹虛撰
                "D8891", Kind.lun.of3("表無表章詳體文集", "日本", "釋叡尊"), // 日本 釋叡尊撰
                "D8892", Kind.lun.of3("略述法相義依釋", "日本", "釋高範"), // 日本 釋高範撰
                "D8893", Kind.lun.of3("法宗原私記", "日本", "釋龍謙"), // 日本 釋龍謙撰
                "D8894", Kind.lun.of2("頌義八拔萃"), //
                "D8895", Kind.lun.of3("略述法相義", "日本", "釋良光"), // 日本 釋良光撰
                "D8896", Kind.lun.of3("唯識義", "日本", "釋真興"), // 日本 釋真興撰
                "D8898", Kind.lun.of3("脩大方廣佛華嚴法界觀", "唐", "釋杜順"), // 唐 釋杜順編
                "D8899", Kind.lun.of3("圭峰禪師原人論發微錄", "宋", "釋淨源"), // 宋 釋淨源撰
                "D8903", Kind.lun.of3("天台名目類聚鈔", "日本", "釋貞舜"), // 日本 釋貞舜撰
                "D8904", Kind.lun.of2("西谷名目句解"), //
                "D8905", Kind.lun.of3("選擇傳弘決疑鈔", "日本", "釋良忠"), // 日本 釋良忠撰
                "D8913", Kind.lun.of3("識知淨土論", "日本", "弁阿"), // 日本 弁阿撰
                "D8914", Kind.lun.of2("釋淨土群疑論探要記"), //
                "D8915", Kind.lun.of2("禪門偈（前殘）"), //
                "D8930", Kind.lun.of3("特賜興禪大燈國師參詳語要", "日本", "釋妙超"), // 日本 釋妙超撰
                "D8936", Kind.lun.of3("正信念佛偈私見聞", "日本", "釋空誓"), // 日本 釋空誓撰
                "D8939", Kind.lun.of2("古尊宿語錄"), //
                "D8942", Kind.lun.of3("四家錄", "元", "釋海島"), // 元 釋海島編
                "D8945", Kind.lun.of3("雪峰空和尚外集", "宋", "釋慧空", "釋惠然"), // 宋 釋慧空撰　釋惠然編
                "D8948", Kind.lun.of3("佛國禪師語錄", "元", "釋無學", "釋妙環"), // 元 釋無學撰　釋妙環等編
                "D8951", Kind.lun.of3("如來香", "清", "唐時"), // 清 唐時編

                "D8952", Kind.yiGui.of2("為二太子中元盂蘭薦福文"), //
                "D8953", Kind.yiGui.of2("結壇散食迴向發願文（首尾殘缺）"), //

                "D8954", Kind.lun.of3("儀註備簡", "明", "釋大惠"), // 明 釋大惠撰
                "D8980", Kind.lun.of3("冥樞會要", "宋", "釋祖心"), // 宋 釋祖心編
                "D9000", Kind.lun.of3("空谷集", "明", "釋景隆"), // 明 釋景隆撰
                "D9010", Kind.lun.of3("閱藏隨錄", "明", "王芥庵"), // 明 王芥庵撰
                
                "D9011", Kind.muLu.of2("藏經值畫一目錄"), //
                
                "D9021", Kind.lun.of3("知儒編", "明", "周夢秀"), // 明 周夢秀撰
                
                "D9025", Kind.yinYi.of3("淨土三部經音義集", "日本", "釋信瑞"), // 日本 釋信瑞撰
                
                "D9026", Kind.yiGui.of2("大悲觀世音菩薩至道禮文"), //
                "D9027", Kind.yiGui.of2("道安法師念佛讚文附入山讚文"), //
                "D9031", Kind.yiGui.of3("僧家禮儀文", "朝鮮", "釋冲絢") // 朝鮮 釋冲絢撰
        );
    }

    private static void addF() {
        add(
                "F0016", Kind.jin.of2("大王觀世音經"), //

                "F0041", Kind.lv.of3("比丘尼羯磨經", "劉宋", "求那跋摩"), // 劉宋 求那跋摩譯

                "F0069", Kind.jin.of3("因果本起經", "宋", "求那跋陀羅"), // 宋 求那跋陀羅譯
                "F0088", Kind.jin.of3("佛說灌頂章句拔除過罪生死得度經", "東晉", "帛尸梨密多羅"), // 東晉 帛尸梨密多羅譯
                "F0089", Kind.jin.of3("佛說恒水流樹經", "劉宋", "求那跋陀羅"), // 劉宋 天竺三藏求那跋陀羅譯
                "F0100", Kind.jin.of3("金剛般若波羅蜜經（御注並序）", "唐", "李隆基"), // 唐 玄宗李隆基注

                "F0181", Kind.lun.of2("大般若關"), //

                "F0248", Kind.jin.of2("佛說救護身命經", "道真"), // 比丘道真譯
                "F0546", Kind.jin.of3("大方廣圓覺修多羅了義經（選錄「附文：金剛禮一本」）", "遼", "通理大師"), // 遼 通理大師集
                "F0761", Kind.jin.of3("觀自在菩薩廣大圓滿無礙大悲根本陀羅尼", "唐", "金剛智"), // 唐 南天竺國三藏金剛智譯
                "F1048", Kind.jin.of3("一切如來白傘蓋大佛頂陀羅尼", "唐", "不空"), // 唐 不空譯
                "F1050", Kind.jin.of3("聖千手千眼觀自在菩薩摩訶薩廣大圓滿無礙大悲心陀羅尼", "唐", "不空"), // 唐 不空譯
                "F1056", Kind.jin.of3("梵本般若波羅蜜多心經", "唐", "不空"), // 唐 不空譯
                "F1060", Kind.jin.of3("梵本般若波羅蜜多心經", "宋", "慈賢"), // 宋 慈賢譯
                "F1061", Kind.jin.of3("大隨求陀羅尼", "宋", "慈賢"), // 宋 慈賢譯
                "F1062", Kind.jin.of3("佛頂尊勝陀羅尼", "宋", "慈賢"), // 宋 慈賢譯
                "F1063", Kind.jin.of3("一切如來白傘蓋大佛頂陀羅尼", "宋", "慈賢"), // 宋 慈賢譯
                "F1064", Kind.jin.of3("大悲心陀羅尼", "宋", "慈賢"), // 宋 慈賢譯

                "F1071", Kind.lun.of2("釋教最上乘秘密藏陀羅尼集", "行琳"), // 行琳集
                "F1072", Kind.lun.of2("一切佛菩薩名集", "德雲"), // 德雲集

                "F1076", Kind.lvShi.of2("發菩提心戒", "志仙"), // 石經寺主講經律沙門志仙記

                "F1081", Kind.lun.of2("一乘法界圖合詩一印", "儼法師"), // 儼法師造
                "F1082", Kind.lun.of2("釋華嚴漩澓偈", "惟勁"), // 南岳般舟道場比丘惟勁釋
                "F1083", Kind.lun.of2("漩澓偈",  "杜順法師"), // 杜順法師造
                "F1084", Kind.lun.of2("健拏標訶一乘修行者秘密義記", "釋法藏"), // 大香山隱士釋法藏述
                "F1098", Kind.lun.of2("高上玉皇本行集經髓", "儼法師"), // 儼法師造
                "F1099", Kind.lun.of2("無上玉皇心印經", "杜順法師") // 杜順法師造
        );
    }

    private static void addG() {
        add(
                "G1222", Kind.jin.of3("一字頂輪王瑜伽經", "唐", "不空"), // 唐 不空譯

                "G1977", Kind.lun.of3("科始終心要", "唐", "湛然"), // 唐 湛然述
                "G2073", Kind.lun.of3("大明太宗文皇帝御製文殊讚", "明", "明太宗"), // 明 太宗御製
                "G2075", Kind.lun.of3("御製釋迦牟尼佛讚", "明", "明太宗"), // 明 太宗御製
                "G2084", Kind.lun.of3("坐禪箴", "日本", "道元"), // 日本 道元撰
                "G2086", Kind.lun.of3("三根坐禪說", "日本", "瑩山"), // 日本 瑩山撰
                "GA0002", Kind.lun.of3("洛陽伽藍記集證", "清", "吳若準"), // 清 吳若準集證
                "GA0003", Kind.lun.of3("洛陽伽藍記鉤沈", "民國", "唐晏"), // 民國 唐晏鉤沈
                "GA0004", Kind.lun.of3("洛陽伽藍記合校本", "民國", "張宗祥"), // 民國 張宗祥合校

                "GA0005", Kind.zhi.of3("南朝佛寺志", "清", "孫文川", "陳作霖"), // 清 孫文川撰　陳作霖編
                "GA0008", Kind.zhi.of3("重修普陀山志", "明", "周應賓"), // 明 周應賓撰
                "GA0009", Kind.zhi.of3("普陀洛迦新志", "民國", "王亨彥"), // 民國 王亨彥撰
                "GA0010", Kind.zhi.of3("明州阿育王山志", "明", "郭子章"), // 明 郭子章撰
                "GA0011", Kind.zhi.of3("明州阿育王山續志", "清", "釋畹荃"), // 清 釋畹荃撰
                "GA0012", Kind.zhi.of3("天童寺志", "清", "聞性道", "釋德介"), // 清 聞性道．釋德介撰
                "GA0013", Kind.zhi.of3("七塔寺志", "民國", "陳寥士"), // 民國 陳寥士撰
                "GA0014", Kind.zhi.of3("明州岳林寺志", "清", "戴明琮"), // 清 戴明琮撰
                "GA0015", Kind.zhi.of3("大昭慶律寺志", "清", "吳樹虛"), // 清 吳樹虛撰
                "GA0017", Kind.zhi.of3("玉岑山慧因高麗華嚴教寺志", "明", "李翥", "丁丙"), // 明 李翥撰 清 丁丙補
                "GA0018", Kind.zhi.of3("鳳凰山聖果寺志", "清", "釋超乾"), // 清 釋超乾撰
                "GA0019", Kind.zhi.of3("武林理安寺志", "清", "杭世駿"), // 清 杭世駿撰
                "GA0020", Kind.zhi.of3("龍井見聞錄", "清", "汪孟鋗"), // 清 汪孟鋗撰
                "GA0021", Kind.zhi.of3("武林靈隱寺志", "清", "孫治", "徐增"), // 清 孫治撰　徐增重編
                "GA0022", Kind.zhi.of3("增修雲林寺志", "清", "厲鶚", "張熷"), // 清 厲鶚．張熷撰
                "GA0023", Kind.zhi.of3("雲林寺續志", "清", "沈鑅彪"), // 清 沈鑅彪撰
                "GA0024", Kind.zhi.of3("杭州上天竺講寺志", "明", "釋廣賓"), // 明 釋廣賓撰
                "GA0025", Kind.zhi.of3("雲居聖水寺志", "清", "釋𧧌湛", "釋明倫", "釋通淵", "釋實懿"), // 清 釋𧧌湛．釋明倫原輯　釋通淵．釋實懿重纂
                "GA0027", Kind.zhi.of3("雲棲紀事", "清"), // 清 聞性道．釋德介撰
                "GA0028", Kind.zhi.of3("龍興祥符戒壇寺志", "清", "張大昌"), // 清 張大昌撰
                "GA0029", Kind.zhi.of3("西谿梵隱志", "清", "吳本泰", "釋智一"), // 清 吳本泰撰　釋智一編
                "GA0030", Kind.zhi.of3("崇福寺志", "清", "朱文藻"), // 清 朱文藻撰
                "GA0031", Kind.zhi.of3("續崇福寺志", "清", "章庭棫"), // 清 章庭棫撰
                "GA0032", Kind.zhi.of3("徑山志", "明", "宋奎光"), // 明 宋奎光撰
                "GA0036", Kind.zhi.of3("破山興福寺志", "明", "程嘉燧", "蘇先"), // 明 程嘉燧撰　蘇先繪圖
                "GA0043", Kind.zhi.of3("寒山寺志", "清", "葉昌熾"), // 清 葉昌熾纂
                "GA0049", Kind.zhi.of4("峨眉山志", new String[]{"清", "民國"}, "蔣超", "釋印光"), // 清 蔣超撰 民國 釋印光重修
                "GA0062", Kind.zhi.of3("泉州開元寺志", "明", "釋元賢"), // 明 釋元賢撰
                "GA0077", Kind.zhi.of3("九華山志", "民國", "釋印光"), // 民國 釋印光重修
                "GA0081", Kind.zhi.of3("清涼山志", "民國", "釋印光"), // 民國 釋印光重修
                "GA0084", Kind.zhi.of3("雞足山寺志", "明", "錢邦", "范承勳"), // 明 錢邦纂 清 茫承勳增修
                "GA0086", Kind.zhi.of3("黃檗山寺志", "清", "性幽獨往"), // 清 性幽獨往等編訂續修
                "GA0089", Kind.zhi.of3("天台山方外志", "清", "釋傳燈"), // 清 釋傳燈編撰

                "GAa001", Kind.other.of2("編輯說明", "中華電子佛典協會"), // 中華電子佛典協會

                "GB0109", Kind.lun.of3("徑山集", "明", "釋宗淨"), // 明 釋宗淨集

                "GBa001", Kind.other.of2("編輯說明", "中華電子佛典協會") // 中華電子佛典協會
        );
    }

    private static void addI() {
        add(
                "I0001", Kind.jiLu.of3("宕昌公暉福寺碑", "现代", "顏娟英"), // 顏娟英主編
                "I0002", Kind.jiLu.of3("姚伯多等造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0003", Kind.jiLu.of3("元景造石窟記", "现代", "顏娟英"), // 顏娟英主編
                "I0004", Kind.jiLu.of3("韓貞等造石窟記", "现代", "顏娟英"), // 顏娟英主編
                "I0005", Kind.jiLu.of3("劉未等造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0006", Kind.jiLu.of3("高伏德等三百人造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0007", Kind.jiLu.of3("比丘法雅等千人造九級浮圖碑", "现代", "顏娟英"), // 顏娟英主編
                "I0008", Kind.jiLu.of3("張道智造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0009", Kind.jiLu.of3("高洛周七十人等造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0010", Kind.jiLu.of3("僧暈等造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0011", Kind.jiLu.of3("馮神育等二百廿人造像碑", "现代", "顏娟英"), // 顏娟英主編
                "I0012", Kind.jiLu.of3("嵩顯寺碑", "现代", "顏娟英"), // 顏娟英主編
                "I0013", Kind.jiLu.of3("南石窟寺碑", "现代", "顏娟英"), // 顏娟英主編
                "I0014", Kind.jiLu.of3("比丘郭曇勝造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0015", Kind.jiLu.of3("張安世造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0016", Kind.jiLu.of3("比丘劉僧真等造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0017", Kind.jiLu.of3("夫蒙文慶造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0018", Kind.jiLu.of3("張乾度七十人等造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0019", Kind.jiLu.of3("錡雙胡廿人等造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0020", Kind.jiLu.of3("袁永等五十人造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0021", Kind.jiLu.of3("馬鳴寺根法師碑", "现代", "顏娟英"), // 顏娟英主編
                "I0022", Kind.jiLu.of3("比丘尼統慈慶墓誌銘", "现代", "顏娟英"), // 顏娟英主編
                "I0023", Kind.jiLu.of3("孫遼浮圖銘", "现代", "顏娟英"), // 顏娟英主編
                "I0024", Kind.jiLu.of3("仇臣生造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0025", Kind.jiLu.of3("常煥等造浮圖記", "现代", "顏娟英"), // 顏娟英主編
                "I0026", Kind.jiLu.of3("蔣伯仙造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0027", Kind.jiLu.of3("杜善勝合邑七十人造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0028", Kind.jiLu.of3("大覺寺元尼墓誌銘并序", "现代", "顏娟英"), // 顏娟英主編
                "I0029", Kind.jiLu.of3("僧智薛鳳規等道俗造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0030", Kind.jiLu.of3("廣業寺造像碑", "现代", "顏娟英"), // 顏娟英主編
                "I0031", Kind.jiLu.of3("儁蒙文姬卅一人等造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0032", Kind.jiLu.of3("大魏故昭玄沙門大統令法師墓誌銘", "现代", "顏娟英"), // 顏娟英主編
                "I0033", Kind.jiLu.of3("法義兄弟等二百人造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0034", Kind.jiLu.of3("中岳嵩陽寺碑", "现代", "顏娟英"), // 顏娟英主編
                "I0035", Kind.jiLu.of3("張法壽息榮遷等造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0036", Kind.jiLu.of3("安村道俗一百餘人修塔記", "现代", "顏娟英"), // 顏娟英主編
                "I0037", Kind.jiLu.of3("白實等造中興寺石像記", "现代", "顏娟英"), // 顏娟英主編
                "I0038", Kind.jiLu.of3("僧演造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0039", Kind.jiLu.of3("合邑四十人造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0040", Kind.jiLu.of3("凝禪寺三級浮圖碑", "现代", "顏娟英"), // 顏娟英主編
                "I0041", Kind.jiLu.of3("敬史君碑", "现代", "顏娟英"), // 顏娟英主編
                "I0042", Kind.jiLu.of3("巨始光等造像碑", "现代", "顏娟英"), // 顏娟英主編
                "I0043", Kind.jiLu.of3("李氏合邑造像碑", "现代", "顏娟英"), // 顏娟英主編
                "I0044", Kind.jiLu.of3("李贊邑等邑義五百餘人造像碑", "现代", "顏娟英"), // 顏娟英主編
                "I0045", Kind.jiLu.of3("道俗九十人造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0046", Kind.jiLu.of3("王貳郎法義三百人等造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0047", Kind.jiLu.of3("朱永隆七十人等造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0048", Kind.jiLu.of3("報德玉像七佛頌碑", "现代", "顏娟英"), // 顏娟英主編
                "I0049", Kind.jiLu.of3("杜照賢十三人等造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0050", Kind.jiLu.of3("陳神姜等造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0051", Kind.jiLu.of3("邑子七十人等造大道如來記", "现代", "顏娟英"), // 顏娟英主編
                "I0052", Kind.jiLu.of3("比丘道\uD852\uDEDE造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0053", Kind.jiLu.of3("杜英儁等十四人造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0054", Kind.jiLu.of3("道俗卅七人造經像記", "现代", "顏娟英"), // 顏娟英主編
                "I0055", Kind.jiLu.of3("邢多五十人等造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0056", Kind.jiLu.of3("馬敬賢五十人等造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0057", Kind.jiLu.of3("葉容等造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0058", Kind.jiLu.of3("李清造報德像碑", "现代", "顏娟英"), // 顏娟英主編
                "I0059", Kind.jiLu.of3("郭猛八十人等造塔像記", "现代", "顏娟英"), // 顏娟英主編
                "I0060", Kind.jiLu.of3("趙郡王高叡定國寺碑", "现代", "顏娟英"), // 顏娟英主編
                "I0061", Kind.jiLu.of3("趙郡王高叡修定國寺頌", "现代", "顏娟英"), // 顏娟英主編
                "I0062", Kind.jiLu.of3("靜明等修塔造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0063", Kind.jiLu.of3("劉碑造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0064", Kind.jiLu.of3("強獨樂為周文王造像碑", "现代", "顏娟英"), // 顏娟英主編
                "I0065", Kind.jiLu.of3("宋敬業等造塔記", "现代", "顏娟英"), // 顏娟英主編
                "I0066", Kind.jiLu.of3("魯思明等造寺記", "现代", "顏娟英"), // 顏娟英主編
                "I0067", Kind.jiLu.of3("董黃頭七十人等造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0068", Kind.jiLu.of3("東平郡須昌縣□檀寺造經碑", "现代", "顏娟英"), // 顏娟英主編
                "I0069", Kind.jiLu.of3("方法師鏤石班經記", "现代", "顏娟英"), // 顏娟英主編
                "I0070", Kind.jiLu.of3("周大將軍延壽公碑頌", "现代", "顏娟英"), // 顏娟英主編
                "I0071", Kind.jiLu.of3("陳神忻七十二人等造石室記", "现代", "顏娟英"), // 顏娟英主編
                "I0072", Kind.jiLu.of3("彭城王高浟修寺碑", "现代", "顏娟英"), // 顏娟英主編
                "I0073", Kind.jiLu.of3("標異鄉義慈惠石柱頌", "现代", "顏娟英"), // 顏娟英主編
                "I0074", Kind.jiLu.of3("比丘尼法藏等造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0075", Kind.jiLu.of3("陳榮等三百餘人造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0076", Kind.jiLu.of3("阿鹿交村七十人等造石室像記", "现代", "顏娟英"), // 顏娟英主編
                "I0077", Kind.jiLu.of3("嚴壽等重修故塔記", "现代", "顏娟英"), // 顏娟英主編
                "I0078", Kind.jiLu.of3("比丘道政四十人等造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0079", Kind.jiLu.of3("王氏道俗百人造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0080", Kind.jiLu.of3("郭顯邕等造一切經記", "现代", "顏娟英"), // 顏娟英主編
                "I0081", Kind.jiLu.of3("雷暉嫗造釋迦像記", "现代", "顏娟英"), // 顏娟英主編
                "I0082", Kind.jiLu.of3("陳氏合村造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0083", Kind.jiLu.of3("雷明香造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0084", Kind.jiLu.of3("宋買廿二人等造天宮石像記", "现代", "顏娟英"), // 顏娟英主編
                "I0085", Kind.jiLu.of3("韓永義等造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0086", Kind.jiLu.of3("潘景暉造碑像記", "现代", "顏娟英"), // 顏娟英主編
                "I0087", Kind.jiLu.of3("棲閑寺邑義六十人造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0088", Kind.jiLu.of3("劉氏造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0089", Kind.jiLu.of3("舜禪師等百餘人造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0090", Kind.jiLu.of3("董洪達四十人等造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0091", Kind.jiLu.of3("楊暎香等八十人造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0092", Kind.jiLu.of3("道略等造神碑像記", "现代", "顏娟英"), // 顏娟英主編
                "I0093", Kind.jiLu.of3("永顯寺道端等三百人造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0094", Kind.jiLu.of3("興聖寺四十人等造碑像記", "现代", "顏娟英"), // 顏娟英主編
                "I0095", Kind.jiLu.of3("唐邕刻經記", "现代", "顏娟英"), // 顏娟英主編
                "I0096", Kind.jiLu.of3("馮翊王高潤修平等寺碑", "现代", "顏娟英"), // 顏娟英主編
                "I0097", Kind.jiLu.of3("瓽仲義八十人等造像記", "现代", "顏娟英"), // 顏娟英主編
                "I0098", Kind.jiLu.of3("臨淮王像碑", "现代", "顏娟英"), // 顏娟英主編
                "I0099", Kind.jiLu.of3("建崇寺浮圖銘", "现代", "顏娟英"), // 顏娟英主編
                "I0100", Kind.jiLu.of3("比丘尼圓照圓光造雙像記", "现代", "顏娟英"), // 顏娟英主編
                "Ia001", Kind.jiLu.of3("說明", "现代", "中華電子佛典協會") // 中華電子佛典協會
        );
    }

    private static void addJ() {
        add(
                "JA042", Kind.zhuanJi.of3("大慧普覺禪師年譜", "宋", "祖詠", "張掄", "宗演"), // 宋 祖詠編　張掄序　宗演跋

                "JA123", Kind.lunShi.of3("起信論疏（選錄「科文」）", "宋", "子璿"), // 宋 子璿脩定

                "JA158", Kind.yuLu.of3("密雲禪師語錄", "明", "圓悟", "如瑩"), // 明 圓悟說　如瑩等編

                "JB005", Kind.jinShi.of3("大方廣佛華嚴經普賢行願品別行疏鈔（選錄「華嚴宗七祖行蹟」及「附錄」）", "唐", "澄觀", "宗密"), // 唐 澄觀別行疏　宗密隨疏鈔

                "JB044", Kind.yiGui.of2("諸經日誦集要", "佚名"), // 佚名
                "JB047", Kind.yiGui.of4("瑜伽集要燄口施食儀", new String[]{"唐", "西夏", "清"}, "不空", "不動金剛", "受登"), // 唐 不空譯　西夏 不動金剛重集　清 受登詮次　有圖像四十　緣起

                "JB048", Kind.yinYi.of3("北京五大部直音會韻", "明", "久隱"), // 明 久隱撰

                "JB090", Kind.lun.of3("續原教論", "明", "沈士榮"), // 明 沈士榮著
                "JB091", Kind.lun.of3("道餘錄", "明", "姚廣孝"), // 明 姚廣孝著並序
                "JB095", Kind.lun.of3("蕅益三頌", "明", "智旭"), // 明 智旭述並序　三頌為華嚴．楞嚴．法華　有偶拈問答及重刻自跋
                "JB096", Kind.lun.of3("周易禪解", "明", "智旭"), // 明 智旭著
                "JB097", Kind.lun.of3("天樂鳴空集", "明", "鮑宗肇", "智旭"), // 明 鮑宗肇述　智旭定
                "JB098", Kind.lun.of3("黃蘗無念禪師復問", "明", "深有", "明聞"), // 明 深有撰　明 聞刪定
                "JB103", Kind.lun.of4("寒山子詩集", new String[]{"唐", "明"}, "閭丘胤", "王宗沐"), // 唐 閭丘胤集並序　明 王宗沐序　附拾得．豐干詩
                "JB109", Kind.lun.of3("大藏一覽", "明", "陳實", "姚舜漁"), // 明 陳實編　姚舜漁重輯
                "JB110", Kind.lun.of3("護法錄", "明", "宋濂", "袾宏", "錢謙益"), // 明 宋濂著　袾宏輯　錢謙益訂

                "JB116", Kind.yuLu.of3("憨山老人夢遊全集", "明", "德清", "福善"), // 明 德清撰　福善日錄
                "JB118", Kind.yuLu.of3("密藏開禪師遺稿", "明", "道開"), // 明 道開著

                "JB120", Kind.lun.of3("闢邪集", "明", "鍾始聲", "大朗", "程啟用"), // 明 鍾始聲著　大朗序　文分天學初徵及天學再徵　附書柬四則　程啟用跋
                "JB122", Kind.lun.of3("醒世錄", "清", "徐昌治"), // 清 徐昌治輯

                "JB125", Kind.yuLu.of3("先覺宗乘（選錄「帝王問道錄」）", "明", "郭凝之"), // 明 郭凝之編
                "JB127", Kind.yuLu.of3("無依道人錄", "清", "徐昌治", "超悟", "僧鑑"), // 清 徐昌治著　超悟錄　僧鑑序　附疏稿（原有缺頁）

                "JB128", Kind.lun.of4("普明禪師牧牛圖頌", new String[]{"明", "清"}, "普明", "嚴大參", "如念"), // 明 普明原唱　諸方和韻　嚴大參序　清 如念編目　有圖十
                "JB129", Kind.lun.of4("牧牛圖頌", new String[]{"明", "清"}, "普明", "性音", "納信", "袾宏", "超格", "了彙"), // 明 普明原輯　性音續集舊跋　清 納信序　明 袾宏序　清 超格序　乾隆四十九年了彙重刊

                "JB134", Kind.yuLu.of4("五家語錄（選錄）", new String[]{"唐", "明"}, "慧然", "郭凝之"), // 唐 慧然集　明 郭凝之重訂

                "JB135", Kind.lun.of3("石門文字禪", "宋", "德洪"), // 宋 德洪著　原書缺　依民國十年常州天寧寺刻本印

                "JB137", Kind.yuLu.of3("趙州和尚語錄", "唐", "從諗", "文遠", "大參", "明聲"), // 唐 從諗說　文遠記　大參重校　明聲重刻
                "JB138", Kind.yuLu.of3("雲門匡真禪師語錄", "南漢", "文偃", "守堅"), // 南漢 文偃說　守堅編
                "JB154", Kind.yuLu.of3("松隱唯菴然和尚語錄", "明", "德然", "慧省"), // 明 德然說　慧省編次
                "JB155", Kind.yuLu.of3("無趣老人語錄", "明", "如空", "性沖"), // 明 如空說　性沖編
                "JB156", Kind.yuLu.of3("無幻禪師語錄", "明", "性沖", "慧廣"), // 明 性沖說　慧廣編集
                "JB159", Kind.yuLu.of3("天真毒峰善禪師要語", "明", "本善", "悟深"), // 明 本善記　悟深編
                "JB163", Kind.yuLu.of3("古庭禪師語錄輯略", "明", "善堅"), // 明 善堅說　各卷首皆題曹溪一滴古庭禪師語錄
                "JB164", Kind.yuLu.of3("曹溪一滴", "明", "周理"), // 明 周理編　附夢語摘要
                "JB165", Kind.yuLu.of3("大巍禪師竹室集", "明", "淨倫", "周理"), // 明 淨倫撰　周理輯　內題曹溪一滴卷六
                "JB166", Kind.yuLu.of3("浮山法句", "明", "本智", "周理"), // 明 本智撰　周理輯　內題曹溪一滴卷七　前有明 吳應賓塔銘及王舜鼎夢禪語
                "JB167", Kind.yuLu.of3("徹庸和尚谷響集", "明", "徹庸", "洪如"), // 明 徹庸撰　洪如錄　內題曹溪一滴卷八　後附淨土偈一卷
                "JB171", Kind.yuLu.of3("天隱和尚語錄", "明", "圓修", "通問"), // 明 圓修說　通問等編
                "JB173", Kind.yuLu.of3("壽昌無明和尚語錄", "明", "慧經", "元來"), // 明 慧經說　元來集
                "JB174", Kind.yuLu.of3("天界覺浪盛禪師語錄", "明", "道盛", "大成", "大奇"), // 明 道盛說　大成．大奇等編
                "JB175", Kind.yuLu.of4("大溈五峰學禪師語錄", new String[]{"明", "清"}, "如學", "智海", "周堪賡", "陶汝鼐"), // 明 如學說　清 智海重刻　周堪賡序　有行實　明 陶汝鼐塔銘
                "JB176", Kind.yuLu.of3("大溈密印寺養拙明禪師語錄", "清", "正明", "智海", "通雲", "陶之典", "周堪賡"), // 清 正明說　智海編　通雲序　陶之典序　有行實　周堪賡塔銘　附大溈四記一卷
                "JB177", Kind.yuLu.of3("破山禪師語錄", "清", "海明", "印正", "印巒", "印綬"), // 清 海明說　印正等編　附年譜　印巒等輯　印綬等編　原書缺依駒本印
                "JB178", Kind.yuLu.of3("費隱禪師語錄", "明", "通容", "隆琦", "行觀", "王谷", "徐昌治", "董行", "行宗", "行古"), // 明 通容說　隆琦等編　附紀年錄　行觀．王谷同集　徐昌治．董行證較　行宗．行古重訂刻
                "JB180", Kind.yuLu.of3("天童弘覺忞禪師北遊集", "清", "道忞", "真樸"), // 清 道忞說　真樸編次
                "JB181", Kind.yuLu.of3("布水臺集", "明", "道忞"), // 明 道忞著（中央圖書館善本書目編在集部別集類）
                "JB182", Kind.yuLu.of3("萬如禪師語錄", "清", "通微", "行猷"), // 清 通微說　行猷等編
                "JB183", Kind.yuLu.of3("雪竇石奇禪師語錄", "清", "通雲", "行正"), // 清 通雲說　行正等編錄
                "JB184", Kind.yuLu.of3("牧雲和尚七會語錄", "清", "通門", "行瑋"), // 清 通門說　行瑋等編
                "JB185", Kind.yuLu.of3("浮石禪師語錄", "明", "通賢", "行浚"), // 明 通賢說　行浚等編
                "JB186", Kind.yuLu.of3("林野奇禪師語錄", "明", "通奇", "行謐"), // 明 通奇說　行謐等編
                "JB187", Kind.yuLu.of3("天岸昇禪師語錄", "清", "天岸昇禪師", "元玉"), // 清 昇說　元玉等記錄
                "JB188", Kind.yuLu.of3("入就瑞白禪師語錄", "明", "明雪", "寂蘊"), // 明 明雪說　寂蘊編
                "JB189", Kind.yuLu.of3("三宜盂禪師語錄", "明", "明盂", "淨範"), // 明 明盂說　淨範等編
                "JB190", Kind.yuLu.of3("石雨禪師法檀", "明", "明方", "淨柱"), // 明 明方說　淨柱編
                "JB191", Kind.yuLu.of3("象田即念禪師語錄", "明", "淨現", "淨癡"), // 明 淨現說　淨癡等錄
                "JB192", Kind.yuLu.of3("大休珠禪師語錄", "清", "大休珠禪師", "廣熙"), // 清 珠說　廣熙等錄
                "JB193", Kind.yuLu.of3("隱元禪師語錄", "清", "隆琦", "海寧"), // 清 隆琦說　海寧等編
                "JB194", Kind.yuLu.of3("昭覺丈雪醉禪師語錄", "清", "通醉", "徹綱"), // 清 通醉說　徹綱等編
                "JB196", Kind.yuLu.of3("鴛湖用禪師語錄", "清", "妙用", "悟進", "悟元"), // 清 妙用說　悟進．悟元等編
                "JB197", Kind.yuLu.of3("博山無異大師語錄集要", "明", "元來", "成正", "元賢"), // 明 元來說　成正錄　元賢集
                "JB198", Kind.yuLu.of3("雪關禪師語錄", "明", "智誾", "成巒", "開詗"), // 明 智誾說　成巒等錄　開詗編
                "JB199", Kind.yuLu.of3("雪關和尚語錄", "明", "智誾", "傳善"), // 明 智誾說　傳善輯
                "JB200", Kind.yuLu.of3("石霜爾瞻尊禪師語錄", "清", "達尊", "本開"), // 清 達尊說　本開等記錄
                "JB202", Kind.yuLu.of3("百癡禪師語錄", "清", "元禪師", "超宣"), // 清 元說　超宣等編
                "JB203", Kind.yuLu.of3("雲峨喜禪師語錄", "清", "雲峨喜禪師", "智恒"), // 清 喜說　智恒等編
                "JB204", Kind.yuLu.of3("斌雅禪師語錄", "清", "斌雅禪師", "海岳"), // 清 鑑說　海岳記錄
                "JB205", Kind.yuLu.of3("介為舟禪師語錄", "清", "行舟", "海鹽", "益證"), // 清 行舟說　海鹽．益證等編
                "JB206", Kind.yuLu.of3("笑堂和尚語錄", "清", "笑堂和尚", "超源", "超晙"), // 清 說　超源等記錄　超晙等編
                "JB207", Kind.yuLu.of3("古瓶山牧道者究心錄", "明", "真本", "機峻"), // 明 真本說　機峻等編
                "JB208", Kind.yuLu.of3("古雪哲禪師語錄", "明", "真哲", "傳我"), // 明 真哲說　傳我等編
                "JB209", Kind.yuLu.of3("永濟融禪師語錄", "清", "永濟融禪師", "師住", "妙印"), // 清 融說　師住．妙印等錄
                "JB210", Kind.yuLu.of3("伏獅祇園禪師語錄", "清", "行剛", "授遠", "超宿"), // 清 行剛（尼）說　授遠．超宿等編
                "JB211", Kind.yuLu.of3("季總徹禪師語錄", "清", "季總徹禪師", "超祥"), // 清 徹（尼）說　超祥記錄
                "JB212", Kind.yuLu.of3("二隱謐禪師語錄", "清", "二隱謐禪師", "超巨", "超秀"), // 清 謐說　超巨．超秀等編
                "JB213", Kind.yuLu.of3("芝巖秀禪師語錄", "清", "芝巖秀禪師", "明一"), // 清 秀說　明一等編
                "JB214", Kind.yuLu.of3("蕅益大師佛學十種（選錄「性學開蒙」．「梵室偶談」兩種）", "明", "智旭"), // 明 智旭著

                "JB215", Kind.lun.of3("頌古合響集", "明", "徹（尼）", "符（尼）", "張有譽"), // 明 徹（尼）．符（尼）合頌　張有譽輯並序
                "JB216", Kind.lun.of3("絕餘編", "明", "智旭", "圓果"), // 明 智旭著　圓果錄

                "JB218", Kind.yuLu.of3("懶石聆禪師語錄", "清", "懶石聆禪師", "海瑞"), // 清 聆說　海瑞等錄
                "JB219", Kind.yuLu.of3("紫竹林顓愚衡和尚語錄", "清", "觀衡", "正印"), // 清 觀衡說　正印重編
                "JB220", Kind.yuLu.of3("法璽印禪師語錄", "清", "法璽印禪師", "性圓"), // 清 印說　性圓等編
                "JB221", Kind.yuLu.of3("楞嚴法璽印禪師語錄", "清", "法璽印禪師", "旋性"), // 清 印說　旋性記錄
                "JB222", Kind.yuLu.of3("夔州臥龍字水禪師語錄", "明", "圓䂐", "觀誰"), // 明 圓䂐說　觀誰等錄
                "JB223", Kind.yuLu.of3("山暉禪師語錄", "清", "山暉禪師", "如崇", "宗上"), // 清 璧說　如崇等錄　宗上編
                "JB224", Kind.yuLu.of3("嵩山野竹禪師錄", "清", "福慧", "宗宏", "宗上", "宗堅"), // 清 福慧說　宗宏錄　宗上．宗堅仝編
                "JB225", Kind.yuLu.of3("鄂州龍光達夫禪師雞肋集", "清", "蘊上", "道汜", "道沖"), // 清 蘊上說　道汜．道沖等錄（依駒本印）

                "JB226", Kind.lun.of3("頌古鉤鉅", "清", "蘊上", "蘊宏"), // 清 蘊上頌并跋　蘊宏著語（依駒本印）
                "JB227", Kind.lun.of3("集文字禪", "清", "蘊上", "舒峻極", "杜國柱"), // 清 蘊上著　舒峻極序　杜國柱序（依駒本印）

                "JB229", Kind.yuLu.of3("法瀾澂禪師語錄", "清", "原澂", "清杲"), // 清 原澂說　清杲編次（依駒本印）
                "JB230", Kind.yuLu.of3("天王水鑑海和尚六會錄", "清", "慧海", "原澂"), // 清 慧海說　原澂等編（依駒本印）
                "JB231", Kind.yuLu.of3("天王水鑑海和尚五會錄", "清", "慧海", "原澂"), // 清 慧海說　原澂等編
                "JB232", Kind.yuLu.of3("天王水鑑海和尚住金粟語錄", "清", "慧海", "原澂", "原上"), // 清 慧海說　原澂．原上等編
                "JB233", Kind.yuLu.of3("介菴進禪師語錄", "清", "悟進", "真理"), // 清 悟進說　真理等編　附源流頌
                "JB234", Kind.yuLu.of3("一初元禪師語錄", "清", "一初元禪師", "真開", "真智"), // 清 元說　真開．真智等編
                "JB235", Kind.yuLu.of3("蓮月禪師語錄", "清", "道正", "性容"), // 清 道正說　性容等錄
                "JB236", Kind.yuLu.of3("玉泉蓮月正禪師語錄", "清", "道正", "發慧"), // 清 道正說　發慧等錄
                "JB237", Kind.yuLu.of3("月幢了禪師語錄", "清", "月幢了禪師", "達最"), // 清 了說　達最等編
                "JB238", Kind.yuLu.of3("聚雲吹萬真禪師語錄", "明", "廣真", "燈來"), // 明 廣真說　燈來編
                "JB239", Kind.yuLu.of3("吹萬禪師語錄", "明", "廣真", "燈來"), // 明 廣真說　燈來重編（依駒本印）
                "JB240", Kind.yuLu.of3("慶忠鐵壁機禪師語錄", "明", "慧機", "燈來"), // 明 慧機說　燈來編
                "JB241", Kind.yuLu.of3("慶忠鐵壁機禪師語錄", "明", "慧機", "幻敏"), // 明 慧機說　幻敏重編（依駒本印）
                "JB242", Kind.yuLu.of3("鐵眉三巴掌禪師語錄", "明", "鐵眉三巴掌禪師", "性養", "性亮"), // 明 鐵眉號三巴掌說　性養．性亮同編
                "JB243", Kind.yuLu.of3("耳庵嵩禪師語錄", "清", "耳庵嵩禪師", "性愷", "徐善"), // 清 嵩說　性愷編　徐善序　有附記
                "JB244", Kind.yuLu.of3("三山來禪師語錄", "清", "燈來", "普定"), // 清 燈來說　普定編（原目二十八卷　卷十七下註有「嗣刻」二字　此為初刻本）

                "JB245", Kind.zhuanJi.of3("高峰三山來禪師年譜", "清", "性統", "至善"), // 清 性統編　至善序（依駒本印）

                "JB246", Kind.yuLu.of3("嘉興退菴斷愚智禪師語錄", "清", "嘉興退菴斷愚智禪師", "機輪"), // 清 智說　機輪等編
                "JB247", Kind.yuLu.of3("普光坦菴禪師語錄", "清", "機峻", "全弘", "羅開麟"), // 清 機峻說　全弘錄　羅開麟序（依駒本印）
                "JB248", Kind.yuLu.of3("達變權禪師語錄", "清", "顯權", "海澂"), // 清 顯權說　海澂錄
                "JB249", Kind.yuLu.of3("方融璽禪師語錄", "清", "如璽", "興林"), // 清 如璽說　興林等編　附淨土詩

                "JB259", Kind.lunShi.of3("怡山禮佛發願文略釋", "清", "書玉"), // 清 書玉略釋並序跋　有事義（依駒本印）
                "JB260", Kind.lunShi.of3("大懺悔文略解", "清", "書玉"), // 清 書玉略解（依駒本印）

                "JB267", Kind.lun.of3("牧雲和尚嬾齋別集", "明", "通明", "毛晉"), // 明 通明撰　毛晉編
                "JB268", Kind.lun.of3("牧雲和尚宗本投機頌", "明", "通明"), // 明 通明撰　附病遊遊刃．病遊初草．病遊後草

                "JB269", Kind.jinShi.of4("金剛般若經疏論纂要刊定記會編", new String[]{"唐", "宋", "清"}, "宗密", "子璿", "行策"), // 唐 宗密述疏　宋 子璿錄記　清 行策會編

                "JB271", Kind.lun.of3("閱藏知津", "明", "智旭"), // 明 智旭彙輯　總目四卷

                "JB272", Kind.yuLu.of3("明州天童景德禪寺宏智覺禪師語錄", "宋", "正覺", "淨啟"), // 宋 正覺說　淨啟重編
                "JB273", Kind.yuLu.of3("千巖和尚語錄", "元", "元長", "嗣詔"), // 元 元長說　嗣詔錄
                "JB275", Kind.yuLu.of3("興善南明廣禪師語錄", "明", "慧廣", "妙用", "悟進", "明方", "黃承昊"), // 明 慧廣說　妙用集　悟進重輯並跋　明方序　黃承昊序　有行狀
                "JB276", Kind.yuLu.of3("不會禪師語錄", "清", "法通", "性靈"), // 清 法通說　性靈等編（依駒本印）
                "JB277", Kind.yuLu.of3("雲棲法彙（選錄）", "明", "袾宏"), // 明 袾宏著（原本多缺　依金陵本補印　並補後增讚序等文　凡補印者　於該條目上作△以志之）

                "JB279", Kind.lunShi.of3("虛舟禪師註八識規矩頌", "清", "行省"), // 清 行省撰

                "JB280", Kind.yuLu.of3("神鼎雲外澤禪師語錄", "清", "行澤", "宏怤"), // 清 行澤說　宏怤等編（依駒本印）
                "JB281", Kind.yuLu.of3("壇溪梓舟船禪師語錄", "明", "壇溪梓舟船禪師", "明法"), // 明 船說　明法等編（依駒本印）
                "JB282", Kind.yuLu.of3("虛舟省禪師語錄", "清", "行省", "超直"), // 清 行省說　超直等編（依駒本印）

                "JB283", Kind.lun.of4("天台三聖詩集和韻", new String[]{"元", "清"}, "梵琦", "福慧"), // 元 梵琦首和　清 福慧重和

                "JB284", Kind.yuLu.of3("益州嵩山野竹禪師後錄", "清", "福慧", "洪希"), // 清 福慧說　洪希等編
                "JB285", Kind.yuLu.of3("兜率不磷堅禪師語錄", "清", "宗堅", "妙聖"), // 清 宗堅說　妙聖等記
                "JB286", Kind.yuLu.of3("攖寧靜禪師語錄", "清", "智靜", "德亮", "德峨"), // 清 智靜說　德亮等編　德莪等錄
                "JB287", Kind.yuLu.of3("自閒覺禪師語錄", "清", "自閒覺禪師", "洪暹"), // 清 覺說　洪暹等編
                "JB288", Kind.yuLu.of3("憨予暹禪師語錄", "清", "洪暹", "法雲"), // 清 洪暹說　法雲等編

                "JB293", Kind.lun.of3("擬寒山詩", "明", "張守約", "唐守禮", "蔡善繼"), // 明 張守約追擬並序　唐守禮序　蔡善繼序（依駒本印）

                "JB294", Kind.yuLu.of3("雲溪俍亭挺禪師語錄", "清", "淨挺", "智淙"), // 清 淨挺說　智淙等編

                "JB295", Kind.lun.of3("學佛考訓", "清", "淨挺"), // 清 淨挺輯
                "JB296", Kind.lun.of3("漆園指通", "清", "淨挺"), // 清 淨挺著

                "JB298", Kind.yuLu.of3("屾峰憲禪師語錄", "清", "屾峰憲禪師", "智質", "智原"), // 清 憲說　智質．智原同編（依駒本印）
                "JB299", Kind.yuLu.of3("三峰藏和尚語錄", "明", "法藏", "弘儲"), // 明 法藏說　弘儲記　後附年譜一卷．南嶽勒古一卷
                "JB300", Kind.yuLu.of3("朝宗禪師語錄", "明", "通忍", "行導"), // 明 通忍說　行導編（依駒本印）
                "JB301", Kind.yuLu.of3("南嶽繼起和尚語錄", "清", "弘儲", "濟璣"), // 清 弘儲說　濟機等編
                "JB303", Kind.yuLu.of3("燮雲璣禪師國清無畏堂語錄", "清", "濟璣", "玄杲", "張有譽"), // 清 濟璣說　玄杲錄　張有譽序
                "JB304", Kind.yuLu.of3("靈樹遠禪師雲嵒集", "清", "靈樹遠禪師", "廣仍", "余懷"), // 清 僧遠說　廣仍記　附雲嵒頌古　附雲嵒九頌　余懷製
                "JB305", Kind.yuLu.of3("國清大庾韜禪師語錄", "清", "行韜", "顯裕"), // 清 行韜說　顯裕等錄　有塔銘　行略（依駒本印）
                "JB306", Kind.yuLu.of3("內紹種禪師語錄", "清", "內紹種禪師", "照維"), // 清 種說　照維等記　附頌古
                "JB308", Kind.yuLu.of3("象崖珽禪師語錄", "清", "性珽", "益聞"), // 清 性珽說　益聞重刊
                "JB309", Kind.yuLu.of3("雲腹智禪師語錄", "清", "道智", "嶽賢", "聯昇"), // 清 道智說　嶽賢．聯昇記錄
                "JB310", Kind.yuLu.of3("雲叟住禪師語錄", "清", "雲叟住禪師", "元一"), // 清 住說　元一記錄
                "JB311", Kind.yuLu.of3("天界覺浪盛禪師全錄", "明", "道盛", "大成", "大然"), // 明 道盛說　大成．大然等較　後附杖門隨集
                "JB312", Kind.yuLu.of3("天界覺浪盛禪師嘉禾語錄", "明", "道盛", "大樞", "大英", "譚貞默"), // 明 道盛說　大樞．大英錄　譚貞默序
                "JB313", Kind.yuLu.of3("青原愚者智禪師語錄", "清", "青原愚者智禪師", "興磬", "興斧"), // 清 智說　興磬．興斧編

                "JB325", Kind.lun.of3("解惑篇", "清", "弘贊"), // 清 弘贊編（依駒本印）
                "JB326", Kind.lun.of3("木人剩稿", "清", "弘贊", "開溈"), // 清 弘贊編　開溈錄

                "JB336", Kind.yuLu.of3("南海寶象林慧弓詗禪師語錄", "清", "開詗", "傳一"), // 清 開詗說　傳一等錄
                "JB337", Kind.yuLu.of3("寶持總禪師語錄", "清", "寶持玄總", "明英"), // 清 玄總（尼）說　明英等記
                "JB338", Kind.yuLu.of3("靈瑞尼祖揆符禪師妙湛錄", "清", "靈瑞尼祖揆符禪師", "師炤"), // 清 符（尼）說　師炤等記
                "JB339", Kind.yuLu.of3("靈瑞禪師嵒華集", "清", "靈瑞禪師", "振澂"), // 清 符（尼）說　振澂等記
                "JB340", Kind.yuLu.of3("慧覺衣禪師語錄", "清", "照衣", "徹御"), // 清 照衣說　徹御等編
                "JB341", Kind.yuLu.of3("佛語御禪師語錄", "清", "徹御", "法傑", "法秀", "聖可"), // 清 徹御說　法傑．法秀等編　聖可序
                "JB342", Kind.yuLu.of3("華嚴聖可禪師語錄", "清", "德玉", "光佛"), // 清 德玉說　光佛等編
                "JB343", Kind.yuLu.of3("廣福山勝覺寺密印禪師語錄", "清", "真傳", "如暐"), // 清 真傳說　如暐等編
                "JB345", Kind.yuLu.of3("蘇州竹庵衍禪師語錄", "清", "真衍", "機如"), // 清 真衍說　機如編
                "JB346", Kind.yuLu.of3("古林如禪師語錄", "清", "機如", "全威"), // 清 機如說　全威等記錄

                "JB348", Kind.lun.of3("靈峰蕅益大師宗論", "明", "智旭"), // 明 智旭著
                "JB351", Kind.lun.of3("道德經順硃", "清", "德玉"), // 清 德玉順硃

                "JB352", Kind.yuLu.of3("東山破峰重禪師語錄", "清", "普重", "傳慧"), // 清 普重說　傳慧等編
                "JB353", Kind.yuLu.of3("雲幻宸禪師語錄", "清", "印宸", "發林", "王民皞", "李道泰"), // 清 印宸說　發林等編　王民皞序　李道泰塔記
                "JB354", Kind.yuLu.of3("錦屏破石卓禪師雜著", "明", "悟卓", "超常", "發林"), // 明 悟卓說　超常記錄　發林行狀
                "JB355", Kind.yuLu.of3("綠蘿恒秀林禪師語錄", "清", "發林", "光悠"), // 清 發林說　光悠等編
                "JB356", Kind.yuLu.of3("奇然智禪師語錄", "清", "超智", "明林", "明燦"), // 清 超智說　明林．明燦等編
                "JB357", Kind.yuLu.of3("秀野林禪師語錄", "清", "明林", "最正"), // 清 明林說　最正等編
                "JB358", Kind.yuLu.of3("智覃正禪師語錄", "清", "最正", "尚能", "尚瑩"), // 清 最正說　尚能．尚瑩等編　末附助緣耆德
                "JB359", Kind.yuLu.of3("百愚禪師語錄", "清", "淨斯", "智操", "智海", "智朴", "方拱乾"), // 清 淨斯說　智操．智海等編語錄　智朴．方拱乾等編蔓堂集　附蔓堂集
                "JB362", Kind.yuLu.of3("觀濤奇禪師語錄", "清", "大奇", "興舒"), // 清 大奇說　興舒等編
                "JB363", Kind.yuLu.of3("文穆念禪師語錄", "清", "念說", "真慧"), // 清 念說　真慧等編
                "JB364", Kind.yuLu.of3("佛古聞禪師語錄", "清", "行聞", "超質"), // 清 行聞說　超質等編
                "JB365", Kind.yuLu.of3("石璞質禪師語錄", "清", "超質", "明嵩"), // 清 超質說　明嵩等編
                "JB366", Kind.yuLu.of3("大方禪師語錄", "明", "行海", "超鳴"), // 明 行海說　超鳴編
                "JB367", Kind.yuLu.of3("寂光豁禪師語錄", "清", "寂光豁禪師", "發育"), // 清 豁說　發育等編
                "JB368", Kind.yuLu.of3("天台通玄寺獨朗禪師語錄", "清", "行日", "超心", "超香"), // 清 行曰說　超心．超香等編
                "JB369", Kind.yuLu.of3("蔗菴範禪師語錄", "清", "淨範", "智璋"), // 清 淨範說　智璋等錄
                "JB370", Kind.yuLu.of3("草堂耨雲實禪師語錄", "清", "真實", "寂訥"), // 清 真實說　寂訥等編（依駒本印）
                "JB371", Kind.yuLu.of3("佛冤禪師語錄", "清", "徹綱", "性純"), // 清 徹綱說　性純等編（依駒本印）
                "JB372", Kind.yuLu.of3("印心佛敏訥禪師語錄", "清", "寂納", "法棟", "法通"), // 清 寂納說　法棟等錄　法通等編（依駒本印）
                "JB383", Kind.yuLu.of2("憨休禪師語錄", "繼堯"), // 繼堯等編
                "JB384", Kind.yuLu.of3("憨休禪師敲空遺響", "清", "如乾", "張恂", "繼堯"), // 清 如乾說　張恂編閱　繼堯校訂（依駒本印）
                "JB386", Kind.yuLu.of3("遠菴僼禪師語錄", "清", "本僼", "元視"), // 清 本僼說　元視等編（依駒本印）
                "JB387", Kind.yuLu.of3("古宿尊禪師語錄", "清", "古宿尊禪師", "明圓"), // 清 尊說　明圓等編（依駒本印）
                "JB388", Kind.yuLu.of3("神鼎一揆禪師語錄", "清", "元揆", "成炯"), // 清 元揆說　成炯等編（依駒本印）
                "JB389", Kind.yuLu.of3("洪山俞昭允汾禪師語錄", "清", "允汾", "上睿"), // 清 允汾說　上睿等編（依駒本印）
                "JB390", Kind.yuLu.of3("北京楚林禪師語錄", "清", "上睿", "照琮"), // 清 上睿說　照琮等錄（依駒本印）
                "JB391", Kind.yuLu.of3("長目電禪師語錄", "清", "光電", "悟本"), // 清 光電說　悟本編（依駒本印）
                "JB392", Kind.yuLu.of3("寒松操禪師語錄", "清", "智操", "德昊"), // 清 智操說　德昊編（依駒本印）
                "JB393", Kind.yuLu.of3("華巖還初佛禪師語錄", "清", "華巖還初佛禪師", "通量"), // 清 佛說　通量等編（依駒本印）
                "JB394", Kind.yuLu.of3("翼菴禪師語錄", "清", "善酇", "序燈", "序璋", "力端"), // 清 善酇說　分為國清語錄二卷　序燈等記　真如語錄三卷　序璋等記　通玄語錄一卷　力端等錄　和寒山詩二卷（依駒本印）
                "JB395", Kind.yuLu.of3("荊南內護國寺啟真誠禪師語錄", "清", "啟真誠禪師", "振聞"), // 清 誠說　振聞編（依駒本印）
                "JB396", Kind.yuLu.of3("終南山蟠龍子肅禪師語錄", "清", "超遠", "性明", "海闊"), // 清 超遠說　性明編　海闊等錄（依駒本印）
                "JB399", Kind.yuLu.of3("鶴林天樹植禪師語錄", "清", "行植", "湛祐"), // 清 行植說　湛祐編（依駒本印）
                "JB400", Kind.yuLu.of3("知空蘊禪師語錄", "清", "學蘊", "通來"), // 清 學蘊說　通來等編（依駒本印）
                "JB401", Kind.yuLu.of3("浦峰長明炅禪師語錄", "清", "性炅", "海棟"), // 清 性炅說　海棟編（依駒本印）
                "JB402", Kind.yuLu.of3("浦峰法柱棟禪師語錄", "清", "海棟", "慧昇", "慧渠", "慧岱"), // 清 海棟說　慧昇集　慧渠編　慧岱錄（依駒本印）
                "JB406", Kind.yuLu.of3("廬山天然禪師語錄", "明", "函昰", "今辯"), // 明 函昰說　今辯重編（依駒本印）
                "JB407", Kind.yuLu.of3("千山剩人禪師語錄", "明", "函可", "元賦", "今羞", "今盧", "今又"), // 明 函可說　元賦等編　今羞等錄　今盧．今又重梓（依駒本印）
                "JB408", Kind.yuLu.of3("海幢阿字無禪師語錄", "清", "今無", "今辯"), // 清 今無說　今辯重編（依駒本印）
                "JB409", Kind.yuLu.of3("丹霞澹歸禪師語錄", "明", "今釋", "今辯"), // 明 今釋說　今辯重編（依駒本印）
                "JB410", Kind.yuLu.of3("蓮峰禪師語錄", "清", "蓮峰禪師", "性深"), // 清 素說　性深等編（依駒本印）
                "JB411", Kind.yuLu.of3("德風禪師般若語錄", "清", "德風禪師", "如惺"), // 清 說　如惺等編（依駒本印）
                "JB412", Kind.yuLu.of3("三塔主峰禪師語錄", "清", "三塔主峰禪師", "覺海", "譚貞默"), // 清 說　覺海錄　譚貞默等請啟（依駒本印）
                "JB413", Kind.yuLu.of3("黃蓮東巖禪師語錄", "清", "黃蓮東巖禪師", "機琇", "黎元寬", "文德翼"), // 清 說　機琇記錄　黎元寬序　文德翼序　內分黃蓮語錄　蘄州語錄　有行實　末附懷淨土偈（依駒本印）
                "JB414", Kind.yuLu.of3("山鐸真在禪師語錄", "清", "真在", "機雲", "智旭"), // 清 真在說　機雲．智旭等錄（依駒本印）
                "JB415", Kind.yuLu.of3("大悲妙雲禪師語錄", "清", "真雄", "機德"), // 清 真雄說　機德等編（依駒本印）
                "JB416", Kind.yuLu.of3("調實居士證源錄", "清", "陸瑛", "羅機徹", "羅開驎", "佚名"), // 清 陸瑛說　羅機徹編　羅開驎序　佚名序（末頁缺）　有行略（依駒本印）
                "JB417", Kind.yuLu.of3("天則能禪師語錄", "清", "機能", "道崇", "續彌", "羅開驎", "機雲"), // 清 機能說　道崇．續彌同錄　羅開驎序　機雲序　有行略（依駒本印）
                "JB418", Kind.yuLu.of3("晦嶽旭禪師語錄", "清", "晦嶽旭禪師", "全琳"), // 清 旭說　全琳等錄（依駒本印）
                "JB419", Kind.yuLu.of3("華嚴不厭樂禪師語錄", "清", "道樂", "德普"), // 清 道樂說　德普記錄（依駒本印）
                "JB420", Kind.yuLu.of3("三峰半水元禪師語錄", "清", "三峰半水元禪師", "光深", "華嚴玉"), // 清 元說　光深等錄　華嚴玉序（依駒本印）
                "JB421", Kind.yuLu.of3("鶴峰禪師語錄", "清", "濟悟", "上震"), // 清 濟悟說　上震等編（依駒本印）
                "JB422", Kind.yuLu.of3("林我禪師語錄", "清", "林我禪師", "海錱", "海茲"), // 清 鑑說　海錱．海茲等編錄（依駒本印）
                "JB423", Kind.yuLu.of3("石關禪師語錄", "清", "石關禪師", "芳桂"), // 清 說　芳桂等編（依駒本印）
                "JB424", Kind.yuLu.of3("香嚴禪師語錄", "清", "香嚴禪師", "明耀", "葉燮"), // 清 說　明耀等編錄　葉燮序　有行實（依駒本印）
                "JB425", Kind.yuLu.of3("即非禪師全錄", "清", "如一", "明洞"), // 清 如一說　明洞等編（依駒本印）　附佛祖圖
                "JB427", Kind.yuLu.of3("青城竹浪生禪師語錄", "清", "徹生", "如鵬"), // 清 徹生說　如鵬等編（依駒本印）
                "JB428", Kind.yuLu.of3("密行忍禪師語錄", "清", "寂忍", "明廣", "明珍"), // 清 寂忍說　明廣．明珍等編（依駒本印）　附嗣燈錄
                "JB429", Kind.yuLu.of3("盛京奉天般若古林禪師語錄", "清", "古林禪師", "正繼", "正燈"), // 清 智說　正繼等錄　正燈等編（依駒本印）
                "JB430", Kind.yuLu.of3("玉泉其白富禪師語錄", "清", "德富", "圓頂"), // 清 德富說　圓頂等編（依駒本印）　附融徹錄
                "JB431", Kind.yuLu.of3("雲峰體宗寧禪師語錄", "清", "雲峰體宗寧禪師", "續清", "德玉", "徹生"), // 清 寧說　續清等編　德玉序　徹生序　有行實（依駒本印）
                "JB432", Kind.yuLu.of3("幻住明禪師語錄", "清", "幻住明禪師", "清尚"), // 清 明說　清尚等編（依駒本印）
                "JB433", Kind.yuLu.of3("純備德禪師語錄", "清", "廣德", "智遠"), // 清 廣德說　智遠等編（依駒本印）
                "JB434", Kind.yuLu.of3("法幢遠禪師語錄", "清", "智遠", "通慧", "弘源"), // 清 智遠說　通慧等編　弘源序（依駒本印）
                "JB435", Kind.yuLu.of3("伏獅義公禪師語錄", "清", "伏獅義公禪師", "明元", "高以永", "超琛"), // 清 （尼）說　明元記錄　高以永序　超琛跋　有行狀（依駒本印　原書第十七　十八兩頁缺）
                "JB436", Kind.yuLu.of3("參同一揆禪師語錄", "清", "超琛", "普明", "明俊"), // 清 超琛（尼）說　普明編　明俊錄（依駒本印）
                "JB438", Kind.yuLu.of3("衡山禪師語錄", "清", "燈炳", "宗位", "超源", "藍理"), // 清 燈炳說　宗位編　超源序　藍理序　有塔銘（依駒本印）
                "JB439", Kind.yuLu.of3("高峰三山來禪師疏語", "清", "燈來", "性統"), // 清 燈來撰　性統編（依駒本印）
                "JB440", Kind.yuLu.of3("高峰喬松億禪師語錄", "清", "玄億", "燈洪"), // 清 玄億說　燈洪編（依駒本印）
                "JB441", Kind.yuLu.of3("萬峰童真禪師語錄", "清", "至善", "德林"), // 清 至善說　德林記（依駒本印）
                "JB442", Kind.yuLu.of3("大笑崇禪師語錄", "清", "大笑崇禪師", "空情"), // 清 崇說　空情錄（依駒本印）
                "JB443", Kind.yuLu.of3("玉眉亮禪師語錄", "清", "玉眉亮禪師", "空謐", "張廷勱"), // 清 亮說　空謐編　張廷勱序（依駒本印）
                "JB444", Kind.yuLu.of3("卓峰玨禪師語錄", "清", "性玨", "宗位", "超原", "藍理"), // 清 性玨說　宗位編　超原序　藍理序　有塔銘　附冰玄法師語錄（依駒本印　塔銘有缺頁）
                "JB445", Kind.yuLu.of3("別菴禪師同門錄", "清", "性統", "弘秀"), // 清 性統錄　弘秀編（依駒本印）
                "JB446", Kind.yuLu.of3("靈隱文禪師語錄", "清", "印文", "福度"), // 清 印文說　福度復編（依駒本印）
                "JB447", Kind.yuLu.of3("東山梅溪度禪師語錄", "清", "福度", "慶緒"), // 清 福度說　慶緒等編（依駒本印）
                "JB448", Kind.yuLu.of3("靈機禪師語錄", "清", "行觀", "寂方"), // 清 行觀說　寂方等編（依駒本印）
                "JB449", Kind.yuLu.of3("祖亮啟禪師語錄", "清", "超啟", "廣和"), // 清 超啟說　廣和記錄（依駒本印）
                "JB450", Kind.yuLu.of3("敏樹禪師語錄", "清", "如相", "道崇", "道領"), // 清 如相說　道崇編　道領錄（依駒本印）
                "JB451", Kind.yuLu.of3("赤松領禪師語錄", "清", "道領", "寂源"), // 清 道領說　寂源錄（依駒本印）
                "JB452", Kind.yuLu.of3("侶巖荷禪師語錄", "清", "侶巖荷禪師", "成純"), // 清 荷說　成純等記錄（依駒本印）
                "JB453", Kind.yuLu.of3("元潔瑩禪師語錄", "清", "淨瑩", "智祥"), // 清 淨瑩說　智祥編（依駒本印）
                "JB454", Kind.yuLu.of3("頻吉祥禪師語錄", "清", "智祥", "德能"), // 清 智祥說　德能等編（依駒本印）
                "JB455", Kind.yuLu.of3("通天逸叟高禪師語錄", "清", "行高", "明德", "超原"), // 清 行高說　明德重梓　超原行略（依駒本印）
                "JB456", Kind.yuLu.of3("通天澹崖原禪師語錄", "清", "超原", "明德"), // 清 超原說　明德等編（依駒本印）
                "JB457", Kind.yuLu.of3("白雲象林本真禪師語錄", "清", "本真", "照水", "妙心"), // 清 本真說　照水重梓　妙心序　有行實（依駒本印）
                "JB458", Kind.yuLu.of3("正覺潤光澤禪師澡雪集", "清", "正覺潤光澤禪師", "照水", "陳聞道"), // 清 澤著　照水重編　陳聞道序　有自狀（依駒本印）
                "JB459", Kind.yuLu.of3("香巖洗心水禪師語錄", "清", "照水", "實雪", "海清"), // 清 照水說　實雲．海清等編
                "JB460", Kind.yuLu.of3("灤州萬善暉州昊禪師語錄", "清", "暉州昊禪師", "性珍", "寂寶"), // 清 昊說　性珍．寂寶等錄（依駒本印）
                "JB461", Kind.yuLu.of3("性空臻禪師語錄", "清", "行臻", "超自"), // 清 行臻說　超自等編（依駒本印）
                "JB462", Kind.yuLu.of3("何一自禪師語錄", "清", "超自", "明修", "明惠", "明智"), // 清 超自說　明修．明惠．明智等編（依駒本印）
                "JB463", Kind.yuLu.of3("溈山古梅冽禪師語錄", "清", "定冽", "真謙"), // 清 定冽說　真謙記錄（依駒本印）
                "JB464", Kind.yuLu.of3("華嚴起宗真禪師語錄", "清", "華嚴起宗真禪師", "力廣"), // 清 真說　力廣等錄（依駒本印）
                "JB465", Kind.yuLu.of3("子雍如禪師語錄", "清", "成如（尼）", "祖圓"), // 清 成如尼說　祖圓記錄（依駒本印）
                "JB466", Kind.yuLu.of3("山西柏山楷禪師語錄", "清", "德楷", "行悟"), // 清 德楷說　行悟等編次（依駒本印）
                "JB468", Kind.yuLu.of3("善一純禪師語錄", "清", "如純", "學正"), // 清 如純說　學正錄　附續錄（依駒本印）
                "JB469", Kind.yuLu.of3("善權位禪師語錄", "清", "達位", "大悅"), // 清 達位說　大悅等編（依駒本印）
                "JB470", Kind.yuLu.of3("天一悅禪師語錄", "清", "大悅", "學愚"), // 清 大悅說　學愚錄　有塔銘（依駒本印）
                "JB471", Kind.yuLu.of3("空谷道澄禪師語錄", "清", "道澄", "德儒"), // 清 道澄說　德儒編（依駒本增入並印）
                "JB472", Kind.yuLu.of3("大博乾禪師語錄", "清", "大博乾禪師", "超宗"), // 清 乾說　超宗等錄（依駒本增入並印）
                "JB473", Kind.yuLu.of3("盤山朗空順禪師語錄", "清", "盤山朗空順禪師", "實性"), // 清 順說　實性記錄　附了宗見禪師法嗣　瑞亭晟法嗣（依駒本增入並印）
                "JB474", Kind.yuLu.of3("盤山了宗禪師語錄", "清", "超見", "徹凡", "心月"), // 清 超見說　徹凡．心月等錄（依駒本增入並印）
                "JB475", Kind.yuLu.of3("逕庭宗禪師語錄", "清", "德宗", "行謙"), // 清 德宗說　行謙等編（依駒本增入並印）
                "JB476", Kind.yuLu.of3("別牧純禪師語錄", "清", "別牧純禪師", "福月", "慧輅"), // 清 純說　福月等編　慧輅序　有行實（依駒本增入並印）
                "JB477", Kind.yuLu.of3("天翼翔禪師語錄", "清", "巨翔", "寂乾", "際鋒"), // 清 巨翔說　寂乾錄　際鋒等編（駒本附於前目四七六之後　今分出增入並印）
                "JB478", Kind.yuLu.of3("雲山燕居申禪師語錄", "清", "德申", "合哲"), // 清 德申說　合哲等編（依駒本增入並印）
                "JB479", Kind.yuLu.of3("昭覺竹峰續禪師語錄", "清", "真續", "實悟"), // 清 真續說　實悟等編（依駒本增入並印）

                "JB480", Kind.zhuanJi.of3("一貫別傳", "清", "廣真"), // 清 廣真著（依駒本增入並印）
                "JB481", Kind.zhuanJi.of3("古音王傳", "清", "廣真", "古心", "黃毓英", "元善", "燈輝", "慧澤"), // 清 廣真著並序　古心評并引　凡則　黃毓英評　元善評　前有船子曲　燈輝集　慧澤序（依駒本增入並印）

                "JB483", Kind.yuLu.of3("竺峰敏禪師語錄", "清", "幻敏", "性鉅", "性湛", "性珩", "性濟"), // 清 幻敏說　性鉅．性湛．性珩．性濟等編　附後錄（依駒本增入並印）
                "JB484", Kind.yuLu.of3("野雲映禪師宗統頌", "清", "燈映", "性燦"), // 清 燈映頌　性燦錄　有塔銘　行狀（依駒本增入並印　原書第二十三頁起至末頁缺）
                "JB485", Kind.yuLu.of3("普門顯禪師語錄", "清", "燈顯", "性胤"), // 清 燈顯說　性胤錄（依駒本增入並印）
                "JB486", Kind.yuLu.of3("鑑堂一禪師語錄", "清", "鑑堂一禪師", "明滿", "明慧", "杜允貞"), // 清 一說　明滿．明慧等錄　杜允貞序（依駒本增入並印）
                "JB487", Kind.yuLu.of3("翠崖必禪師語錄", "清", "翠崖必禪師", "道通"), // 清 必說　道通錄（依駒本增入並印）
                "JB488", Kind.yuLu.of3("斗南暐禪師語錄", "清", "斗南暐禪師", "普潤"), // 清 暐說　普潤等錄（依駒本增入並印）
                "JB490", Kind.yuLu.of3("博山粟如瀚禪師語錄", "清", "弘瀚", "傅鵬"), // 清 弘瀚說　傅鵬編（依駒本增入並印）
                "JB491", Kind.yuLu.of3("天寧法舟濟禪師剩語", "明", "道濟", "如淵"), // 明 道濟撰　如淵等編
                "JB492", Kind.yuLu.of3("萬峰和尚語錄", "明", "時蔚", "普壽"), // 明 時蔚說　普壽集
                "JB493", Kind.yuLu.of3("磬山牧亭樸夫拙禪師語錄", "清", "磬山牧亭樸夫拙禪師", "光模"), // 清 拙說　光模等編
                "JB494", Kind.yuLu.of3("雨山和尚語錄", "清", "上思"), // 清 上思說
                "JB495", Kind.yuLu.of3("天然居士懷淨土詩", "清", "朱道則", "明康"), // 清 朱道則撰　明康錄
                "JB497", Kind.yuLu.of3("鶴山禪師執帚集", "清", "鶴山", "德敷") // 清 鶴山撰　德敷錄
        );
    }

    private static void addK() {
        add(
                "K0016", Kind.jin.of3("能斷金剛般若波羅蜜多經", "唐", "玄奘"), // 唐 玄奘譯

                "K1064", Kind.yinYi.of3("新譯大方廣佛華嚴經音義", "唐", "慧菀"), // 唐 慧菀述
                "K1257", Kind.yinYi.of3("新集藏經音義隨函錄", "後晉", "可洪"), // 後晉 可洪撰

                "K1258", Kind.lun.of3("御製蓮華心輪迴文偈頌", "宋", "趙炅"), // 宋 太宗趙炅撰
                "K1259", Kind.lun.of3("御製秘藏詮", "宋", "趙炅"), // 宋 太宗趙炅撰
                "K1260", Kind.lun.of3("御製逍遙詠", "宋", "趙炅"), // 宋 太宗趙炅撰
                "K1261", Kind.lun.of3("御製緣識", "宋", "趙炅"), // 宋 太宗趙炅撰

                "K1402", Kind.jin.of3("高麗國新雕大藏校正別錄", "高麗", "守其"), // 高麗 守其等校勘

                "K1482", Kind.lun.of3("大乘中觀釋論", "宋", "安慧菩薩", "惟淨") // 安慧菩薩造  宋 惟淨等譯
        );
    }

    private static void addL() {
        add(
                "L1490", Kind.jinShi.of4("妙法蓮華經玄義釋籤", new String[]{"隋", "唐"}, "智顗", "灌頂", "湛然"), // 隋 智顗說、灌頂記　唐 湛然釋
                "L1557", Kind.jinShi.of3("大方廣佛華嚴經疏鈔會本", "唐", "實叉難陀", "澄觀"), // 唐 實叉難陀譯　唐 澄觀述

                "L1571", Kind.yiGui.of3("觀自在菩薩如意輪咒課法", "宋", "仁岳"), // 宋 仁岳撰

                "L1600", Kind.lunShi.of3("大乘起信論疏", "唐", "法藏"), // 唐 法藏述

                "L1608", Kind.muLu.of3("大藏聖教法寶標目", "元", "王古"), // 元 王古撰

                "L1629", Kind.lunShi.of3("大乘百法明門論註", "唐", "玄奘", "慈恩法師"), // 唐 玄奘譯　增修慈恩法師解

                "L1635", Kind.lun.of3("性相通說（選錄序文）", "明", "德清"), // 明 德清述

                "L1636", Kind.lunShi.of3("莊子內篇註", "明", "德清"), // 明 德清註

                "L1637", Kind.yuLu.of3("幻有傳禪師語錄", "明", "正傳", "圓悟", "圓修"), // 明 正傅說 圓悟．圓修等編
                "L1638", Kind.yuLu.of3("雪嶠信禪師語錄", "明", "圓信", "弘歇"), // 明 圓信說 弘歇等編
                "L1639", Kind.yuLu.of3("天隱修禪師語錄", "明", "圓修", "通琇"), // 明 圓修說 通琇編
                "L1640", Kind.yuLu.of3("密雲悟禪師語錄", "明", "圓悟", "道忞"), // 明 圓悟說 道忞上進
                "L1641", Kind.yuLu.of3("大覺普濟能仁琇國師語錄", "清", "通琇", "行岳"), // 清 通琇說 行岳編
                "L1642", Kind.yuLu.of3("明道正覺森禪師語錄", "清", "行森", "超德"), // 清 行森說 超德等編
                "L1643", Kind.yuLu.of3("弘覺忞禪師語錄", "清", "道忞", "顯權"), // 清 道忞撰述 顯權等編
                "L1649", Kind.yuLu.of3("山茨際禪師語錄", "清", "通際", "達尊", "達謙"), // 清 通際撰述 達尊．達謙等編次
                "L1651", Kind.yuLu.of3("五百羅漢尊號", "明", "高道素"), // 明 高道素手錄
                "L1652", Kind.yuLu.of3("明覺聰禪師語錄", "清", "性聰", "寂空", "方醒"), // 清 性聰撰述 寂空．方醒等編次

                "L1666", Kind.lun.of3("重訂教乘法數（選錄序文）", "清", "超海"), // 清 超海等重訂
                "L1668", Kind.lun.of3("御錄宗鏡大綱", "清", "胤禛"), // 清 胤禎錄
                "L1669", Kind.lun.of3("御錄經海一滴", "清", "胤禛"), // 清 胤禎錄
                "LC0001", Kind.lun.of3("印度佛學源流略講", "民國", "呂澂"), // 民國 呂澂 著
                "LC0002", Kind.lun.of3("中國佛學源流略講", "民國", "呂澂"), // 民國 呂澂 著
                "LC0003", Kind.lun.of3("西藏佛學原論及佛學論著選集", "民國", "呂澂"), // 民國 呂澂 著
                "LC0004", Kind.lun.of3("因明入正理論講解及相關論著", "民國", "呂澂"), // 民國 呂澂 著
                "LC0005", Kind.lun.of3("佛教重要名相釋義及經論攷證", "民國", "呂澂"), // 民國 呂澂 著

                "LC0006", Kind.muLu.of3("歷朝藏經略考及新編漢文大藏經目錄", "民國", "呂澂"), // 民國 呂澂 著

                "LC0007", Kind.lun.of3("經論講要", "民國", "呂澂") // 民國 呂澂 著
        );
    }

    private static void addM() {
        add(
                "M1540", Kind.yuLu.of3("大慧普覺禪師普說", "宋", "蘊聞") // 宋 蘊聞錄
        );
    }

    private static void addN() {
        add(
                "N0001", Kind.lun.of2("經分別", "通妙"), // 通妙譯
                "N0002", Kind.lun.of2("犍度", "通妙"), // 通妙譯
                "N0003", Kind.lun.of2("附隨", "通妙"), // 通妙譯

                "N0004", Kind.jin.of2("長部經典", "通妙"), // 通妙譯
                "N0005", Kind.jin.of2("中部經典", "通妙"), // 通妙譯
                "N0006", Kind.jin.of2("相應部經典", "雲庵"), // 通妙譯
                "N0007", Kind.jin.of2("增支部經典", "葉慶春", "關世謙", "郭哲彰"), // 葉慶春譯
                "N0008", Kind.jin.of2("小誦經", "悟醒"), // 悟醒譯
                "N0009", Kind.jin.of2("法句經", "悟醒"), // 悟醒譯
                "N0010", Kind.jin.of2("自說經", "悟醒"), // 悟醒譯
                "N0011", Kind.jin.of2("如是語經", "悟醒"), // 悟醒譯
                "N0012", Kind.jin.of2("經集", "雲庵"), // 雲庵譯
                "N0013", Kind.jin.of2("天宮事經", "雲庵"), // 雲庵譯
                "N0014", Kind.jin.of2("餓鬼事經", "雲庵"), // 雲庵譯
                "N0015", Kind.jin.of2("長老偈經", "雲庵"), // 雲庵譯
                "N0016", Kind.jin.of2("長老尼偈經", "雲庵"), // 雲庵譯
                "N0017", Kind.jin.of2("譬喻經", "悟醒"), // 悟醒譯
                "N0018", Kind.jin.of2("本生經", "悟醒"), // 悟醒譯

                "N0019", Kind.lun.of2("無礙解道", "悟醒"), // 悟醒譯

                "N0020", Kind.jin.of2("佛種姓經", "悟醒"), // 悟醒譯
                "N0021", Kind.jin.of2("所行藏經", "悟醒"), // 悟醒譯

                "N0022", Kind.lun.of2("大義釋", "悟醒"), // 悟醒譯
                "N0023", Kind.lun.of2("小義釋", "悟醒"), // 悟醒譯
                "N0024", Kind.lun.of2("法集論", "郭哲彰"), // 郭哲彰譯
                "N0025", Kind.lun.of2("分別論", "郭哲彰"), // 郭哲彰譯
                "N0026", Kind.lun.of2("界論", "郭哲彰"), // 郭哲彰譯
                "N0027", Kind.lun.of2("人施設論", "郭哲彰"), // 郭哲彰譯
                "N0028", Kind.lun.of2("雙論", "郭哲彰"), // 郭哲彰譯
                "N0029", Kind.lun.of2("發趣論", "郭哲彰"), // 郭哲彰譯
                "N0030", Kind.lun.of2("論事", "郭哲彰"), // 郭哲彰譯

                "N0031", Kind.jin.of2("彌蘭王問經", "郭哲彰"), // 郭哲彰譯

                "N0032", Kind.shi.of2("島王統史", "悟醒"), // 悟醒譯
                "N0033", Kind.shi.of2("大王統史", "悟醒"), // 悟醒譯
                "N0034", Kind.shi.of2("小王統史", "悟醒"), // 悟醒譯

                "N0035", Kind.lun.of2("清淨道論", "佛音", "悟醒"), // 佛音撰 悟醒譯

                "N0036", Kind.lvShi.of2("一切善見律註序", "佛音", "悟醒"), // 佛音譯述 悟醒譯

                "N0037", Kind.lun.of2("攝阿毘達磨義論", "阿那律陀", "悟醒"), // 阿那律陀著 悟醒譯
                "N0038", Kind.lun.of2("阿育王刻文", "悟醒") // 悟醒譯
        );
    }

    private static void addP() {
        add(
                "P1519", Kind.lun.of4("宗門統要正續集", new String[]{"宋", "元"}, "宗永;清茂"), // 宋 宗永集　元 清茂續集
                "P1573", Kind.lun.of3("修懺要旨", "宋", "知禮"), // 宋 知禮述

                "P1581", Kind.jinShi.of4("首楞嚴經義海", new String[]{"唐", "宋"}, "懷迪", "咸輝"), // 唐 懷迪證釋　宋 咸輝排經入注
                "P1590", Kind.jinShi.of3("佛遺教經論疏節要", "宋", "淨源"), // 宋 淨源述

                "P1610", Kind.lun.of3("大明太宗文皇帝御製序讚文", "明", "朱棣"), // 明 太宗朱棣撰

                "P1611", Kind.jin.of3("諸佛世尊如來菩薩尊者神僧名經", "明", "朱棣"), // 明 太宗朱棣制

                "P1612", Kind.lun.of3("諸佛世尊如來菩薩尊者名稱歌曲", "明", "朱棣"), // 明 太宗朱棣制
                "P1615", Kind.lun.of3("大明三藏法數", "明", "一如"), // 明 一如等編集

                "P1617", Kind.jinShi.of3("妙法蓮華經要解（選錄「要解」本文）", "宋", "戒環"), // 宋 戒環解
                "P1618", Kind.jinShi.of4("大佛頂萬行首楞嚴經會解", new String[]{"唐", "宋", "元"}, "九師", "惟則"), // 唐宋 九師釋　元 惟則會解
                "P1624", Kind.jinShi.of3("金剛經疏論纂要（選錄「釋金剛經纂要疏科」）", "宋", "子璿"), // 宋 子璿錄

                "P1629", Kind.lun.of3("天台四教儀集註（選錄「集註」本文）", "元", "蒙潤"), // 元 蒙潤集
                "P1630", Kind.lun.of3("教乘法數（選錄序文）", "明", "圓瀞") // 明 圓瀞集
        );
    }

    private static void addS() {
        add(
                "S0046", Kind.jinShi.of3("上生經會古通今新抄", "唐", "詮明"), // 唐 詮明集
                "S0047", Kind.jinShi.of2("上生經疏隨新抄科文") //
        );
    }

    private static void addT() {
        add(
                "T0001", Kind.jin.of3("長阿含經", "後秦", "佛陀耶舍", "竺佛念"), // 後秦 佛陀耶舍共竺佛念譯
                "T0002", Kind.jin.of3("七佛經", "宋", "法天"), // 宋 法天譯
                "T0003", Kind.jin.of3("毘婆尸佛經", "宋", "法天"), // 宋 法天譯
                "T0004", Kind.jin.of2("七佛父母姓字經", "失譯"), // 失譯
                "T0005", Kind.jin.of3("佛般泥洹經", "西晉", "帛遠"), // 西晉 白法祖譯
                "T0006", Kind.jin.of2("般泥洹經", "失譯"), // 失譯
                "T0007", Kind.jin.of3("大般涅槃經", "東晉", "法顯"), // 東晉 法顯譯
                "T0008", Kind.jin.of3("大堅固婆羅門緣起經", "宋", "施護"), // 宋 施護等譯
                "T0009", Kind.jin.of3("人仙經", "宋", "天息災"), // 宋 法賢譯
                "T0010", Kind.jin.of3("白衣金幢二婆羅門緣起經", "宋", "施護"), // 宋 施護等譯
                "T0011", Kind.jin.of3("尼拘陀梵志經", "宋", "施護"), // 宋 施護等譯
                "T0012", Kind.jin.of3("大集法門經", "宋", "施護"), // 宋 施護譯
                "T0013", Kind.jin.of3("長阿含十報法經", "東漢", "安清"), // 後漢 安世高譯
                "T0014", Kind.jin.of3("人本欲生經", "東漢", "安清"), // 後漢 安世高譯
                "T0015", Kind.jin.of3("帝釋所問經", "宋", "天息災"), // 宋 法賢譯
                "T0016", Kind.jin.of3("尸迦羅越六方禮經", "東漢", "安清"), // 後漢 安世高譯
                "T0017", Kind.jin.of3("善生子經", "西晉", "支法度"), // 西晉 支法度譯
                "T0018", Kind.jin.of3("信佛功德經", "宋", "天息災"), // 宋 法賢譯
                "T0019", Kind.jin.of3("大三摩惹經", "宋", "法天"), // 宋 法天譯
                "T0020", Kind.jin.of3("佛開解梵志阿颰經", "吳", "支謙"), // 吳 支謙譯
                "T0021", Kind.jin.of3("梵網六十二見經", "吳", "支謙"), // 吳 支謙譯
                "T0022", Kind.jin.of3("寂志果經", "東晉", "曇無蘭"), // 東晉 竺曇無蘭譯
                "T0023", Kind.jin.of3("大樓炭經", "西晉", "法立", "法炬"), // 西晉 法立共法炬譯
                "T0024", Kind.jin.of3("起世經", "隋", "闍那崛多"), // 隋 闍那崛多等譯
                "T0025", Kind.jin.of3("起世因本經", "隋", "達摩笈多"), // 隋 達摩笈多譯
                "T0026", Kind.jin.of3("中阿含經", "東晉", "僧伽提婆"), // 東晉 瞿曇僧伽提婆譯
                "T0027", Kind.jin.of3("七知經", "吳", "支謙"), // 吳 支謙譯
                "T0028", Kind.jin.of3("園生樹經", "宋", "施護"), // 宋 施護譯
                "T0029", Kind.jin.of2("鹹水喻經", "失譯"), // 失譯
                "T0030", Kind.jin.of3("薩鉢多酥哩踰捺野經", "宋", "天息災"), // 宋 法賢譯
                "T0031", Kind.jin.of3("一切流攝守因經", "東漢", "安清"), // 後漢 安世高譯
                "T0032", Kind.jin.of3("四諦經", "東漢", "安清"), // 後漢 安世高譯
                "T0033", Kind.jin.of3("恒水經", "西晉", "法炬"), // 西晉 法炬譯
                "T0034", Kind.jin.of3("法海經", "西晉", "法炬"), // 西晉 法炬譯
                "T0035", Kind.jin.of3("海八德經", "後秦", "鳩摩羅什"), // 後秦 鳩摩羅什譯
                "T0036", Kind.jin.of3("本相猗致經", "東漢", "安清"), // 後漢 安世高譯
                "T0037", Kind.jin.of2("緣本致經", "失譯"), // 失譯
                "T0038", Kind.jin.of3("輪王七寶經", "宋", "施護"), // 宋 施護譯
                "T0039", Kind.jin.of3("頂生王故事經", "西晉", "法炬"), // 西晉 法炬譯
                "T0040", Kind.jin.of3("文陀竭王經", "北涼", "曇無讖"), // 北涼 曇無讖譯
                "T0041", Kind.jin.of3("頻婆娑羅王經", "宋", "天息災"), // 宋 法賢譯
                "T0042", Kind.jin.of3("鐵城泥犁經", "東晉", "曇無蘭"), // 東晉 竺曇無蘭譯
                "T0043", Kind.jin.of3("閻羅王五天使者經", "劉宋", "慧簡"), // 劉宋 慧簡譯
                "T0044", Kind.jin.of2("古來世時經", "失譯"), // 失譯
                "T0045", Kind.jin.of3("大正句王經", "宋", "天息災"), // 宋 法賢譯
                "T0046", Kind.jin.of3("阿那律八念經", "東漢", "支曜"), // 後漢 支曜譯
                "T0047", Kind.jin.of3("離睡經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0048", Kind.jin.of3("是法非法經", "東漢", "安清"), // 後漢 安世高譯
                "T0049", Kind.jin.of3("求欲經", "西晉", "法炬"), // 西晉 法炬譯
                "T0050", Kind.jin.of3("受歲經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0051", Kind.jin.of2("梵志計水淨經", "失譯"), // 失譯
                "T0052", Kind.jin.of3("大生義經", "宋", "施護"), // 宋 施護譯
                "T0053", Kind.jin.of2("苦陰經", "失譯"), // 失譯
                "T0054", Kind.jin.of3("釋摩男本四子經", "吳", "支謙"), // 吳 支謙譯
                "T0055", Kind.jin.of3("苦陰因事經", "西晉", "法炬"), // 西晉 法炬譯
                "T0056", Kind.jin.of3("樂想經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0057", Kind.jin.of3("漏分布經", "東漢", "安清"), // 後漢 安世高譯
                "T0058", Kind.jin.of3("阿耨風經", "東晉", "曇無蘭"), // 東晉 竺曇無蘭譯
                "T0059", Kind.jin.of3("諸法本經", "吳", "支謙"), // 吳 支謙譯
                "T0060", Kind.jin.of3("瞿曇彌記果經", "劉宋", "慧簡"), // 劉宋 慧簡譯
                "T0061", Kind.jin.of3("受新歲經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0062", Kind.jin.of3("新歲經", "東晉", "曇無蘭"), // 東晉 竺曇無蘭譯
                "T0063", Kind.jin.of3("解夏經", "宋", "天息災"), // 宋 法賢譯
                "T0064", Kind.jin.of3("瞻婆比丘經", "西晉", "法炬"), // 西晉 法炬譯
                "T0065", Kind.jin.of3("伏婬經", "西晉", "法炬"), // 西晉 法炬譯
                "T0066", Kind.jin.of2("魔嬈亂經", "失譯"), // 失譯
                "T0067", Kind.jin.of3("弊魔試目連經", "吳", "支謙"), // 吳 支謙譯
                "T0068", Kind.jin.of3("賴吒和羅經", "吳", "支謙"), // 吳 支謙譯
                "T0069", Kind.jin.of3("護國經", "宋", "天息災"), // 宋 法賢譯
                "T0070", Kind.jin.of3("數經", "西晉", "法炬"), // 西晉 法炬譯
                "T0071", Kind.jin.of3("梵志頞波羅延問種尊經", "東晉", "曇無蘭"), // 東晉 竺曇無蘭譯
                "T0072", Kind.jin.of2("三歸五戒慈心厭離功德經", "失譯"), // 失譯
                "T0073", Kind.jin.of3("須達經", "蕭齊", "求那毗地"), // 蕭齊 求那毘地譯
                "T0074", Kind.jin.of3("長者施報經", "宋", "法天"), // 宋 法天譯
                "T0075", Kind.jin.of2("佛為黃竹園老婆羅門說學經", "失譯"), // 失譯
                "T0076", Kind.jin.of3("梵摩渝經", "吳", "支謙"), // 吳 支謙譯
                "T0077", Kind.jin.of3("尊上經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0078", Kind.jin.of2("兜調經", "失譯"), // 失譯
                "T0079", Kind.jin.of3("鸚鵡經", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅譯
                "T0080", Kind.jin.of3("佛為首迦長者說業報差別經", "隋", "瞿曇法智"), // 隋 瞿曇法智譯
                "T0081", Kind.jin.of3("分別善惡報應經", "宋", "天息災"), // 宋 天息災譯
                "T0082", Kind.jin.of3("意經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0083", Kind.jin.of3("應法經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0084", Kind.jin.of3("分別布施經", "宋", "施護"), // 宋 施護譯
                "T0085", Kind.jin.of3("息諍因緣經", "宋", "施護"), // 宋 施護譯
                "T0086", Kind.jin.of3("泥犁經", "東晉", "曇無蘭"), // 東晉 竺曇無蘭譯
                "T0087", Kind.jin.of3("齋經", "吳", "支謙"), // 吳 支謙譯
                "T0088", Kind.jin.of2("優陂夷墮舍迦經", "失譯"), // 失譯
                "T0089", Kind.jin.of3("八關齋經", "劉宋", "沮渠京聲"), // 劉宋 沮渠京聲譯
                "T0090", Kind.jin.of3("鞞摩肅經", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅譯
                "T0091", Kind.jin.of3("婆羅門子命終愛念不離經", "東漢", "安清"), // 後漢 安世高譯
                "T0092", Kind.jin.of3("十支居士八城人經", "東漢", "安清"), // 後漢 安世高譯
                "T0093", Kind.jin.of2("邪見經", "失譯"), // 失譯
                "T0094", Kind.jin.of2("箭喻經", "失譯"), // 失譯
                "T0095", Kind.jin.of3("蟻喻經", "宋", "施護"), // 宋 施護譯
                "T0096", Kind.jin.of2("治意經", "失譯"), // 失譯
                "T0097", Kind.jin.of3("廣義法門經", "陳", "真諦"), // 陳 真諦譯
                "T0098", Kind.jin.of3("普法義經", "東漢", "安清"), // 後漢 安世高譯
                "T0099", Kind.jin.of3("雜阿含經", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅譯
                "T0100", Kind.jin.of2("別譯雜阿含經", "失譯"), // 失譯
                "T0101", Kind.jin.of2("雜阿含經", "失譯"), // 失譯
                "T0102", Kind.jin.of3("佛說五蘊皆空經", "唐", "義淨"), // 唐 義淨譯
                "T0103", Kind.jin.of3("佛說聖法印經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0104", Kind.jin.of3("佛說法印經", "宋", "施護"), // 宋 施護譯
                "T0105", Kind.jin.of3("五陰譬喻經", "東漢", "安清"), // 後漢 安世高譯
                "T0106", Kind.jin.of3("佛說水沫所漂經", "東晉", "曇無蘭"), // 東晉 竺曇無蘭譯
                "T0107", Kind.jin.of3("佛說不自守意經", "吳", "支謙"), // 吳 支謙譯
                "T0108", Kind.jin.of2("佛說滿願子經", "失譯"), // 失譯
                "T0109", Kind.jin.of3("佛說轉法輪經", "東漢", "安清"), // 後漢 安世高譯
                "T0110", Kind.jin.of3("佛說三轉法輪經", "唐", "義淨"), // 唐 義淨譯
                "T0111", Kind.jin.of3("佛說相應相可經", "西晉", "法炬"), // 西晉 法炬譯
                "T0112", Kind.jin.of3("佛說八正道經", "東漢", "安清"), // 後漢 安世高譯
                "T0113", Kind.jin.of3("佛說難提釋經", "西晉", "法炬"), // 西晉 法炬譯
                "T0114", Kind.jin.of3("佛說馬有三相經", "東漢", "支曜"), // 後漢 支曜譯
                "T0115", Kind.jin.of3("佛說馬有八態譬人經", "東漢", "支曜"), // 後漢 支曜譯
                "T0116", Kind.jin.of3("佛說戒德香經", "東晉", "曇無蘭"), // 東晉 竺曇無蘭譯
                "T0117", Kind.jin.of3("佛說戒香經", "宋", "天息災"), // 宋 法賢譯
                "T0118", Kind.jin.of3("佛說鴦掘摩經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0119", Kind.jin.of3("佛說鴦崛髻經", "西晉", "法炬"), // 西晉 法炬譯
                "T0120", Kind.jin.of3("央掘魔羅經", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅譯
                "T0121", Kind.jin.of3("佛說月喻經", "宋", "施護"), // 宋 施護譯
                "T0122", Kind.jin.of3("佛說波斯匿王太后崩塵土坌身經", "西晉", "法炬"), // 西晉 法炬譯
                "T0123", Kind.jin.of3("佛說放牛經", "後秦", "鳩摩羅什"), // 後秦 鳩摩羅什譯
                "T0124", Kind.jin.of3("緣起經", "唐", "玄奘"), // 唐 玄奘譯
                "T0125", Kind.jin.of3("增壹阿含經", "東晉", "僧伽提婆"), // 東晉 瞿曇僧伽提婆譯
                "T0126", Kind.jin.of3("佛說阿羅漢具德經", "宋", "天息災"), // 宋 法賢譯
                "T0127", Kind.jin.of3("佛說四人出現世間經", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅譯
                "T0128a",Kind.jin.of3("須摩提女經", "吳", "支謙"), // 吳 支謙譯
                "T0128b",Kind.jin.of3("須摩提女經", "吳", "支謙"), // 吳 支謙譯
                "T0129", Kind.jin.of3("佛說三摩竭經", "吳", "竺律炎"), // 吳 竺律炎譯
                "T0130", Kind.jin.of3("佛說給孤長者女得度因緣經", "宋", "施護"), // 宋 施護譯
                "T0131", Kind.jin.of3("佛說婆羅門避死經", "東漢", "安清"), // 後漢 安世高譯
                "T0132a",Kind.jin.of2("佛說食施獲五福報經", "失譯"), // 失譯
                "T0132b",Kind.jin.of2("施食獲五福報經", "失譯"), // 失譯
                "T0133", Kind.jin.of3("頻毘娑羅王詣佛供養經", "西晉", "法炬"), // 西晉 法炬譯
                "T0134", Kind.jin.of3("佛說長者子六過出家經", "劉宋", "慧簡"), // 劉宋 慧簡譯
                "T0135", Kind.jin.of3("佛說力士移山經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0136", Kind.jin.of3("佛說四未曾有法經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0137", Kind.jin.of3("舍利弗摩訶目連遊四衢經", "東漢", "康孟詳"), // 後漢 康孟詳譯
                "T0138", Kind.jin.of3("佛說十一想思念如來經", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅譯
                "T0139", Kind.jin.of3("佛說四泥犁經", "東晉", "曇無蘭"), // 東晉 竺曇無蘭譯
                "T0140", Kind.jin.of3("阿那邠邸化七子經", "東漢", "安清"), // 後漢 安世高譯
                "T0141", Kind.jin.of3("佛說阿遬達經", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅譯
                "T0142a",Kind.jin.of2("佛說玉耶女經", "失譯"), // 失譯
                "T0142b",Kind.jin.of2("玉耶女經", "失譯"), // 失譯
                "T0143", Kind.jin.of3("玉耶經", "東晉", "曇無蘭"), // 東晉 竺曇無蘭譯
                "T0144", Kind.jin.of3("佛說大愛道般泥洹經", "西晉", "帛遠"), // 西晉 白法祖譯
                "T0145", Kind.jin.of3("佛母般泥洹經", "劉宋", "慧簡"), // 劉宋 慧簡譯
                "T0146", Kind.jin.of2("舍衛國王夢見十事經", "失譯"), // 失譯
                "T0147", Kind.jin.of2("佛說舍衛國王十夢經", "失譯"), // 失譯
                "T0148", Kind.jin.of3("國王不梨先泥十夢經", "東晉", "曇無蘭"), // 東晉 竺曇無蘭譯
                "T0149", Kind.jin.of3("佛說阿難同學經", "東漢", "安清"), // 後漢 安世高譯
                "T0150A",Kind.jin.of3("七處三觀經", "東漢", "安清"), // 後漢 安世高譯
                "T0150B",Kind.jin.of3("九橫經", "東漢", "安清"), // 後漢 安世高譯
                "T0151", Kind.jin.of3("佛說阿含正行經", "東漢", "安清"), // 後漢 安世高譯
                "T0152", Kind.jin.of3("六度集經", "吳", "康僧會"), // 吳 康僧會譯
                "T0153", Kind.jin.of3("菩薩本緣經", "吳", "支謙"), // 吳 支謙譯
                "T0154", Kind.jin.of3("生經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0155", Kind.jin.of2("菩薩本行經", "失譯"), // 失譯
                "T0156", Kind.jin.of2("大方便佛報恩經", "失譯"), // 失譯
                "T0157", Kind.jin.of3("悲華經", "北涼", "曇無讖"), // 北涼 曇無讖譯
                "T0158", Kind.jin.of2("大乘悲分陀利經", "失譯"), // 失譯
                "T0159", Kind.jin.of3("大乘本生心地觀經", "唐", "般若"), // 唐 般若譯
                "T0160", Kind.jin.of3("菩薩本生鬘論", "宋", "紹德", "慧詢"), // 宋 紹德慧詢等譯
                "T0161", Kind.jin.of2("長壽王經", "失譯"), // 失譯
                "T0162", Kind.jin.of3("金色王經", "東魏", "般若流支"), // 東魏 瞿曇般若流支譯
                "T0163", Kind.jin.of3("妙色王因緣經", "唐", "義淨"), // 唐 義淨譯
                "T0164", Kind.jin.of3("師子素馱娑王斷肉經", "唐", "智嚴"), // 唐 智嚴譯
                "T0165", Kind.jin.of3("頂生王因緣經", "宋", "施護"), // 宋 施護等譯
                "T0166", Kind.jin.of3("月光菩薩經", "宋", "天息災"), // 宋 法賢譯
                "T0167", Kind.jin.of3("太子慕魄經", "東漢", "安清"), // 後漢 安世高譯
                "T0168", Kind.jin.of3("太子墓魄經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0169", Kind.jin.of3("月明菩薩經", "吳", "支謙"), // 吳 支謙譯
                "T0170", Kind.jin.of3("德光太子經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0171", Kind.jin.of3("太子須大拏經", "西秦", "法堅"), // 西秦 聖堅譯
                "T0172", Kind.jin.of3("菩薩投身飴餓虎起塔因緣經", "北涼", "法盛"), // 北涼 法盛譯
                "T0173", Kind.jin.of3("福力太子因緣經", "宋", "施護"), // 宋 施護等譯
                "T0174", Kind.jin.of2("菩薩睒子經", "失譯"), // 失譯
                "T0175a",Kind.jin.of3("睒子經", "西秦", "法堅"), // 西秦 聖堅譯
                "T0175b",Kind.jin.of3("佛說睒子經", "乞伏秦", "法堅"), // 乞伏秦 聖堅譯
                "T0175c",Kind.jin.of3("佛說睒子經", "姚秦", "法堅"), // 姚秦 聖堅譯
                "T0176", Kind.jin.of2("師子月佛本生經", "失譯"), // 失譯
                "T0177", Kind.jin.of3("大意經", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅譯
                "T0178", Kind.jin.of3("前世三轉經", "西晉", "法炬"), // 西晉 法炬譯
                "T0179", Kind.jin.of3("銀色女經", "東魏", "佛陀扇多"), // 元魏 佛陀扇多譯
                "T0180", Kind.jin.of3("過去世佛分衛經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0181a",Kind.jin.of3("九色鹿經", "吳", "支謙"), // 吳 支謙譯
                "T0181b",Kind.jin.of3("佛說九色鹿經", "吳", "支謙"), // 吳 支謙譯
                "T0182a",Kind.jin.of3("鹿母經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0182b",Kind.jin.of3("佛說鹿母經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0183", Kind.jin.of2("一切智光明仙人慈心因緣不食肉經", "失譯"), // 失譯
                "T0184", Kind.jin.of3("修行本起經", "東漢", "竺大力", "康孟詳"), // 後漢 竺大力共康孟詳譯
                "T0185", Kind.jin.of3("太子瑞應本起經", "吳", "支謙"), // 吳 支謙譯
                "T0186", Kind.jin.of3("普曜經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0187", Kind.jin.of3("方廣大莊嚴經", "唐", "地婆訶羅"), // 唐 地婆訶羅譯
                "T0188", Kind.jin.of3("異出菩薩本起經", "西晉", "聶道真"), // 西晉 聶道真譯
                "T0189", Kind.jin.of3("過去現在因果經", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅譯
                "T0190", Kind.jin.of3("佛本行集經", "隋", "闍那崛多"), // 隋 闍那崛多譯
                "T0191", Kind.jin.of3("眾許摩訶帝經", "宋", "天息災"), // 宋 法賢譯
                "T0192", Kind.jin.of3("佛所行讚", "北涼", "曇無讖", "馬鳴"), // 馬鳴菩薩造  北涼 曇無讖譯
                "T0193", Kind.jin.of3("佛本行經", "劉宋", "寶雲"), // 宋 釋寶雲譯
                "T0194", Kind.jin.of3("僧伽羅剎所集經", "符秦", "僧伽跋澄"), // 符秦 僧伽跋澄等譯
                "T0195", Kind.jin.of3("佛說十二遊經", "東晉", "迦留陀迦"), // 東晉 迦留陀伽譯
                "T0196", Kind.jin.of3("中本起經", "東漢", "曇果", "康孟詳"), // 後漢 曇果共康孟詳譯
                "T0197", Kind.jin.of3("佛說興起行經", "東漢", "康孟詳"), // 後漢 康孟詳譯
                "T0198", Kind.jin.of3("佛說義足經", "吳", "支謙"), // 吳 支謙譯
                "T0199", Kind.jin.of3("佛五百弟子自說本起經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0200", Kind.jin.of3("撰集百緣經", "吳", "支謙"), // 吳 支謙譯
                "T0201", Kind.jin.of3("大莊嚴論經", "後秦", "鳩摩羅什", "馬鳴"), // 馬鳴菩薩造  後秦 鳩摩羅什譯
                "T0202", Kind.jin.of3("賢愚經", "元魏", "慧覺"), // 元魏 慧覺等譯
                "T0203", Kind.jin.of3("雜寶藏經", "元魏", "吉迦夜", "曇曜"), // 元魏 吉迦夜共曇曜譯
                "T0204", Kind.jin.of3("雜譬喻經", "東漢", "支婁迦讖"), // 後漢 支婁迦讖譯
                "T0205", Kind.jin.of2("雜譬喻經", "失譯"), // 失譯
                "T0206", Kind.jin.of3("舊雜譬喻經", "吳", "康僧會"), // 吳 康僧會譯
                "T0207", Kind.jin.of2("雜譬喻經", "道略"), // 道略集
                "T0208", Kind.jin.of3("眾經撰雜譬喻", "姚秦", "鳩摩羅什", "道略"), // 道略集  姚秦 鳩摩羅什譯
                "T0209", Kind.jin.of3("百喻經", "蕭齊", "求那毗地", "僧伽斯那"), // 僧伽斯那撰  蕭齊 求那毘地譯
                "T0210", Kind.jin.of3("法句經", "吳", "維祇難", "法救"), // 法救撰  吳 維祇難等譯
                "T0211", Kind.jin.of3("法句譬喻經", "西晉", "法炬", "法立"), // 晉世 法炬共法立譯
                "T0212", Kind.jin.of3("出曜經", "前秦", "竺佛念"), // 姚秦 竺佛念譯
                "T0213", Kind.jin.of3("法集要頌經", "宋", "天息災", "法救"), // 法救集  宋 天息災譯
                "T0214", Kind.jin.of3("猘狗經", "吳", "支謙"), // 吳 支謙譯
                "T0215", Kind.jin.of3("群牛譬經", "西晉", "法炬"), // 西晉 法炬譯
                "T0216", Kind.jin.of3("大魚事經", "東晉", "曇無蘭"), // 東晉 竺曇無蘭譯
                "T0217", Kind.jin.of3("譬喻經", "唐", "義淨"), // 唐 義淨譯
                "T0218", Kind.jin.of3("灌頂王喻經", "宋", "施護"), // 宋 施護等譯
                "T0219", Kind.jin.of3("醫喻經", "宋", "施護"), // 宋 施護譯
                "T0220", Kind.jin.of3("大般若波羅蜜多經", "唐", "玄奘"), // 唐 玄奘譯
                "T0221", Kind.jin.of3("放光般若經", "西晉", "無羅叉"), // 西晉 無羅叉譯
                "T0222", Kind.jin.of3("光讚經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0223", Kind.jin.of3("摩訶般若波羅蜜經", "後秦", "鳩摩羅什"), // 後秦 鳩摩羅什譯
                "T0224", Kind.jin.of3("道行般若經", "東漢", "支婁迦讖"), // 後漢 支婁迦讖譯
                "T0225", Kind.jin.of3("大明度經", "吳", "支謙"), // 吳 支謙譯
                "T0226", Kind.jin.of3("摩訶般若鈔經", "前秦", "曇摩蜱", "竺佛念"), // 前秦 曇摩蜱共竺佛念譯
                "T0227", Kind.jin.of3("小品般若波羅蜜經", "後秦", "鳩摩羅什"), // 後秦 鳩摩羅什譯
                "T0228", Kind.jin.of3("佛說佛母出生三法藏般若波羅蜜多經", "宋", "施護"), // 宋 施護譯
                "T0229", Kind.jin.of3("佛說佛母寶德藏般若波羅蜜經", "宋", "天息災"), // 宋 法賢譯
                "T0230", Kind.jin.of3("聖八千頌般若波羅蜜多一百八名真實圓義陀羅尼經", "宋", "施護"), // 宋 施護等譯
                "T0231", Kind.jin.of3("勝天王般若波羅蜜經", "陳", "月婆首那"), // 陳 月婆首那譯
                "T0232", Kind.jin.of3("文殊師利所說摩訶般若波羅蜜經", "梁", "曼陀羅仙"), // 梁 曼陀羅仙譯
                "T0233", Kind.jin.of3("文殊師利所說般若波羅蜜經", "梁", "僧伽婆羅"), // 梁 僧伽婆羅譯
                "T0234", Kind.jin.of3("佛說濡首菩薩無上清淨分衛經", "劉宋", "翔公"), // 宋 翔公譯
                "T0235", Kind.jin.of3("金剛般若波羅蜜經", "後秦", "鳩摩羅什"), // 後秦 鳩摩羅什譯
                "T0236a",Kind.jin.of3("金剛般若波羅蜜經", "元魏", "菩提流支"), // 元魏 菩提流支譯
                "T0236b",Kind.jin.of3("金剛般若波羅蜜經", "元魏", "菩提流支"), // 元魏 菩提流支譯
                "T0237", Kind.jin.of3("金剛般若波羅蜜經", "陳", "真諦"), // 陳 真諦譯
                "T0238", Kind.jin.of3("金剛能斷般若波羅蜜經", "隋", "達摩笈多"), // 隋 笈多譯
                "T0239", Kind.jin.of3("佛說能斷金剛般若波羅蜜多經", "唐", "義淨"), // 唐 義淨譯
                "T0240", Kind.jin.of3("實相般若波羅蜜經", "唐", "菩提流志"), // 唐 菩提流志譯
                "T0241", Kind.jin.of3("金剛頂瑜伽理趣般若經", "唐", "金剛智"), // 唐 金剛智譯
                "T0242", Kind.jin.of3("佛說遍照般若波羅蜜經", "宋", "施護"), // 宋 施護譯
                "T0243", Kind.jin.of3("大樂金剛不空真實三麼耶經", "唐", "不空"), // 唐 不空譯
                "T0244", Kind.jin.of3("佛說最上根本大樂金剛不空三昧大教王經", "宋", "天息災"), // 宋 法賢譯
                "T0245", Kind.jin.of3("佛說仁王般若波羅蜜經", "後秦", "鳩摩羅什"), // 後秦 鳩摩羅什譯
                "T0246", Kind.jin.of3("仁王護國般若波羅蜜多經", "唐", "不空"), // 唐 不空譯
                "T0247", Kind.jin.of3("佛說了義般若波羅蜜多經", "宋", "施護"), // 宋 施護譯
                "T0248", Kind.jin.of3("佛說五十頌聖般若波羅蜜經", "宋", "施護"), // 宋 施護譯
                "T0249", Kind.jin.of3("佛說帝釋般若波羅蜜多心經", "宋", "施護"), // 宋 施護譯
                "T0250", Kind.jin.of3("摩訶般若波羅蜜大明呪經", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯
                "T0251", Kind.jin.of3("般若波羅蜜多心經", "唐", "玄奘"), // 唐 玄奘譯
                "T0252", Kind.jin.of3("普遍智藏般若波羅蜜多心經", "唐", "法月"), // 唐 法月重譯
                "T0253", Kind.jin.of3("般若波羅蜜多心經", "唐", "般若", "利言"), // 唐 般若共利言等譯
                "T0254", Kind.jin.of3("般若波羅蜜多心經", "唐", "智慧輪"), // 唐 智慧輪譯
                "T0255", Kind.jin.of3("般若波羅蜜多心經", "唐", "法成"), // 唐 法成譯
                "T0256", Kind.jin.of2("唐梵翻對字音般若波羅蜜多心經"), //
                "T0257", Kind.jin.of3("佛說聖佛母般若波羅蜜多經", "宋", "施護"), // 宋 施護譯
                "T0258", Kind.jin.of3("佛說聖佛母小字般若波羅蜜多經", "宋", "天息災"), // 宋 天息災譯
                "T0259", Kind.jin.of3("佛說觀想佛母般若波羅蜜多菩薩經", "宋", "天息災"), // 宋 天息災譯
                "T0260", Kind.jin.of3("佛說開覺自性般若波羅蜜多經", "宋", "惟淨"), // 宋 惟淨等譯
                "T0261", Kind.jin.of3("大乘理趣六波羅蜜多經", "唐", "般若"), // 唐 般若譯
                "T0262", Kind.jin.of3("妙法蓮華經", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯
                "T0263", Kind.jin.of3("正法華經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0264", Kind.jin.of3("添品妙法蓮華經", "隋", "闍那崛多", "達摩笈多"), // 隋 闍那崛多共笈多譯
                "T0265", Kind.jin.of2("薩曇分陀利經", "失譯"), // 失譯
                "T0266", Kind.jin.of3("佛說阿惟越致遮經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0267", Kind.jin.of2("不退轉法輪經", "失譯"), // 失譯
                "T0268", Kind.jin.of3("佛說廣博嚴淨不退轉輪經", "劉宋", "智嚴"), // 宋 智嚴譯
                "T0269", Kind.jin.of3("佛說法華三昧經", "劉宋", "智嚴"), // 宋 智嚴譯
                "T0270", Kind.jin.of3("大法鼓經", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅譯
                "T0271", Kind.jin.of3("佛說菩薩行方便境界神通變化經", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅譯
                "T0272", Kind.jin.of3("大薩遮尼乾子所說經", "元魏", "菩提流支"), // 元魏 菩提留支譯
                "T0273", Kind.jin.of2("金剛三昧經", "失譯"), // 失譯
                "T0274", Kind.jin.of3("佛說濟諸方等學經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0275", Kind.jin.of3("大乘方廣總持經", "隋", "毘尼多流支"), // 隋 毘尼多流支譯
                "T0276", Kind.jin.of3("無量義經", "蕭齊", "曇摩迦陀耶舍"), // 蕭齊 曇摩伽陀耶舍譯
                "T0277", Kind.jin.of3("佛說觀普賢菩薩行法經", "劉宋", "曇摩蜜多"), // 劉宋 曇無蜜多譯
                "T0278", Kind.jin.of3("大方廣佛華嚴經", "東晉", "佛馱跋陀羅"), // 東晉 佛馱跋陀羅譯
                "T0279", Kind.jin.of3("大方廣佛華嚴經", "唐", "實叉難陀"), // 唐 實叉難陀譯
                "T0280", Kind.jin.of3("佛說兜沙經", "東漢", "支婁迦讖"), // 後漢 支婁迦讖譯
                "T0281", Kind.jin.of3("佛說菩薩本業經", "吳", "支謙"), // 吳 支謙譯
                "T0282", Kind.jin.of3("諸菩薩求佛本業經", "西晉", "聶道真"), // 西晉 聶道真譯
                "T0283", Kind.jin.of3("菩薩十住行道品", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0284", Kind.jin.of3("佛說菩薩十住經", "東晉", "祇多蜜"), // 東晉 祇多蜜譯
                "T0285", Kind.jin.of3("漸備一切智德經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0286", Kind.jin.of3("十住經", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯
                "T0287", Kind.jin.of3("佛說十地經", "唐", "尸羅達摩"), // 唐 尸羅達摩譯
                "T0288", Kind.jin.of3("等目菩薩所問三昧經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0289", Kind.jin.of3("顯無邊佛土功德經", "唐", "玄奘"), // 唐 玄奘譯
                "T0290", Kind.jin.of3("佛說較量一切佛剎功德經", "宋", "天息災"), // 宋 法賢譯
                "T0291", Kind.jin.of3("佛說如來興顯經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0292", Kind.jin.of3("度世品經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0293", Kind.jin.of3("大方廣佛華嚴經", "唐", "般若"), // 唐 般若譯
                "T0294", Kind.jin.of3("佛說羅摩伽經", "西秦", "法堅"), // 西秦 聖堅譯
                "T0295", Kind.jin.of3("大方廣佛華嚴經入法界品", "唐", "地婆訶羅"), // 唐 地婆訶羅譯
                "T0296", Kind.jin.of3("文殊師利發願經", "東晉", "佛馱跋陀羅"), // 東晉 佛陀跋陀羅譯
                "T0297", Kind.jin.of3("普賢菩薩行願讚", "唐", "不空"), // 唐 不空譯
                "T0298", Kind.jin.of3("大方廣普賢所說經", "唐", "實叉難陀"), // 唐 實叉難陀譯
                "T0299", Kind.jin.of3("大方廣總持寶光明經", "宋", "法天"), // 宋 法天譯
                "T0300", Kind.jin.of3("大方廣佛華嚴經不思議佛境界分", "唐", "提雲般若"), // 唐 提雲般若譯
                "T0301", Kind.jin.of3("大方廣如來不思議境界經", "唐", "實叉難陀"), // 唐 實叉難陀譯
                "T0302", Kind.jin.of2("度諸佛境界智光嚴經", "失譯"), // 失譯
                "T0303", Kind.jin.of3("佛華嚴入如來德智不思議境界經", "隋", "闍那崛多"), // 隋 闍那崛多譯
                "T0304", Kind.jin.of3("大方廣入如來智德不思議經", "唐", "實叉難陀"), // 唐 實叉難陀譯
                "T0305", Kind.jin.of3("信力入印法門經", "元魏", "曇摩流支"), // 元魏 曇摩流支譯
                "T0306", Kind.jin.of3("大方廣佛花嚴經修慈分", "唐", "提雲般若"), // 唐 提雲般若等譯
                "T0307", Kind.jin.of3("佛說莊嚴菩提心經", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯
                "T0308", Kind.jin.of3("佛說大方廣菩薩十地經", "元魏", "吉迦夜"), // 元魏 吉迦夜譯
                "T0309", Kind.jin.of3("最勝問菩薩十住除垢斷結經", "姚秦", "竺佛念"), // 姚秦 竺佛念譯
                "T0310", Kind.jin.of3("大寶積經", "唐", "菩提流志"), // 唐 菩提流志譯
                "T0311", Kind.jin.of3("大方廣三戒經", "北涼", "曇無讖"), // 北涼 曇無讖譯
                "T0312", Kind.jin.of3("佛說如來不思議祕密大乘經", "宋", "法護"), // 宋 法護譯
                "T0313", Kind.jin.of3("阿閦佛國經", "東漢", "支婁迦讖"), // 後漢 支婁迦讖譯
                "T0314", Kind.jin.of3("佛說大乘十法經", "梁", "僧伽婆羅"), // 梁 僧伽婆羅譯
                "T0315a",Kind.jin.of3("佛說普門品經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0315b",Kind.jin.of3("佛說普門品經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0316", Kind.jin.of3("佛說大乘菩薩藏正法經", "宋", "法護"), // 宋 法護等譯
                "T0317", Kind.jin.of3("佛說胞胎經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0318", Kind.jin.of3("文殊師利佛土嚴淨經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0319", Kind.jin.of3("大聖文殊師利菩薩佛剎功德莊嚴經", "唐", "不空"), // 唐 不空譯
                "T0320", Kind.jin.of3("父子合集經", "宋", "日稱"), // 宋 日稱等譯
                "T0321", Kind.jin.of3("佛說護國尊者所問大乘經", "宋", "施護"), // 宋 施護譯
                "T0322", Kind.jin.of3("法鏡經", "東漢", "安玄"), // 後漢 安玄譯
                "T0323", Kind.jin.of3("郁迦羅越問菩薩行經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0324", Kind.jin.of3("佛說幻士仁賢經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0325", Kind.jin.of3("佛說決定毘尼經", "西晉", "竺法護"), // 西晉 燉煌三藏譯
                "T0326", Kind.jin.of3("佛說三十五佛名禮懺文", "唐", "不空"), // 唐 不空譯
                "T0327", Kind.jin.of3("發覺淨心經", "隋", "闍那崛多"), // 隋 闍那崛多譯
                "T0328", Kind.jin.of3("佛說須賴經", "曹魏", "白延"), // 曹魏 白延譯
                "T0329", Kind.jin.of3("佛說須賴經", "前涼", "支施侖"), // 前涼 支施崙譯
                "T0330", Kind.jin.of3("佛說菩薩修行經", "西晉", "帛遠"), // 西晉 白法祖譯
                "T0331", Kind.jin.of3("佛說無畏授所問大乘經", "宋", "施護"), // 宋 施護等譯
                "T0332", Kind.jin.of3("佛說優填王經", "西晉", "法炬"), // 西晉 法炬譯
                "T0333", Kind.jin.of3("佛說大乘日子王所問經", "宋", "法天"), // 宋 法天譯
                "T0334", Kind.jin.of3("佛說須摩提菩薩經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0335", Kind.jin.of3("佛說須摩提菩薩經", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯
                "T0336", Kind.jin.of3("須摩提經", "唐", "菩提流志"), // 唐 菩提流志譯
                "T0337", Kind.jin.of3("佛說阿闍貰王女阿術達菩薩經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0338", Kind.jin.of3("佛說離垢施女經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0339", Kind.jin.of3("得無垢女經", "東魏", "般若流支"), // 元魏 瞿曇般若流支譯
                "T0340", Kind.jin.of3("文殊師利所說不思議佛境界經", "唐", "菩提流志"), // 唐 菩提流志譯
                "T0341", Kind.jin.of3("聖善住意天子所問經", "東魏", "毗目智仙", "般若流支"), // 元魏 毘目智仙共般若流支譯
                "T0342", Kind.jin.of3("佛說如幻三昧經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0343", Kind.jin.of3("佛說太子刷護經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0344", Kind.jin.of2("佛說太子和休經", "失譯"), // 失譯
                "T0345", Kind.jin.of3("慧上菩薩問大善權經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0346", Kind.jin.of3("佛說大方廣善巧方便經", "宋", "施護"), // 宋 施護譯
                "T0347", Kind.jin.of3("大乘顯識經", "唐", "地婆訶羅"), // 唐 地婆訶羅譯
                "T0348", Kind.jin.of3("佛說大乘方等要慧經", "東漢", "安清"), // 後漢 安世高譯
                "T0349", Kind.jin.of3("彌勒菩薩所問本願經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0350", Kind.jin.of3("佛說遺日摩尼寶經", "東漢", "支婁迦讖"), // 後漢 支婁迦讖譯
                "T0351", Kind.jin.of2("佛說摩訶衍寶嚴經", "失譯"), // 失譯
                "T0352", Kind.jin.of3("佛說大迦葉問大寶積正法經", "宋", "施護"), // 宋 施護譯
                "T0353", Kind.jin.of3("勝鬘師子吼一乘大方便方廣經", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅譯
                "T0354", Kind.jin.of3("毘耶娑問經", "東魏", "般若流支"), // 元魏 瞿曇般若流支譯
                "T0355", Kind.jin.of3("入法界體性經", "隋", "闍那崛多"), // 隋 闍那崛多譯
                "T0356", Kind.jin.of3("佛說寶積三昧文殊師利菩薩問法身經", "東漢", "安清"), // 後漢 安世高譯
                "T0357", Kind.jin.of3("如來莊嚴智慧光明入一切佛境界經", "元魏", "曇摩流支"), // 元魏 曇摩流支譯
                "T0358", Kind.jin.of3("度一切諸佛境界智嚴經", "梁", "僧伽婆羅"), // 梁 僧伽婆羅等譯
                "T0359", Kind.jin.of3("佛說大乘入諸佛境界智光明莊嚴經", "宋", "法護"), // 宋 法護等譯
                "T0360", Kind.jin.of3("佛說無量壽經", "曹魏", "康僧鎧"), // 曹魏 康僧鎧譯
                "T0361", Kind.jin.of3("佛說無量清淨平等覺經", "東漢", "支婁迦讖"), // 後漢 支婁迦讖譯
                "T0362", Kind.jin.of3("佛說阿彌陀三耶三佛薩樓佛檀過度人道經", "吳", "支謙"), // 吳 支謙譯
                "T0363", Kind.jin.of3("佛說大乘無量壽莊嚴經", "宋", "天息災"), // 宋 法賢譯
                "T0364", Kind.jin.of3("佛說大阿彌陀經", "宋", "王日休"), // 宋 王日休校輯
                "T0365", Kind.jin.of3("佛說觀無量壽佛經", "劉宋", "畺良耶舍"), // 宋 畺良耶舍譯
                "T0366", Kind.jin.of3("佛說阿彌陀經", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯
                "T0367", Kind.jin.of3("稱讚淨土佛攝受經", "唐", "玄奘"), // 唐 玄奘譯
                "T0368", Kind.jin.of3("拔一切業障根本得生淨土神呪", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅重譯
                "T0369", Kind.jin.of2("阿彌陀佛說呪"), //
                "T0370", Kind.jin.of2("阿彌陀鼓音聲王陀羅尼經", "失譯"), // 失譯
                "T0371", Kind.jin.of3("觀世音菩薩授記經", "劉宋", "法勇"), // 宋 曇無竭譯
                "T0372", Kind.jin.of3("佛說如幻三摩地無量印法門經", "宋", "施護"), // 宋 施護等譯
                "T0373", Kind.jin.of2("後出阿彌陀佛偈", "失譯"), // 失譯
                "T0374", Kind.jin.of3("大般涅槃經", "北涼", "曇無讖"), // 北涼 曇無讖譯
                "T0375", Kind.jin.of3("大般涅槃經", "劉宋", "慧嚴"), // 宋 慧嚴等依泥洹經加之
                "T0376", Kind.jin.of3("佛說大般泥洹經", "東晉", "法顯"), // 東晉 法顯譯
                "T0377", Kind.jin.of3("大般涅槃經後分", "唐", "若那跋陀羅"), // 唐 若那跋陀羅譯
                "T0378", Kind.jin.of3("佛說方等般泥洹經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0379", Kind.jin.of3("四童子三昧經", "隋", "闍那崛多"), // 隋 闍那崛多譯
                "T0380", Kind.jin.of3("大悲經", "高齊", "那連提黎耶舍"), // 高齊 那連提耶舍譯
                "T0381", Kind.jin.of3("等集眾德三昧經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0382", Kind.jin.of3("集一切福德三昧經", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯
                "T0383", Kind.jin.of3("摩訶摩耶經", "蕭齊", "曇景"), // 蕭齊 曇景譯
                "T0384", Kind.jin.of3("菩薩從兜術天降神母胎說廣普經", "姚秦", "竺佛念"), // 姚秦 竺佛念譯
                "T0385", Kind.jin.of3("中陰經", "姚秦", "竺佛念"), // 姚秦 竺佛念譯
                "T0386", Kind.jin.of3("蓮華面經", "隋", "那連提黎耶舍"), // 隋 那連提耶舍譯
                "T0387", Kind.jin.of3("大方等無想經", "北涼", "曇無讖"), // 北涼 曇無讖譯
                "T0388", Kind.jin.of3("大雲無想經卷第九", "姚秦", "竺佛念"), // 姚秦 竺佛念譯
                "T0389", Kind.jin.of3("佛垂般涅槃略說教誡經", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯
                "T0390", Kind.jin.of3("佛臨涅槃記法住經", "唐", "玄奘"), // 唐 玄奘譯
                "T0391", Kind.jin.of3("般泥洹後灌臘經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0392", Kind.jin.of2("佛滅度後棺斂葬送經", "失譯"), // 失譯
                "T0393", Kind.jin.of3("迦葉赴佛般涅槃經", "東晉", "曇無蘭"), // 東晉 竺曇無蘭譯
                "T0394", Kind.jin.of2("佛入涅槃密迹金剛力士哀戀經", "失譯"), // 失譯
                "T0395", Kind.jin.of3("佛說當來變經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0396", Kind.jin.of2("佛說法滅盡經", "失譯"), // 失譯
                "T0397", Kind.jin.of3("大方等大集經", "北涼", "曇無讖"), // 北涼 曇無讖譯
                "T0398", Kind.jin.of3("大哀經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0399", Kind.jin.of3("寶女所問經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0400", Kind.jin.of3("佛說海意菩薩所問淨印法門經", "宋", "惟淨"), // 宋 惟淨等譯
                "T0401", Kind.jin.of3("佛說無言童子經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0402", Kind.jin.of3("寶星陀羅尼經", "唐", "波羅頗迦羅蜜多羅"), // 唐 波羅頗蜜多羅譯
                "T0403", Kind.jin.of3("阿差末菩薩經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0404", Kind.jin.of3("大集大虛空藏菩薩所問經", "唐", "不空"), // 唐 不空譯
                "T0405", Kind.jin.of3("虛空藏菩薩經", "姚秦", "佛陀耶舍"), // 姚秦 佛陀耶舍譯
                "T0406", Kind.jin.of2("虛空藏菩薩神呪經", "失譯"), // 失譯
                "T0407", Kind.jin.of3("虛空藏菩薩神呪經", "劉宋", "曇摩蜜多"), // 宋 曇摩蜜多譯
                "T0408", Kind.jin.of3("虛空孕菩薩經", "隋", "闍那崛多"), // 隋 闍那崛多譯
                "T0409", Kind.jin.of3("觀虛空藏菩薩經", "劉宋", "曇摩蜜多"), // 劉宋 曇摩蜜多譯
                "T0410", Kind.jin.of2("大方廣十輪經", "失譯"), // 失譯
                "T0411", Kind.jin.of3("大乘大集地藏十輪經", "唐", "玄奘"), // 唐 玄奘譯
                "T0412", Kind.jin.of3("地藏菩薩本願經", "唐", "實叉難陀"), // 唐 實叉難陀譯
                "T0413", Kind.jin.of3("百千頌大集經地藏菩薩請問法身讚", "唐", "不空"), // 唐 不空譯
                "T0414", Kind.jin.of3("菩薩念佛三昧經", "劉宋", "功德直"), // 劉宋 功德直譯
                "T0415", Kind.jin.of3("大方等大集經菩薩念佛三昧分", "隋", "達摩笈多"), // 隋 達磨笈多譯
                "T0416", Kind.jin.of3("大方等大集經賢護分", "隋", "闍那崛多"), // 隋 闍那崛多譯
                "T0417", Kind.jin.of3("般舟三昧經", "東漢", "支婁迦讖"), // 後漢 支婁迦讖譯
                "T0418", Kind.jin.of3("般舟三昧經", "東漢", "支婁迦讖"), // 後漢 支婁迦讖譯
                "T0419", Kind.jin.of2("拔陂菩薩經", "失譯"), // 失譯
                "T0420", Kind.jin.of3("自在王菩薩經", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯
                "T0421", Kind.jin.of3("奮迅王問經", "東魏", "般若流支"), // 元魏 瞿曇般若流支譯
                "T0422", Kind.jin.of3("大集譬喻王經", "隋", "闍那崛多"), // 隋 闍那崛多譯
                "T0423", Kind.jin.of3("僧伽吒經", "東魏", "月婆首那"), // 元魏 月婆首那譯
                "T0424", Kind.jin.of3("大集會正法經", "宋", "施護"), // 宋 施護譯
                "T0425", Kind.jin.of3("賢劫經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0426", Kind.jin.of3("佛說千佛因緣經", "後秦", "鳩摩羅什"), // 後秦 鳩摩羅什譯
                "T0427", Kind.jin.of3("佛說八吉祥神呪經", "吳", "支謙"), // 吳 支謙譯
                "T0428", Kind.jin.of3("佛說八陽神呪經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0429", Kind.jin.of3("佛說八部佛名經", "東魏", "般若流支"), // 元魏 瞿曇般若流支譯
                "T0430", Kind.jin.of3("八吉祥經", "梁", "僧伽婆羅"), // 梁 僧伽婆羅譯
                "T0431", Kind.jin.of3("八佛名號經", "隋", "闍那崛多"), // 隋 闍那崛多譯
                "T0432", Kind.jin.of2("佛說十吉祥經", "失譯"), // 失譯
                "T0433", Kind.jin.of3("佛說寶網經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0434", Kind.jin.of3("佛說稱揚諸佛功德經", "元魏", "吉迦夜"), // 元魏 吉迦夜譯
                "T0435", Kind.jin.of3("佛說滅十方冥經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0436", Kind.jin.of3("受持七佛名號所生功德經", "唐", "玄奘"), // 唐 玄奘譯
                "T0437", Kind.jin.of3("大乘寶月童子問法經", "宋", "施護"), // 宋 施護譯
                "T0438", Kind.jin.of3("佛說大乘大方廣佛冠經", "宋", "法護"), // 宋 法護等譯
                "T0439", Kind.jin.of3("佛說諸佛經", "宋", "施護"), // 宋 施護譯
                "T0440", Kind.jin.of3("佛說佛名經", "元魏", "菩提流支"), // 元魏 菩提流支譯
                "T0441", Kind.jin.of2("佛說佛名經"), //
                "T0442", Kind.jin.of2("十方千五百佛名經", "失譯"), // 失譯
                "T0443", Kind.jin.of3("五千五百佛名神呪除障滅罪經", "隋", "闍那崛多"), // 隋 闍那崛多譯
                "T0444", Kind.jin.of3("佛說百佛名經", "隋", "那連提黎耶舍"), // 隋 那連提耶舍譯
                "T0445", Kind.jin.of2("佛說不思議功德諸佛所護念經", "失譯"), // 失譯
                "T0446a",Kind.jin.of2("過去莊嚴劫千佛名經", "闕譯"), // 闕譯
                "T0446b",Kind.jin.of2("過去莊嚴劫千佛名經", "失譯"), // 失譯
                "T0447a",Kind.jin.of2("現在賢劫千佛名經", "闕譯"), // 闕譯
                "T0447b",Kind.jin.of2("現在賢劫千佛名經"), //
                "T0448a",Kind.jin.of2("未來星宿劫千佛名經", "闕譯"), // 闕譯
                "T0448b",Kind.jin.of2("未來星宿劫千佛名經", "失譯"), // 失譯
                "T0449", Kind.jin.of3("佛說藥師如來本願經", "隋", "達摩笈多"), // 隋 達摩笈多譯
                "T0450", Kind.jin.of3("藥師琉璃光如來本願功德經", "唐", "玄奘"), // 唐 玄奘譯
                "T0451", Kind.jin.of3("藥師琉璃光七佛本願功德經", "唐", "義淨"), // 唐 義淨譯
                "T0452", Kind.jin.of3("佛說觀彌勒菩薩上生兜率天經", "劉宋", "沮渠京聲"), // 宋 沮渠京聲譯
                "T0453", Kind.jin.of3("佛說彌勒下生經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0454", Kind.jin.of3("佛說彌勒下生成佛經", "後秦", "鳩摩羅什"), // 後秦 鳩摩羅什譯
                "T0455", Kind.jin.of3("佛說彌勒下生成佛經", "唐", "義淨"), // 唐 義淨譯
                "T0456", Kind.jin.of3("佛說彌勒大成佛經", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯
                "T0457", Kind.jin.of2("佛說彌勒來時經", "失譯"), // 失譯
                "T0458", Kind.jin.of3("文殊師利問菩薩署經", "東漢", "支婁迦讖"), // 後漢 支婁迦讖譯
                "T0459", Kind.jin.of3("佛說文殊悔過經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0460", Kind.jin.of3("佛說文殊師利淨律經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0461", Kind.jin.of3("佛說文殊師利現寶藏經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0462", Kind.jin.of3("大方廣寶篋經", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅譯
                "T0463", Kind.jin.of3("佛說文殊師利般涅槃經", "西晉", "聶道真"), // 西晉 聶道真譯
                "T0464", Kind.jin.of3("文殊師利問菩提經", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯
                "T0465", Kind.jin.of3("伽耶山頂經", "元魏", "菩提流支"), // 元魏 菩提流支譯
                "T0466", Kind.jin.of3("佛說象頭精舍經", "隋", "毘尼多流支"), // 隋 毘尼多流支譯
                "T0467", Kind.jin.of3("大乘伽耶山頂經", "唐", "菩提流志"), // 唐 菩提流志譯
                "T0468", Kind.jin.of3("文殊師利問經", "梁", "僧伽婆羅"), // 梁 僧伽婆羅譯
                "T0469", Kind.jin.of3("文殊問經字母品第十四", "唐", "不空"), // 唐 不空譯
                "T0470", Kind.jin.of3("佛說文殊師利巡行經", "元魏", "菩提流支"), // 元魏 菩提流支譯
                "T0471", Kind.jin.of3("佛說文殊師利行經", "隋", "闍那崛多"), // 隋 豆那掘多譯
                "T0472", Kind.jin.of3("佛說大乘善見變化文殊師利問法經", "宋", "天息災"), // 宋 天息災譯
                "T0473", Kind.jin.of3("佛說妙吉祥菩薩所問大乘法螺經", "宋", "天息災"), // 宋 法賢譯
                "T0474", Kind.jin.of3("佛說維摩詰經", "吳", "支謙"), // 吳 支謙譯
                "T0475", Kind.jin.of3("維摩詰所說經", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯
                "T0476", Kind.jin.of3("說無垢稱經", "唐", "玄奘"), // 唐 玄奘譯
                "T0477", Kind.jin.of3("佛說大方等頂王經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0478", Kind.jin.of3("大乘頂王經", "梁", "月婆首那"), // 梁 月婆首那譯
                "T0479", Kind.jin.of3("善思童子經", "隋", "闍那崛多"), // 隋 闍那崛多譯
                "T0480", Kind.jin.of3("佛說月上女經", "隋", "闍那崛多"), // 隋 闍那崛多譯
                "T0481", Kind.jin.of3("持人菩薩經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0482", Kind.jin.of3("持世經", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯
                "T0483", Kind.jin.of3("三曼陀跋陀羅菩薩經", "西晉", "聶道真"), // 西晉 聶道真譯
                "T0484", Kind.jin.of3("不思議光菩薩所說經", "後秦", "鳩摩羅什"), // 後秦 鳩摩羅什譯
                "T0485", Kind.jin.of3("無所有菩薩經", "隋", "闍那崛多"), // 隋 闍那崛多等譯
                "T0486", Kind.jin.of3("師子莊嚴王菩薩請問經", "唐", "那提"), // 唐 那提譯
                "T0487", Kind.jin.of3("離垢慧菩薩所問禮佛法經", "唐", "那提"), // 唐 那提譯
                "T0488", Kind.jin.of3("寶授菩薩菩提行經", "宋", "天息災"), // 宋 法賢譯
                "T0489", Kind.jin.of3("佛說除蓋障菩薩所問經", "宋", "法護"), // 宋 法護等譯
                "T0490", Kind.jin.of3("佛說八大菩薩經", "宋", "天息災"), // 宋 法賢譯
                "T0491", Kind.jin.of2("六菩薩亦當誦持經", "失譯"), // 失譯
                "T0492a",Kind.jin.of3("佛說阿難問事佛吉凶經", "東漢", "安清"), // 後漢 安世高譯
                "T0492b",Kind.jin.of3("阿難問事佛吉凶經", "東漢", "安清"), // 後漢 安世高譯
                "T0493", Kind.jin.of3("佛說阿難四事經", "吳", "支謙"), // 吳 支謙譯
                "T0494", Kind.jin.of3("阿難七夢經", "東晉", "曇無蘭"), // 東晉 竺曇無蘭譯
                "T0495", Kind.jin.of3("佛說阿難分別經", "乞伏秦", "法堅"), // 乞伏秦 法堅譯
                "T0496", Kind.jin.of3("佛說大迦葉本經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0497", Kind.jin.of3("佛說摩訶迦葉度貧母經", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅譯
                "T0498", Kind.jin.of3("佛說初分說經", "宋", "施護"), // 宋 施護譯
                "T0499", Kind.jin.of2("佛為阿支羅迦葉自化作苦經", "失譯"), // 失譯
                "T0500", Kind.jin.of3("羅云忍辱經", "西晉", "法炬"), // 西晉 法炬譯
                "T0501", Kind.jin.of3("佛說沙曷比丘功德經", "西晉", "法炬"), // 西晉 法炬譯
                "T0502", Kind.jin.of3("佛為年少比丘說正事經", "西晉", "法炬"), // 西晉 法炬譯
                "T0503", Kind.jin.of3("比丘避女惡名欲自殺經", "西晉", "法炬"), // 西晉 法炬譯
                "T0504", Kind.jin.of3("比丘聽施經", "東晉", "曇無蘭"), // 東晉 曇無蘭譯
                "T0505", Kind.jin.of3("佛說隨勇尊者經", "宋", "施護"), // 宋 施護等譯
                "T0506", Kind.jin.of3("犍陀國王經", "東漢", "安清"), // 後漢 安世高譯
                "T0507", Kind.jin.of3("佛說未生冤經", "吳", "支謙"), // 吳 支謙譯
                "T0508", Kind.jin.of3("阿闍世王問五逆經", "西晉", "法炬"), // 西晉 法炬譯
                "T0509", Kind.jin.of3("阿闍世王授決經", "西晉", "法炬"), // 西晉 法炬譯
                "T0510", Kind.jin.of3("採花違王上佛授決號妙花經", "東晉", "曇無蘭"), // 東晉 竺曇無蘭譯
                "T0511", Kind.jin.of3("佛說蓱沙王五願經", "吳", "支謙"), // 吳 支謙譯
                "T0512", Kind.jin.of3("佛說淨飯王般涅槃經", "劉宋", "沮渠京聲"), // 劉宋 沮渠京聲譯
                "T0513", Kind.jin.of3("佛說琉璃王經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0514", Kind.jin.of3("佛說諫王經", "劉宋", "沮渠京聲"), // 劉宋 沮渠京聲譯
                "T0515", Kind.jin.of3("如來示教勝軍王經", "唐", "玄奘"), // 唐 玄奘譯
                "T0516", Kind.jin.of3("佛說勝軍王所問經", "宋", "施護"), // 宋 施護譯
                "T0517", Kind.jin.of3("佛說末羅王經", "劉宋", "沮渠京聲"), // 劉宋 沮渠京聲譯
                "T0518", Kind.jin.of3("佛說旃陀越國王經", "劉宋", "沮渠京聲"), // 劉宋 沮渠京聲譯
                "T0519", Kind.jin.of3("佛說摩達國王經", "劉宋", "沮渠京聲"), // 劉宋 沮渠京聲譯
                "T0520", Kind.jin.of2("佛說薩羅國經", "失譯"), // 失譯
                "T0521", Kind.jin.of2("佛說梵摩難國王經", "失譯"), // 失譯
                "T0522", Kind.jin.of2("普達王經", "失譯"), // 失譯
                "T0523", Kind.jin.of2("佛說五王經", "失譯"), // 失譯
                "T0524", Kind.jin.of3("佛為優填王說王法政論經", "唐", "不空"), // 唐 不空譯
                "T0525", Kind.jin.of3("佛說長者子懊惱三處經", "東漢", "安清"), // 後漢 安世高譯
                "T0526", Kind.jin.of3("佛說長者子制經", "東漢", "安清"), // 後漢 安世高譯
                "T0527", Kind.jin.of3("佛說逝童子經", "西晉", "支法度"), // 西晉 支法度譯
                "T0528", Kind.jin.of3("佛說菩薩逝經", "西晉", "帛遠"), // 西晉 白法祖譯
                "T0529", Kind.jin.of2("佛說阿鳩留經", "失譯"), // 失譯
                "T0530", Kind.jin.of3("佛說須摩提長者經", "吳", "支謙"), // 吳 支謙譯
                "T0531", Kind.jin.of3("佛說長者音悅經", "吳", "支謙"), // 吳 支謙譯
                "T0532", Kind.jin.of3("私呵昧經", "吳", "支謙"), // 吳 支謙譯
                "T0533", Kind.jin.of3("菩薩生地經", "吳", "支謙"), // 吳 支謙譯
                "T0534", Kind.jin.of3("佛說月光童子經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0535", Kind.jin.of3("佛說申日經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0536", Kind.jin.of3("申日兒本經", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅譯
                "T0537", Kind.jin.of3("佛說越難經", "西晉", "聶承遠"), // 西晉 聶承遠譯
                "T0538", Kind.jin.of3("佛說呵雕阿那鋡經", "東晉", "曇無蘭"), // 東晉 竺曇無蘭譯
                "T0539", Kind.jin.of2("盧至長者因緣經", "失譯"), // 失譯
                "T0540a", Kind.jin.of3("佛說樹提伽經", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅譯
                "T0540b", Kind.jin.of3("佛說樹提伽經", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅譯
                "T0541", Kind.jin.of3("佛說佛大僧大經", "劉宋", "沮渠京聲"), // 劉宋 沮渠京聲譯
                "T0542", Kind.jin.of3("佛說耶祇經", "劉宋", "沮渠京聲"), // 劉宋 沮渠京聲譯
                "T0543", Kind.jin.of3("佛說巨力長者所問大乘經", "宋", "智吉祥"), // 宋 智吉祥等譯
                "T0544", Kind.jin.of3("辯意長者子經", "後魏", "法場"), // 後魏 法場譯
                "T0545", Kind.jin.of3("佛說德護長者經", "隋", "那連提黎耶舍"), // 隋 那連提耶舍譯
                "T0546", Kind.jin.of3("佛說金耀童子經", "宋", "天息災"), // 宋 天息災譯
                "T0547", Kind.jin.of3("大花嚴長者問佛那羅延力經", "唐", "般若", "利言"), // 唐 般若共利言譯
                "T0548", Kind.jin.of3("佛說金光王童子經", "宋", "天息災"), // 宋 法賢譯
                "T0549", Kind.jin.of3("佛說光明童子因緣經", "宋", "施護"), // 宋 施護譯
                "T0550", Kind.jin.of3("金色童子因緣經", "宋", "惟淨"), // 宋 惟淨等譯
                "T0551", Kind.jin.of3("佛說摩鄧女經", "東漢", "安清"), // 後漢 安世高譯
                "T0552", Kind.jin.of2("佛說摩登女解形中六事經", "失譯"), // 失譯
                "T0553", Kind.jin.of3("佛說㮈女祇域因緣經", "東漢", "安清"), // 後漢 安世高譯
                "T0554", Kind.jin.of3("佛說奈女耆婆經", "東漢", "安清"), // 後漢 安世高譯
                "T0555a", Kind.jin.of3("五母子經", "吳", "支謙"), // 吳 支謙譯
                "T0555b", Kind.jin.of3("五母子經", "吳", "支謙"), // 吳 支謙譯
                "T0556", Kind.jin.of3("佛說七女經", "吳", "支謙"), // 吳 支謙譯
                "T0557", Kind.jin.of3("佛說龍施女經", "吳", "支謙"), // 吳 支謙譯
                "T0558", Kind.jin.of3("佛說龍施菩薩本起經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0559", Kind.jin.of3("佛說老女人經", "吳", "支謙"), // 吳 支謙譯
                "T0560", Kind.jin.of3("佛說老母女六英經", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅譯
                "T0561", Kind.jin.of2("佛說老母經", "失譯"), // 失譯
                "T0562", Kind.jin.of3("佛說無垢賢女經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0563", Kind.jin.of3("佛說腹中女聽經", "北涼", "曇無讖"), // 北涼 曇無讖譯
                "T0564", Kind.jin.of3("佛說轉女身經", "劉宋", "曇摩蜜多"), // 劉宋 曇摩蜜多譯
                "T0565", Kind.jin.of3("順權方便經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0566", Kind.jin.of3("樂瓔珞莊嚴方便品經", "姚秦", "曇摩耶舍"), // 姚秦 曇摩耶舍譯
                "T0567", Kind.jin.of3("佛說梵志女首意經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0568", Kind.jin.of3("有德女所問大乘經", "唐", "菩提流志"), // 唐 菩提流志譯
                "T0569", Kind.jin.of3("佛說心明經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0570", Kind.jin.of3("佛說賢首經", "西秦", "法堅"), // 西秦 聖堅譯
                "T0571", Kind.jin.of3("佛說婦人遇辜經", "乞伏秦", "法堅"), // 乞伏秦 聖堅譯
                "T0572", Kind.jin.of2("佛說長者法志妻經", "失譯"), // 失譯
                "T0573", Kind.jin.of3("差摩婆帝授記經", "元魏", "菩提流支"), // 元魏 菩提流支譯
                "T0574", Kind.jin.of3("佛說堅固女經", "隋", "那連提黎耶舍"), // 隋 那連提耶舍譯
                "T0575", Kind.jin.of3("佛說大方等修多羅王經", "後魏", "菩提流支"), // 後魏 菩提流支譯
                "T0576", Kind.jin.of3("佛說轉有經", "東魏", "佛陀扇多"), // 元魏 佛陀扇多譯
                "T0577", Kind.jin.of3("佛說大乘流轉諸有經", "唐", "義淨"), // 唐 義淨譯
                "T0578", Kind.jin.of3("無垢優婆夷問經", "東魏", "般若流支"), // 後魏 瞿曇般若流支譯
                "T0579", Kind.jin.of2("優婆夷淨行法門經", "失譯"), // 失譯
                "T0580", Kind.jin.of2("佛說長者女菴提遮師子吼了義經", "失譯"), // 失譯
                "T0581", Kind.jin.of3("佛說八師經", "吳", "支謙"), // 吳 支謙譯
                "T0582", Kind.jin.of3("佛說孫多耶致經", "吳", "支謙"), // 吳 支謙譯
                "T0583", Kind.jin.of3("佛說黑氏梵志經", "吳", "支謙"), // 吳 支謙譯
                "T0584", Kind.jin.of3("長爪梵志請問經", "唐", "義淨"), // 唐 義淨譯
                "T0585", Kind.jin.of3("持心梵天所問經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0586", Kind.jin.of3("思益梵天所問經", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯
                "T0587", Kind.jin.of3("勝思惟梵天所問經", "元魏", "菩提流支"), // 元魏 菩提流支譯
                "T0588", Kind.jin.of3("佛說須真天子經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0589", Kind.jin.of3("佛說魔逆經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0590", Kind.jin.of3("佛說四天王經", "劉宋", "智嚴", "寶雲"), // 劉宋 智嚴共寶雲譯
                "T0591", Kind.jin.of3("商主天子所問經", "隋", "闍那崛多"), // 隋 闍那崛多譯
                "T0592", Kind.jin.of3("天請問經", "唐", "玄奘"), // 唐 玄奘譯
                "T0593", Kind.jin.of3("佛為勝光天子說王法經", "唐", "義淨"), // 唐 義淨譯
                "T0594", Kind.jin.of3("佛說大自在天子因地經", "宋", "施護"), // 宋 施護譯
                "T0595", Kind.jin.of3("佛說嗟韈曩法天子受三歸依獲免惡道經", "宋", "法天"), // 宋 法天譯
                "T0596", Kind.jin.of2("佛說天王太子辟羅經", "失譯"), // 失譯
                "T0597", Kind.jin.of3("龍王兄弟經", "吳", "支謙"), // 吳 支謙譯
                "T0598", Kind.jin.of3("佛說海龍王經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0599", Kind.jin.of3("佛為海龍王說法印經", "唐", "義淨"), // 唐 義淨譯
                "T0600", Kind.jin.of3("十善業道經", "唐", "實叉難陀"), // 唐 實叉難陀譯
                "T0601", Kind.jin.of3("佛為娑伽羅龍王所說大乘經", "宋", "施護"), // 宋 施護譯
                "T0602", Kind.jin.of3("佛說大安般守意經", "東漢", "安清"), // 後漢 安世高譯
                "T0603", Kind.jin.of3("陰持入經", "東漢", "安清"), // 後漢 安世高譯
                "T0604", Kind.jin.of3("佛說禪行三十七品經", "東漢", "安清"), // 後漢 安世高譯
                "T0605", Kind.jin.of3("禪行法想經", "東漢", "安清"), // 後漢 安世高譯
                "T0606", Kind.jin.of3("修行道地經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0607", Kind.jin.of3("道地經", "東漢", "安清", "眾護"), // 僧伽羅剎造  後漢 安世高譯
                "T0608", Kind.jin.of3("小道地經", "東漢", "支曜"), // 後漢 支曜譯
                "T0609", Kind.jin.of2("禪要經", "失譯"), // 失譯
                "T0610", Kind.jin.of2("佛說內身觀章句經", "失譯"), // 失譯
                "T0611", Kind.jin.of3("法觀經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0612", Kind.jin.of3("身觀經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0613", Kind.jin.of3("禪祕要法經", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什等譯
                "T0614", Kind.jin.of3("坐禪三昧經", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯
                "T0615", Kind.jin.of3("菩薩訶色欲法經", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯

                "T0616", Kind.lun.of3("禪法要解", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯
                "T0617", Kind.lun.of3("思惟略要法", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯

                "T0618", Kind.jin.of3("達摩多羅禪經", "東晉", "佛馱跋陀羅"), // 東晉 佛陀跋陀羅譯

                "T0619", Kind.lun.of3("五門禪經要用法", "劉宋", "曇摩蜜多", "佛陀蜜多"), // 佛陀蜜多撰  劉宋 曇摩蜜多譯
                "T0620", Kind.lun.of3("治禪病祕要法", "劉宋", "沮渠京聲"), // 劉宋 沮渠京聲譯

                "T0621", Kind.jin.of3("佛說佛印三昧經", "東漢", "安清"), // 後漢 安世高譯
                "T0622", Kind.jin.of3("佛說自誓三昧經", "東漢", "安清"), // 後漢 安世高譯
                "T0623", Kind.jin.of3("佛說如來獨證自誓三昧經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0624", Kind.jin.of3("佛說伅真陀羅所問如來三昧經", "東漢", "支婁迦讖"), // 後漢 支婁迦讖譯
                "T0625", Kind.jin.of3("大樹緊那羅王所問經", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯
                "T0626", Kind.jin.of3("佛說阿闍世王經", "東漢", "支婁迦讖"), // 後漢 支婁迦讖譯
                "T0627", Kind.jin.of3("文殊支利普超三昧經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0628", Kind.jin.of3("佛說未曾有正法經", "宋", "法天"), // 宋 法天譯
                "T0629", Kind.jin.of2("佛說放鉢經", "闕譯"), // 闕譯
                "T0630", Kind.jin.of3("佛說成具光明定意經", "東漢", "支曜"), // 後漢 支曜譯
                "T0631", Kind.jin.of3("佛說法律三昧經", "吳", "支謙"), // 吳 支謙譯
                "T0632", Kind.jin.of3("佛說慧印三昧經", "吳", "支謙"), // 吳 支謙譯
                "T0633", Kind.jin.of2("佛說如來智印經", "失譯"), // 失譯
                "T0634", Kind.jin.of3("佛說大乘智印經", "宋", "智吉祥"), // 宋 智吉祥等譯
                "T0635", Kind.jin.of3("佛說弘道廣顯三昧經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0636", Kind.jin.of3("無極寶三昧經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0637", Kind.jin.of3("佛說寶如來三昧經", "東晉", "祇多蜜"), // 東晉 祇多蜜譯
                "T0638", Kind.jin.of3("佛說超日明三昧經", "西晉", "聶承遠"), // 西晉 聶承遠譯
                "T0639", Kind.jin.of3("月燈三昧經", "高齊", "那連提黎耶舍"), // 高齊 那連提耶舍譯
                "T0640", Kind.jin.of3("佛說月燈三昧經", "劉宋", "先公"), // 劉宋 先公譯
                "T0641", Kind.jin.of3("佛說月燈三昧經", "劉宋", "先公"), // 劉宋 先公譯
                "T0642", Kind.jin.of3("佛說首楞嚴三昧經", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯
                "T0643", Kind.jin.of3("佛說觀佛三昧海經", "東晉", "佛馱跋陀羅"), // 東晉 佛陀跋陀羅譯
                "T0644", Kind.jin.of2("佛說金剛三昧本性清淨不壞不滅經", "失譯"), // 失譯
                "T0645", Kind.jin.of3("不必定入定入印經", "東魏", "般若流支"), // 元魏 瞿曇般若流支譯
                "T0646", Kind.jin.of3("入定不定印經", "唐", "義淨"), // 唐 義淨譯
                "T0647", Kind.jin.of3("力莊嚴三昧經", "隋", "那連提黎耶舍"), // 隋 那連提耶舍譯
                "T0648", Kind.jin.of3("寂照神變三摩地經", "唐", "玄奘"), // 唐 玄奘譯
                "T0649", Kind.jin.of3("觀察諸法行經", "隋", "闍那崛多"), // 隋 闍那崛多譯
                "T0650", Kind.jin.of3("諸法無行經", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯
                "T0651", Kind.jin.of3("佛說諸法本無經", "隋", "闍那崛多"), // 隋 闍那崛多譯
                "T0652", Kind.jin.of3("佛說大乘隨轉宣說諸法經", "宋", "紹德"), // 宋 紹德等譯
                "T0653", Kind.jin.of3("佛藏經", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯
                "T0654", Kind.jin.of3("佛說入無分別法門經", "宋", "施護"), // 宋 施護譯
                "T0655", Kind.jin.of3("佛說勝義空經", "宋", "施護"), // 宋 施護等譯
                "T0656", Kind.jin.of3("菩薩瓔珞經", "前秦", "竺佛念"), // 姚秦 竺佛念譯
                "T0657", Kind.jin.of3("佛說華手經", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯
                "T0658", Kind.jin.of3("寶雲經", "梁", "曼陀羅仙"), // 梁 曼陀羅仙譯
                "T0659", Kind.jin.of3("大乘寶雲經", "梁", "曼陀羅仙", "僧伽婆羅"), // 梁 曼陀羅仙共僧伽婆羅譯
                "T0660", Kind.jin.of3("佛說寶雨經", "唐", "菩提流志"), // 唐 達摩流支譯
                "T0661", Kind.jin.of3("大乘百福相經", "唐", "地婆訶羅"), // 唐 地婆訶羅譯
                "T0662", Kind.jin.of3("大乘百福莊嚴相經", "唐", "地婆訶羅"), // 唐 地婆訶羅譯
                "T0663", Kind.jin.of3("金光明經", "北涼", "曇無讖"), // 北涼 曇無讖譯
                "T0664", Kind.jin.of3("合部金光明經", "隋", "寶貴"), // 隋 寶貴合
                "T0665", Kind.jin.of3("金光明最勝王經", "唐", "義淨"), // 唐 義淨譯
                "T0666", Kind.jin.of3("大方等如來藏經", "東晉", "佛馱跋陀羅"), // 東晉 佛陀跋陀羅譯
                "T0667", Kind.jin.of3("大方廣如來藏經", "唐", "不空"), // 唐 不空譯
                "T0668", Kind.jin.of3("佛說不增不減經", "元魏", "菩提流支"), // 元魏 菩提流支譯
                "T0669", Kind.jin.of3("佛說無上依經", "梁", "真諦"), // 梁 真諦譯
                "T0670", Kind.jin.of3("楞伽阿跋多羅寶經", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅譯
                "T0671", Kind.jin.of3("入楞伽經", "元魏", "菩提流支"), // 元魏 菩提流支譯
                "T0672", Kind.jin.of3("大乘入楞伽經", "唐", "實叉難陀"), // 唐 實叉難陀譯
                "T0673", Kind.jin.of3("大乘同性經", "宇文周", "闍那耶舍"), // 宇文周 闍那耶舍譯
                "T0674", Kind.jin.of3("證契大乘經", "唐", "地婆訶羅"), // 唐 地婆訶羅譯
                "T0675", Kind.jin.of3("深密解脫經", "元魏", "菩提流支"), // 元魏 菩提流支譯
                "T0676", Kind.jin.of3("解深密經", "唐", "玄奘"), // 唐 玄奘譯
                "T0677", Kind.jin.of3("佛說解節經", "陳", "真諦"), // 陳 真諦譯
                "T0678", Kind.jin.of3("相續解脫地波羅蜜了義經", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅譯
                "T0679", Kind.jin.of3("相續解脫如來所作隨順處了義經", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅譯
                "T0680", Kind.jin.of3("佛說佛地經", "唐", "玄奘"), // 唐 玄奘譯
                "T0681", Kind.jin.of3("大乘密嚴經", "唐", "地婆訶羅"), // 唐 地婆訶羅譯
                "T0682", Kind.jin.of3("大乘密嚴經", "唐", "不空"), // 唐 不空譯
                "T0683", Kind.jin.of3("佛說諸德福田經", "西晉", "法立", "法炬"), // 西晉 法立法炬共譯
                "T0684", Kind.jin.of3("佛說父母恩難報經", "東漢", "安清"), // 後漢 安世高譯
                "T0685", Kind.jin.of3("佛說盂蘭盆經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0686", Kind.jin.of2("佛說報恩奉盆經", "失譯"), // 失譯
                "T0687", Kind.jin.of2("佛說孝子經", "失譯"), // 失譯
                "T0688", Kind.jin.of2("佛說未曾有經", "失譯"), // 失譯
                "T0689", Kind.jin.of3("甚希有經", "唐", "玄奘"), // 唐 玄奘譯
                "T0690", Kind.jin.of3("佛說希有挍量功德經", "隋", "闍那崛多"), // 隋 闍那崛多譯
                "T0691", Kind.jin.of3("最無比經", "唐", "玄奘"), // 唐 玄奘譯
                "T0692", Kind.jin.of2("佛說作佛形像經", "闕譯"), // 闕譯
                "T0693", Kind.jin.of2("佛說造立形像福報經", "闕譯"), // 闕譯
                "T0694", Kind.jin.of3("佛說大乘造像功德經", "唐", "提雲般若"), // 唐 提雲般若譯
                "T0695", Kind.jin.of3("佛說灌洗佛形像經", "西晉", "法炬"), // 西晉 法炬譯
                "T0696", Kind.jin.of3("佛說摩訶剎頭經", "西秦", "法堅"), // 西秦 聖堅譯
                "T0697", Kind.jin.of3("佛說浴像功德經", "唐", "寶思惟"), // 唐 寶思惟譯
                "T0698", Kind.jin.of3("浴佛功德經", "唐", "義淨"), // 唐 義淨譯
                "T0699", Kind.jin.of3("佛說造塔功德經", "唐", "地婆訶羅"), // 唐 地婆訶羅譯
                "T0700", Kind.jin.of3("右繞佛塔功德經", "唐", "實叉難陀"), // 唐 實叉難陀譯
                "T0701", Kind.jin.of3("佛說溫室洗浴眾僧經", "東漢", "安清"), // 後漢 安世高譯
                "T0702", Kind.jin.of3("佛說施燈功德經", "高齊", "那連提黎耶舍"), // 高齊 那連提耶舍譯
                "T0703", Kind.jin.of3("燈指因緣經", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯
                "T0704", Kind.jin.of3("佛說樓閣正法甘露鼓經", "宋", "天息災"), // 宋 天息災譯
                "T0705", Kind.jin.of3("佛說布施經", "宋", "天息災"), // 宋 法賢譯
                "T0706", Kind.jin.of3("佛說五大施經", "宋", "施護"), // 宋 施護等譯
                "T0707", Kind.jin.of2("佛說出家功德經", "失譯"), // 失譯
                "T0708", Kind.jin.of3("了本生死經", "吳", "支謙"), // 吳 支謙譯
                "T0709", Kind.jin.of2("佛說稻芉經", "闕譯"), // 闕譯
                "T0710", Kind.jin.of3("慈氏菩薩所說大乘緣生稻𦼮喻經", "唐", "不空"), // 唐 不空譯
                "T0711", Kind.jin.of3("大乘舍黎娑擔摩經", "宋", "施護"), // 宋 施護譯
                "T0712", Kind.jin.of2("佛說大乘稻芉經", "失譯"), // 失譯
                "T0713", Kind.jin.of3("貝多樹下思惟十二因緣經", "吳", "支謙"), // 吳 支謙譯
                "T0714", Kind.jin.of3("緣起聖道經", "唐", "玄奘"), // 唐 玄奘譯
                "T0715", Kind.jin.of3("佛說舊城喻經", "宋", "天息災"), // 宋 法賢譯
                "T0716", Kind.jin.of3("緣生初勝分法本經", "隋", "達摩笈多"), // 隋 達摩笈多譯
                "T0717", Kind.jin.of3("分別緣起初勝法門經", "唐", "玄奘"), // 唐 玄奘譯
                "T0718", Kind.jin.of3("佛說分別緣生經", "宋", "法天"), // 宋 法天譯
                "T0719", Kind.jin.of3("十二緣生祥瑞經", "宋", "施護"), // 宋 施護譯
                "T0720", Kind.jin.of2("無明羅剎集", "失譯"), // 失譯
                "T0721", Kind.jin.of3("正法念處經", "東魏", "般若流支"), // 元魏 瞿曇般若流支譯
                "T0722", Kind.jin.of3("妙法聖念處經", "宋", "法天"), // 宋 法天譯
                "T0723", Kind.jin.of3("分別業報略經", "劉宋", "僧伽跋摩", "大勇"), // 大勇菩薩撰  劉宋 僧伽跋摩譯
                "T0724", Kind.jin.of3("佛說罪業應報教化地獄經", "東漢", "安清"), // 後漢 安世高譯
                "T0725", Kind.jin.of3("佛說六道伽陀經", "宋", "法天"), // 宋 法天譯
                "T0726", Kind.jin.of3("六趣輪迴經", "宋", "日稱", "馬鳴"), // 馬鳴菩薩集  宋 日稱等譯
                "T0727", Kind.jin.of3("十不善業道經", "宋", "日稱", "馬鳴"), // 馬鳴菩薩集  宋 日稱等譯
                "T0728", Kind.jin.of3("諸法集要經", "宋", "日稱", "觀無畏"), // 觀無畏尊者集  宋 日稱等譯
                "T0729", Kind.jin.of3("佛說分別善惡所起經", "東漢", "安清"), // 後漢 安世高譯
                "T0730", Kind.jin.of3("佛說處處經", "東漢", "安清"), // 後漢 安世高譯
                "T0731", Kind.jin.of3("佛說十八泥犁經", "東漢", "安清"), // 後漢 安世高譯
                "T0732", Kind.jin.of3("佛說罵意經", "東漢", "安清"), // 後漢 安世高譯
                "T0733", Kind.jin.of3("佛說堅意經", "東漢", "安清"), // 後漢 安世高譯
                "T0734", Kind.jin.of3("佛說鬼問目連經", "東漢", "安清"), // 後漢 安世高譯
                "T0735", Kind.jin.of3("佛說四願經", "吳", "支謙"), // 吳 支謙譯
                "T0736", Kind.jin.of3("佛說四自侵經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0737", Kind.jin.of3("所欲致患經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0738", Kind.jin.of3("佛說分別經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0739", Kind.jin.of3("佛說慢法經", "西晉", "法炬"), // 西晉 法炬譯
                "T0740", Kind.jin.of2("佛說頞多和多耆經", "失譯"), // 失譯
                "T0741", Kind.jin.of3("五苦章句經", "東晉", "曇無蘭"), // 東晉 竺曇無蘭譯
                "T0742", Kind.jin.of3("佛說自愛經", "東晉", "曇無蘭"), // 東晉 竺曇無蘭譯
                "T0743", Kind.jin.of3("佛說忠心經", "東晉", "曇無蘭"), // 東晉 竺曇無蘭譯
                "T0744", Kind.jin.of3("佛說除恐災患經", "乞伏秦", "法堅"), // 乞伏秦 聖堅譯
                "T0745", Kind.jin.of3("佛說雜藏經", "東晉", "法顯"), // 東晉 法顯譯
                "T0746", Kind.jin.of2("餓鬼報應經", "失譯"), // 失譯
                "T0747a",Kind.jin.of3("佛說罪福報應經", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅譯
                "T0747b",Kind.jin.of3("佛說輪轉五道罪福報應經", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅譯
                "T0748", Kind.jin.of2("佛說護淨經", "失譯"), // 失譯
                "T0749", Kind.jin.of2("佛說因緣僧護經", "失譯"), // 失譯
                "T0750", Kind.jin.of2("沙彌羅經", "失譯"), // 失譯
                "T0751a", Kind.jin.of3("佛說五無反復經", "劉宋", "沮渠京聲"), // 劉宋 沮渠京聲譯
                "T0751b", Kind.jin.of3("佛說五無返復經", "劉宋", "沮渠京聲"), // 劉宋 沮渠京聲譯
                "T0752", Kind.jin.of3("佛說五無返復經", "劉宋", "沮渠京聲"), // 劉宋 沮渠京聲譯
                "T0753", Kind.jin.of3("十二品生死經", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅譯
                "T0754", Kind.jin.of3("佛說未曾有因緣經", "蕭齊", "曇景"), // 蕭齊 曇景譯
                "T0755", Kind.jin.of3("佛說淨意優婆塞所問經", "宋", "施護"), // 宋 施護譯
                "T0756", Kind.jin.of3("佛說八無暇有暇經", "唐", "義淨"), // 唐 義淨譯
                "T0757", Kind.jin.of3("佛說身毛喜豎經", "宋", "惟淨"), // 宋 惟淨等譯
                "T0758", Kind.jin.of3("佛說諸行有為經", "宋", "法天"), // 宋 法天譯
                "T0759", Kind.jin.of3("佛說較量壽命經", "宋", "天息災"), // 宋 天息災譯
                "T0760", Kind.jin.of3("惟日雜難經", "吳", "支謙"), // 吳 支謙譯
                "T0761", Kind.jin.of3("佛說法集經", "元魏", "菩提流支"), // 元魏 菩提流支譯
                "T0762", Kind.jin.of3("佛說決定義經", "宋", "天息災"), // 宋 法賢譯
                "T0763", Kind.jin.of3("佛說法乘義決定經", "宋", "金總持"), // 宋 金總持等譯
                "T0764", Kind.jin.of3("佛說法集名數經", "宋", "施護"), // 宋 施護譯
                "T0765", Kind.jin.of3("本事經", "唐", "玄奘"), // 唐 玄奘譯
                "T0766", Kind.jin.of3("佛說法身經", "宋", "天息災"), // 宋 法賢譯
                "T0767", Kind.jin.of3("佛說三品弟子經", "吳", "支謙"), // 吳 支謙譯
                "T0768", Kind.jin.of2("三慧經", "失譯"), // 失譯
                "T0769", Kind.jin.of3("佛說四輩經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0770", Kind.jin.of3("佛說四不可得經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0771", Kind.jin.of3("四品學法經", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅譯
                "T0772", Kind.jin.of3("大乘四法經", "唐", "地婆訶羅"), // 唐 地婆訶羅譯
                "T0773", Kind.jin.of3("佛說菩薩修行四法經", "唐", "地婆訶羅"), // 唐 地婆訶羅譯
                "T0774", Kind.jin.of3("大乘四法經", "唐", "實叉難陀"), // 唐 實叉難陀譯
                "T0775", Kind.jin.of3("佛說四無所畏經", "宋", "施護"), // 宋 施護譯
                "T0776", Kind.jin.of3("佛說四品法門經", "宋", "天息災"), // 宋 法賢譯
                "T0777", Kind.jin.of3("佛說賢者五福德經", "西晉", "帛遠"), // 西晉 白法祖譯
                "T0778", Kind.jin.of3("佛說菩薩內習六波羅蜜經", "東漢", "嚴佛調"), // 後漢 嚴佛調譯
                "T0779", Kind.jin.of3("佛說八大人覺經", "東漢", "安清"), // 後漢 安世高譯
                "T0780", Kind.jin.of3("佛說十力經", "唐", "勿提提羼魚"), // 唐 勿提提犀魚譯
                "T0781", Kind.jin.of3("佛說佛十力經", "宋", "施護"), // 宋 施護等譯
                "T0782", Kind.jin.of3("佛說十號經", "宋", "天息災"), // 宋 天息災譯
                "T0783", Kind.jin.of3("佛說十二頭陀經", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅譯
                "T0784", Kind.jin.of3("四十二章經", "東漢", "攝摩騰", "竺法蘭"), // 後漢 迦葉摩騰共法蘭譯
                "T0785", Kind.jin.of2("得道梯橙錫杖經", "失譯"), // 失譯
                "T0786", Kind.jin.of2("佛說木槵子經", "失譯"), // 失譯
                "T0787", Kind.jin.of3("曼殊室利呪藏中校量數珠功德經", "唐", "義淨"), // 唐 義淨譯
                "T0788", Kind.jin.of3("佛說校量數珠功德經", "唐", "寶思惟"), // 唐 寶思惟譯
                "T0789", Kind.jin.of3("金剛頂瑜伽念珠經", "唐", "不空"), // 唐 不空譯
                "T0790", Kind.jin.of3("佛說孛經抄", "吳", "支謙"), // 吳 支謙譯
                "T0791", Kind.jin.of3("佛說出家緣經", "東漢", "安清"), // 後漢 安世高譯
                "T0792", Kind.jin.of3("佛說法受塵經", "東漢", "安清"), // 後漢 安世高譯
                "T0793", Kind.jin.of3("佛說佛醫經", "吳", "竺律炎", "支謙"), // 吳 竺律炎共支越譯
                "T0794a", Kind.jin.of3("佛說時非時經", "西晉", "若羅嚴"), // 西晉 若羅嚴譯
                "T0794b", Kind.jin.of3("佛說時非時經", "西晉", "若羅嚴"), // 西晉 若羅嚴譯
                "T0795", Kind.jin.of2("佛治身經", "失譯"), // 失譯
                "T0796", Kind.jin.of3("佛說見正經", "東晉", "曇無蘭"), // 東晉 竺曇無蘭譯
                "T0797a", Kind.jin.of3("佛說貧窮老公經", "劉宋", "慧簡"), // 劉宋 慧簡譯
                "T0797b", Kind.jin.of3("佛說貧窮老公經", "劉宋", "慧簡"), // 劉宋 慧簡譯
                "T0798", Kind.jin.of3("佛說進學經", "劉宋", "沮渠京聲"), // 劉宋 沮渠京聲譯
                "T0799", Kind.jin.of3("佛說略教誡經", "唐", "義淨"), // 唐 義淨譯
                "T0800", Kind.jin.of2("佛說無上處經", "失譯"), // 失譯
                "T0801", Kind.jin.of3("佛說無常經", "唐", "義淨"), // 唐 義淨譯
                "T0802", Kind.jin.of3("佛說信解智力經", "宋", "天息災"), // 宋 法賢譯
                "T0803", Kind.jin.of3("佛說清淨心經", "宋", "施護"), // 宋 施護等譯
                "T0804", Kind.jin.of3("佛說解憂經", "宋", "法天"), // 宋 法天譯
                "T0805", Kind.jin.of2("佛說栴檀樹經", "失譯"), // 失譯
                "T0806", Kind.jin.of2("佛說枯樹經"), //
                "T0807", Kind.jin.of3("佛說內藏百寶經", "東漢", "支婁迦讖"), // 後漢 支婁迦讖譯
                "T0808", Kind.jin.of3("佛說犢子經", "吳", "支謙"), // 吳 支謙譯
                "T0809", Kind.jin.of3("佛說乳光佛經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0810", Kind.jin.of3("諸佛要集經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0811", Kind.jin.of3("佛說決定總持經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0812", Kind.jin.of3("菩薩行五十緣身經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0813", Kind.jin.of3("佛說無希望經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0814", Kind.jin.of3("佛說象腋經", "劉宋", "曇摩蜜多"), // 劉宋 曇摩蜜多譯
                "T0815", Kind.jin.of3("佛昇忉利天為母說法經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0816", Kind.jin.of3("佛說道神足無極變化經", "西晉", "安法欽"), // 西晉 安法欽譯
                "T0817", Kind.jin.of3("佛說大淨法門經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T0818", Kind.jin.of3("大莊嚴法門經", "隋", "那連提黎耶舍"), // 隋 那連提耶舍譯
                "T0819", Kind.jin.of2("佛說法常住經", "失譯"), // 失譯
                "T0820", Kind.jin.of3("佛說演道俗業經", "乞伏秦", "法堅"), // 乞伏秦 聖堅譯
                "T0821", Kind.jin.of2("大方廣如來祕密藏經", "失譯"), // 失譯
                "T0822", Kind.jin.of3("佛說諸法勇王經", "劉宋", "曇摩蜜多"), // 劉宋 曇摩蜜多譯
                "T0823", Kind.jin.of3("佛說一切法高王經", "東魏", "般若流支"), // 元魏 瞿曇般若流支譯
                "T0824", Kind.jin.of3("諸法最上王經", "隋", "闍那崛多"), // 隋 闍那崛多譯
                "T0825", Kind.jin.of2("佛說甚深大迴向經", "失譯"), // 失譯
                "T0826", Kind.jin.of3("弟子死復生經", "劉宋", "沮渠京聲"), // 劉宋 沮渠京聲譯
                "T0827", Kind.jin.of3("佛說懈怠耕者經", "劉宋", "慧簡"), // 劉宋 惠簡譯
                "T0828", Kind.jin.of3("無字寶篋經", "元魏", "菩提流支"), // 元魏 菩提流支譯
                "T0829", Kind.jin.of3("大乘離文字普光明藏經", "唐", "地婆訶羅"), // 唐 地婆訶羅譯
                "T0830", Kind.jin.of3("大乘遍照光明藏無字法門經", "唐", "地婆訶羅"), // 唐 地婆訶羅再譯
                "T0831", Kind.jin.of3("謗佛經", "元魏", "菩提流支"), // 元魏 菩提流支譯
                "T0832", Kind.jin.of3("佛語經", "元魏", "菩提流支"), // 元魏 菩提流支譯
                "T0833", Kind.jin.of3("第一義法勝經", "東魏", "般若流支"), // 元魏 瞿曇般若流支譯
                "T0834", Kind.jin.of3("大威燈光仙人問疑經", "隋", "闍那崛多"), // 隋 闍那崛多等譯
                "T0835", Kind.jin.of3("如來師子吼經", "元魏", "佛陀扇多"), // 元魏 佛陀扇多譯
                "T0836", Kind.jin.of3("大方廣師子吼經", "唐", "地婆訶羅"), // 唐 地婆訶羅譯
                "T0837", Kind.jin.of3("佛說出生菩提心經", "隋", "闍那崛多"), // 隋 闍那崛多譯
                "T0838", Kind.jin.of3("佛說發菩提心破諸魔經", "宋", "施護"), // 宋 施護譯
                "T0839", Kind.jin.of3("占察善惡業報經", "隋", "菩提登"), // 隋 菩提燈譯
                "T0840", Kind.jin.of3("稱讚大乘功德經", "唐", "玄奘"), // 唐 玄奘譯
                "T0841", Kind.jin.of3("說妙法決定業障經", "唐", "智嚴"), // 唐 智嚴譯
                "T0842", Kind.jin.of3("大方廣圓覺修多羅了義經", "唐", "佛陀多羅"), // 唐 佛陀多羅譯
                "T0843", Kind.jin.of3("佛說大乘不思議神通境界經", "宋", "施護"), // 宋 施護譯
                "T0844", Kind.jin.of3("佛說大方廣未曾有經善巧方便品", "宋", "施護"), // 宋 施護譯
                "T0845", Kind.jin.of3("佛說尊那經", "宋", "天息災"), // 宋 法賢譯
                "T0846", Kind.jin.of3("外道問聖大乘法無我義經", "宋", "法天"), // 宋 法天譯
                "T0847", Kind.jin.of3("大乘修行菩薩行門諸經要集", "唐", "智嚴"), // 唐 智嚴譯
                "T0848", Kind.jin.of3("大毘盧遮那成佛神變加持經", "唐", "善無畏", "一行"), // 唐 善無畏．一行譯
                "T0849", Kind.jin.of3("大毘盧遮那佛說要略念誦經", "唐", "金剛智"), // 唐 菩提金剛譯

                "T0850", Kind.yiGui.of3("攝大毘盧遮那成佛神變加持經入蓮華胎藏海會悲生曼荼攞廣大念誦儀軌供養方便會", "唐", "善無畏"), // 唐 輸婆迦羅譯
                "T0851", Kind.yiGui.of3("大毘盧遮那經廣大儀軌", "唐", "善無畏"), // 唐 善無畏譯
                "T0852a", Kind.yiGui.of3("大毘盧遮那成佛神變加持經蓮華胎藏悲生曼荼羅廣大成就儀軌供養方便會", "唐", "法全"), // 唐 法全撰
                "T0852b", Kind.yiGui.of2("大毘盧舍那成佛神變加持經蓮華胎藏悲生曼荼羅廣大成就儀軌"), //
                "T0853", Kind.yiGui.of3("大毘盧遮那成佛神變加持經蓮華胎藏菩提幢標幟普通真言藏廣大成就瑜伽", "唐", "法全"), // 唐 法全集
                "T0854", Kind.yiGui.of2("胎藏梵字真言", "失譯"), // 失譯
                "T0855", Kind.yiGui.of2("青龍寺軌記"), //
                "T0856", Kind.yiGui.of3("大毘盧遮那成佛神變加持經略示七支念誦隨行法", "唐", "不空"), // 唐 不空譯
                "T0857", Kind.yiGui.of3("大日經略攝念誦隨行法", "唐", "不空"), // 唐 不空譯
                "T0858", Kind.yiGui.of2("大毘盧遮那略要速疾門五支念誦法"), //
                "T0859", Kind.yiGui.of2("供養儀式"), //
                "T0860", Kind.yiGui.of2("大日經持誦次第儀軌"), //
                "T0861", Kind.yiGui.of3("毘盧遮那五字真言修習儀軌", "唐", "不空"), // 唐 不空譯
                "T0862", Kind.yiGui.of2("阿闍梨大曼荼攞灌頂儀軌"), //

                "T0863", Kind.lun.of3("大毘盧遮那經阿闍梨真實智品中阿闍梨住阿字觀門", "唐", "惟謹"), // 唐 惟謹述
                "T0864A", Kind.lun.of2("大日如來劍印"), //
                "T0864B", Kind.lun.of3("胎藏金剛教法名號", "唐", "義操"), // 唐 義操集

                "T0865", Kind.jin.of3("金剛頂一切如來真實攝大乘現證大教王經", "唐", "不空"), // 唐 不空譯
                "T0866", Kind.jin.of3("金剛頂瑜伽中略出念誦經", "唐", "金剛智"), // 唐 金剛智譯
                "T0867", Kind.jin.of3("金剛峰樓閣一切瑜伽瑜祇經", "唐", "金剛智"), // 唐 金剛智譯
                "T0868", Kind.jin.of3("諸佛境界攝真實經", "唐", "般若"), // 唐 般若譯
                
                "T0869", Kind.lun.of3("金剛頂經瑜伽十八會指歸", "唐", "不空"), // 唐 不空譯
                "T0870", Kind.lun.of3("略述金剛頂瑜伽分別聖位修證法門", "唐", "不空"), // 唐 不空譯
                "T0871", Kind.lun.of3("金剛頂瑜伽略述三十七尊心要", "唐", "不空"), // 唐 不空譯
                "T0872", Kind.lun.of3("金剛頂瑜伽三十七尊出生義", "唐", "不空"), // 唐 不空譯
                
                "T0873", Kind.yiGui.of3("金剛頂蓮華部心念誦儀軌", "唐", "不空"), // 唐 不空譯
                
                "T0874", Kind.jin.of3("金剛頂一切如來真實攝大乘現證大教王經", "唐", "不空"), // 唐 不空譯
                
                "T0875", Kind.yiGui.of2("蓮華部心念誦儀軌", "失譯"), // 失譯
                
                "T0876", Kind.lun.of3("金剛頂瑜伽修習毘盧遮那三摩地法", "唐", "金剛智"), // 唐 金剛智譯
                "T0877", Kind.lun.of3("金剛頂經毘盧遮那一百八尊法身契印", "唐", "善無畏", "一行"), // 唐 善無畏．一行譯
                
                "T0878", Kind.yiGui.of3("金剛頂經金剛界大道場毘盧遮那如來自受用身內證智眷屬法身異名佛最上乘祕密三摩地禮懺文", "唐", "不空"), // 唐 不空譯
                "T0879", Kind.yiGui.of3("金剛頂瑜伽三十七尊禮", "唐", "不空"), // 唐 不空譯
                
                "T0880", Kind.lun.of3("瑜伽金剛頂經釋字母品", "唐", "不空"), // 唐 不空譯
                "T0881", Kind.lun.of2("賢劫十六尊"), //
                
                "T0882", Kind.jin.of3("佛說一切如來真實攝大乘現證三昧大教王經", "宋", "施護"), // 宋 施護等譯
                "T0883", Kind.jin.of3("佛說祕密三昧大教王經", "宋", "施護"), // 宋 施護等譯
                "T0884", Kind.jin.of3("佛說祕密相經", "宋", "施護"), // 宋 施護等譯
                "T0885", Kind.jin.of3("佛說一切如來金剛三業最上祕密大教王經", "宋", "施護"), // 宋 施護譯
                "T0886", Kind.jin.of3("佛說金剛場莊嚴般若波羅蜜多教中一分", "宋", "施護"), // 宋 施護譯
                "T0887", Kind.jin.of3("佛說無二平等最上瑜伽大教王經", "宋", "施護"), // 宋 施護譯
                
                "T0888", Kind.yiGui.of3("一切祕密最上名義大教王儀軌", "宋", "施護"), // 宋 施護譯
                
                "T0889", Kind.jin.of3("一切如來大祕密王未曾有最上微妙大曼拏羅經", "宋", "天息災"), // 宋 天息災譯
                "T0890", Kind.jin.of3("佛說瑜伽大教王經", "宋", "天息災"), // 宋 法賢譯
                "T0891", Kind.jin.of3("佛說幻化網大瑜伽教十忿怒明王大明觀想儀軌經", "宋", "天息災"), // 宋 法賢譯
                "T0892", Kind.jin.of3("佛說大悲空智金剛大教王儀軌經", "宋", "法護"), // 宋 法護譯
                "T0893a", Kind.jin.of3("蘇悉地羯羅經", "唐", "善無畏"), // 唐 輸波迦羅譯
                "T0893b", Kind.jin.of3("蘇悉地羯羅經", "唐", "善無畏"), // 唐 輸波迦羅譯
                "T0893c", Kind.jin.of3("蘇悉地羯羅經", "唐", "善無畏"), // 唐 輸波迦羅譯
                
                "T0894a", Kind.yiGui.of3("蘇悉地羯羅供養法", "唐", "善無畏"), // 唐 善無畏譯
                "T0894b", Kind.yiGui.of3("蘇悉地羯羅供養法", "唐", "善無畏"), // 唐 善無畏譯
                
                "T0895a", Kind.jin.of3("蘇婆呼童子請問經", "唐", "善無畏"), // 唐 輸波迦羅譯
                "T0895b", Kind.jin.of3("蘇婆呼童子請問經", "唐", "善無畏"), // 唐 輸波迦羅譯
                "T0896", Kind.jin.of3("妙臂菩薩所問經", "宋", "法天"), // 宋 法天譯
                "T0897", Kind.jin.of3("蕤呬耶經", "唐", "不空"), // 唐 不空譯
                "T0898", Kind.jin.of2("佛說毘奈耶經"), //
                "T0899", Kind.jin.of2("清淨法身毘盧遮那心地法門成就一切陀羅尼三種悉地"), //
                
                "T0900", Kind.lun.of3("十八契印", "唐", "慧果"), // 唐 惠果造
                
                "T0901", Kind.jin.of3("陀羅尼集經", "唐", "阿地瞿多"), // 唐 阿地瞿多譯
                
                "T0902", Kind.lun.of3("總釋陀羅尼義讚", "唐", "不空"), // 唐 不空譯
                "T0903", Kind.lun.of3("都部陀羅尼目", "唐", "不空"), // 唐 不空譯
                "T0904", Kind.lun.of3("念誦結護法普通諸部", "唐", "金剛智"), // 唐 金剛智述
                "T0905", Kind.lun.of3("三種悉地破地獄轉業障出三界祕密陀羅尼法", "唐", "善無畏"), // 唐 善無畏譯
                
                "T0906", Kind.yiGui.of3("佛頂尊勝心破地獄轉業障出三界祕密三身佛果三種悉地真言儀軌", "唐", "善無畏"), // 唐 善無畏譯
                "T0907", Kind.yiGui.of3("佛頂尊勝心破地獄轉業障出三界祕密陀羅尼", "唐", "善無畏"), // 唐 善無畏譯
                "T0908", Kind.yiGui.of3("金剛頂瑜伽護摩儀軌", "唐", "不空"), // 唐 不空譯
                "T0909", Kind.yiGui.of3("金剛頂瑜伽護摩儀軌", "唐", "不空"), // 唐 不空譯
                "T0910", Kind.yiGui.of2("梵天擇地法"), //
                "T0911", Kind.yiGui.of3("建立曼荼羅及揀擇地法", "唐", "慧琳"), // 唐 慧琳集
                "T0912", Kind.yiGui.of3("建立曼荼羅護摩儀軌", "唐", "法全"), // 唐 法全集
                "T0913", Kind.yiGui.of2("火𤙖供養儀軌"), //
                "T0914", Kind.yiGui.of2("火吽軌別錄"), //
                "T0915", Kind.yiGui.of3("受菩提心戒儀", "唐", "不空"), // 唐 不空譯
                "T0916", Kind.yiGui.of2("受五戒八戒文"), //
                
                "T0917", Kind.lun.of3("無畏三藏禪要", "唐", "善無畏"), // 唐 善無畏說
                
                "T0918", Kind.jin.of3("諸佛心陀羅尼經", "唐", "玄奘"), // 唐 玄奘譯
                "T0919", Kind.jin.of3("諸佛心印陀羅尼經", "宋", "法天"), // 宋 法天譯
                "T0920", Kind.jin.of3("佛心經", "唐", "菩提流志"), // 唐 菩提流志譯
                
                "T0921", Kind.yiGui.of3("阿閦如來念誦供養法", "唐", "不空"), // 唐 不空譯
                "T0922", Kind.yiGui.of3("藥師琉璃光如來消災除難念誦儀軌", "唐", "一行"), // 唐 一行撰
                "T0923", Kind.yiGui.of3("藥師如來觀行儀軌法", "唐", "金剛智"), // 唐 金剛智譯
                "T0924A", Kind.yiGui.of3("藥師如來念誦儀軌", "唐", "不空"), // 唐 不空譯
                "T0924B", Kind.yiGui.of3("藥師如來念誦儀軌", "唐", "不空"), // 唐 不空譯
                "T0924C", Kind.yiGui.of2("藥師儀軌一具"), //
                "T0925", Kind.yiGui.of3("藥師琉璃光王七佛本願功德經念誦儀軌", "元", "沙囉巴"), // 元 沙囉巴譯
                "T0926", Kind.yiGui.of3("藥師琉璃光王七佛本願功德經念誦儀軌供養法", "元", "沙囉巴"), // 元 沙囉巴譯
                "T0927", Kind.yiGui.of3("藥師七佛供養儀軌如意王經", "清", "工布查布"), // 清 工布查布譯
                "T0928", Kind.yiGui.of3("修藥師儀軌布壇法", "清", "阿旺扎什"), // 清 阿旺扎什補譯
                "T0929", Kind.yiGui.of2("淨瑠璃淨土摽"), //
                "T0930", Kind.yiGui.of3("無量壽如來觀行供養儀軌", "唐", "不空"), // 唐 不空譯
                "T0931", Kind.yiGui.of3("金剛頂經觀自在王如來修行法", "唐", "不空"), // 唐 不空譯
                "T0932", Kind.yiGui.of3("金剛頂經瑜伽觀自在王如來修行法", "唐", "金剛智"), // 唐 金剛智譯
                
                "T0933", Kind.jin.of3("九品往生阿彌陀三摩地集陀羅尼經", "唐", "不空"), // 唐 不空譯
                "T0934", Kind.jin.of3("佛說無量功德陀羅尼經", "宋", "天息災"), // 宋 法賢譯
                
                "T0935", Kind.yiGui.of3("極樂願文", "清", "薩穆丹達爾吉"), // 清 達喇嘛嘎卜楚薩木丹達爾吉譯
                
                "T0936", Kind.jin.of3("大乘無量壽經", "唐", "法成"), // 唐 法成譯
                "T0937", Kind.jin.of3("佛說大乘聖無量壽決定光明王如來陀羅尼經", "宋", "法天"), // 宋 法天譯
                
                "T0938", Kind.jin.of2("釋迦文尼佛金剛一乘修行儀軌法品"), //
                "T0939", Kind.jin.of3("佛說大乘觀想曼拏羅淨諸惡趣經", "宋", "天息災"), // 宋 法賢譯
                "T0940", Kind.jin.of3("佛說帝釋巖祕密成就儀軌", "宋", "施護"), // 宋 施護譯
                
                "T0941", Kind.lun.of2("釋迦牟尼佛成道在菩提樹降魔讚"), //
                "T0942", Kind.lun.of3("釋迦佛讚", "清", "薩穆丹達爾吉"), // 清 達喇嘛薩穆丹達爾吉譯
                
                "T0943", Kind.jin.of3("佛說無能勝幡王如來莊嚴陀羅尼經", "宋", "施護"), // 宋 施護譯
                "T0944A", Kind.jin.of3("大佛頂如來放光悉怛多鉢怛囉陀羅尼", "唐", "不空"), // 唐 不空譯
                "T0944B", Kind.jin.of2("大佛頂大陀羅尼"), //
                "T0945", Kind.jin.of3("大佛頂如來密因修證了義諸菩薩萬行首楞嚴經", "唐", "般剌蜜帝"), // 唐 般剌蜜帝譯
                "T0946", Kind.jin.of2("大佛頂廣聚陀羅尼經"), //
                "T0947", Kind.jin.of2("大佛頂如來放光悉怛多般怛羅大神力都攝一切呪王陀羅尼經大威德最勝金輪三昧呪品"), //
               
                "T0948", Kind.yiGui.of3("金輪王佛頂要略念誦法", "唐", "不空"), // 唐 不空譯
                "T0949", Kind.yiGui.of2("奇特最勝金輪佛頂念誦儀軌法要"), //
                
                "T0950", Kind.jin.of3("菩提場所說一字頂輪王經", "唐", "不空"), // 唐 不空譯
                "T0951", Kind.jin.of3("一字佛頂輪王經", "唐", "菩提流志"), // 唐 菩提流志譯
                "T0952", Kind.jin.of3("五佛頂三昧陀羅尼經", "唐", "菩提流志"), // 唐 菩提流志譯
                "T0953", Kind.jin.of3("一字奇特佛頂經", "唐", "不空"), // 唐 不空譯
                
                "T0954A", Kind.yiGui.of3("一字頂輪王念誦儀軌", "唐", "不空"), // 唐 不空譯
                "T0954B", Kind.yiGui.of2("一字頂輪王念誦儀軌"), //
                "T0955", Kind.yiGui.of3("一字頂輪王瑜伽觀行儀軌", "唐", "不空"), // 唐 不空譯
                
                "T0956", Kind.jin.of3("大陀羅尼末法中一字心呪經", "唐", "寶思惟"), // 唐 寶思惟譯
                
                "T0957", Kind.yiGui.of3("金剛頂一字頂輪王瑜伽一切時處念誦成佛儀軌", "唐", "不空"), // 唐 不空譯
                
                "T0958", Kind.yinYi.of3("金剛頂經一字頂輪王儀軌音義", "唐", "不空"), // 唐 不空譯
                
                "T0959", Kind.yiGui.of3("頂輪王大曼荼羅灌頂儀軌", "唐", "辯弘"), // 唐 [(工*刀)/言]弘集
                
                "T0960", Kind.jin.of3("一切如來說佛頂輪王一百八名讚", "宋", "施護"), // 宋 施護譯
                "T0961", Kind.jin.of3("如意寶珠轉輪祕密現身成佛金輪呪王經", "唐", "不空"), // 唐 不空譯
                "T0962", Kind.jin.of3("寶悉地成佛陀羅尼經", "唐", "不空"), // 唐 不空譯
                "T0963", Kind.jin.of3("佛說熾盛光大威德消災吉祥陀羅尼經", "唐", "不空"), // 唐 不空譯
                "T0964", Kind.jin.of2("佛說大威德金輪佛頂熾盛光如來消除一切災難陀羅尼經", "失譯"), // 失譯
                "T0965", Kind.jin.of3("大妙金剛大甘露軍拏利焰鬘熾盛佛頂經", "唐", "達摩栖那"), // 唐 達磨栖那譯
                "T0966", Kind.jin.of3("大聖妙吉祥菩薩說除災教令法輪", "唐", "尸羅達摩"), // 唐 尸羅跋陀羅譯
                "T0967", Kind.jin.of3("佛頂尊勝陀羅尼經", "唐", "佛陀波利"), // 唐 佛陀波利譯
                "T0968", Kind.jin.of3("佛頂尊勝陀羅尼經", "唐", "杜行顗"), // 唐 杜行顗譯
                "T0969", Kind.jin.of3("佛頂最勝陀羅尼經", "唐", "地婆訶羅"), // 唐 地婆訶羅譯
                "T0970", Kind.jin.of3("最勝佛頂陀羅尼淨除業障呪經", "唐", "地婆訶羅"), // 唐 地婆訶羅譯
                "T0971", Kind.jin.of3("佛說佛頂尊勝陀羅尼經", "唐", "義淨"), // 唐 義淨譯
                
                "T0972", Kind.yiGui.of3("佛頂尊勝陀羅尼念誦儀軌法", "唐", "不空"), // 唐 不空譯
                "T0973", Kind.yiGui.of3("尊勝佛頂脩瑜伽法軌儀", "唐", "善無畏"), // 唐 善無畏譯
                
                "T0974A", Kind.jin.of3("最勝佛頂陀羅尼經", "宋", "法天"), // 宋 法天譯
                "T0974B", Kind.jin.of2("佛頂尊勝陀羅尼"), //
                
                "T0974C", Kind.lun.of3("加句靈驗佛頂尊勝陀羅尼記", "唐", "武徹"), // 唐 武徹述
                "T0974D", Kind.lun.of3("佛頂尊勝陀羅尼注義", "唐", "不空"), // 唐 不空譯
                
                "T0974E", Kind.jin.of2("佛頂尊勝陀羅尼真言"), //
                "T0974F", Kind.jin.of3("佛頂尊勝陀羅尼別法", "唐", "若那"), // 唐 若那譯
                
                "T0975", Kind.yiGui.of2("白傘蓋大佛頂王最勝無比大威德金剛無礙大道場陀羅尼念誦法要"), //
                
                "T0976", Kind.jin.of3("佛頂大白傘蓋陀羅尼經", "元", "沙囉巴"), // 元 沙囉巴譯
                "T0977", Kind.jin.of3("佛說大白傘蓋總持陀羅尼經", "元", "真智"), // 元 真智等譯
                "T0978", Kind.jin.of3("佛說一切如來烏瑟膩沙最勝總持經", "宋", "法天"), // 宋 法天譯
                "T0979", Kind.jin.of3("于瑟抳沙毘左野陀囉尼", "高麗", "指空"), // 高麗 指空譯
                
                "T0980", Kind.yiGui.of3("大勝金剛佛頂念誦儀軌", "唐", "金剛智"), // 唐 金剛智譯
                "T0981", Kind.yiGui.of3("大毘盧遮那佛眼修行儀軌", "唐", "一行"), // 唐 一行記
                
                "T0982", Kind.jin.of3("佛母大孔雀明王經", "唐", "不空"), // 唐 不空譯
                
                "T0983A", Kind.yiGui.of3("佛說大孔雀明王畫像壇場儀軌", "唐", "不空"), // 唐 不空譯
                
                "T0983B", Kind.jin.of3("孔雀經真言等梵本", "唐", "圓仁"), // 唐 圓仁請來
                "T0984", Kind.jin.of3("孔雀王呪經", "梁", "僧伽婆羅"), // 梁 僧伽婆羅譯
                "T0985", Kind.jin.of3("佛說大孔雀呪王經", "唐", "義淨"), // 唐 義淨譯
                "T0986", Kind.jin.of2("大金色孔雀王呪經", "失譯"), // 失譯
                "T0987", Kind.jin.of2("佛說大金色孔雀王呪經", "失譯"), // 失譯
                "T0988", Kind.jin.of3("孔雀王呪經", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯
                "T0989", Kind.jin.of3("大雲輪請雨經", "唐", "不空"), // 唐 不空譯
                "T0990", Kind.jin.of3("大雲經祈雨壇法", "唐", "不空"), // 唐 不空譯
                "T0991", Kind.jin.of3("大雲輪請雨經", "隋", "那連提黎耶舍"), // 隋 那連提耶舍譯
                "T0992", Kind.jin.of3("大方等大雲經請雨品第六十四", "北周", "闍那耶舍"), // 北周 闍那耶舍譯
                "T0993", Kind.jin.of3("大雲經請雨品第六十四", "北周", "闍那耶舍"), // 北周 闍那耶舍譯
                
                "T0994", Kind.yiGui.of3("仁王護國般若波羅蜜多經陀羅尼念誦儀軌", "唐", "不空"), // 唐 不空譯
                "T0995", Kind.yiGui.of3("仁王般若念誦法", "唐", "不空"), // 唐 不空譯
                
                "T0996", Kind.lun.of3("仁王般若陀羅尼釋", "唐", "不空"), // 唐 不空譯
                
                "T0997", Kind.jin.of3("守護國界主陀羅尼經", "唐", "般若", "牟尼室利"), // 唐 般若共牟尼室利譯
                "T0998", Kind.jin.of3("佛說迴向輪經", "唐", "尸羅達摩"), // 唐 尸羅達摩譯
                "T0999", Kind.jin.of3("佛說守護大千國土經", "宋", "施護"), // 宋 施護譯
                
                "T1000", Kind.yiGui.of3("成就妙法蓮華經王瑜伽觀智儀軌", "唐", "不空") // 唐 不空譯
        );
    }

    private static void addT1000() {
        add(
                "T1001", Kind.jin.of3("法華曼荼羅威儀形色法經", "唐", "不空"), // 唐 不空譯
                "T1002", Kind.jin.of3("不空羂索毘盧遮那佛大灌頂光真言", "唐", "不空"), // 唐 不空譯

                "T1003", Kind.lun.of3("大樂金剛不空真實三昧耶經般若波羅蜜多理趣釋", "唐", "不空"), // 唐 不空譯
                "T1004", Kind.lun.of3("般若波羅蜜多理趣經大樂不空三昧真實金剛薩埵菩薩等一十七聖大曼荼羅義述", "唐", "不空"), // 唐 不空譯

                "T1005A", Kind.jin.of3("大寶廣博樓閣善住祕密陀羅尼經", "唐", "不空"), // 唐 不空譯
                "T1005B", Kind.jin.of2("寶樓閣經梵字真言"), //
                "T1006", Kind.jin.of3("廣大寶樓閣善住祕密陀羅尼經", "唐", "菩提流志"), // 唐 菩提流志譯
                "T1007", Kind.jin.of2("牟梨曼陀羅呪經", "失譯"), // 失譯
                "T1008", Kind.jin.of3("菩提場莊嚴陀羅尼經", "唐", "不空"), // 唐 不空譯
                "T1009", Kind.jin.of3("出生無邊門陀羅尼經", "唐", "不空"), // 唐 不空譯

                "T1010", Kind.yiGui.of3("佛說出生無邊門陀羅尼儀軌", "唐", "不空"), // 唐 不空譯

                "T1011", Kind.jin.of3("佛說無量門微密持經", "吳", "支謙"), // 吳 支謙譯
                "T1012", Kind.jin.of3("佛說出生無量門持經", "東晉", "佛馱跋陀羅"), // 東晉 佛陀跋陀羅譯
                "T1013", Kind.jin.of3("阿難陀目佉尼呵離陀經", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅譯
                "T1014", Kind.jin.of3("無量門破魔陀羅尼經", "劉宋", "功德直", "玄暢"), // 劉宋 功德直．玄暢譯
                "T1015", Kind.jin.of3("佛說阿難陀目佉尼呵離陀隣尼經", "元魏", "佛陀扇多"), // 元魏 佛馱扇多譯
                "T1016", Kind.jin.of3("舍利弗陀羅尼經", "梁", "僧伽婆羅"), // 梁 僧伽婆羅譯
                "T1017", Kind.jin.of3("佛說一向出生菩薩經", "隋", "闍那崛多"), // 隋 闍那崛多譯
                "T1018", Kind.jin.of3("出生無邊門陀羅尼經", "唐", "智嚴"), // 唐 智嚴譯
                "T1019", Kind.jin.of3("大方廣佛華嚴經入法界品四十二字觀門", "唐", "不空"), // 唐 不空譯

                "T1020",Kind.yiGui.of3("大方廣佛花嚴經入法界品頓證毘盧遮那法身字輪瑜伽儀軌", "唐", "不空"), // 唐 不空譯

                "T1021", Kind.jin.of2("華嚴經心陀羅尼"), //
                "T1022A", Kind.jin.of3("一切如來心祕密全身舍利寶篋印陀羅尼經", "唐", "不空"), // 唐 不空譯
                "T1022B", Kind.jin.of3("一切如來心祕密全身舍利寶篋印陀羅尼經", "唐", "不空"), // 唐 不空譯
                "T1023", Kind.jin.of3("一切如來正法祕密篋印心陀羅尼經", "宋", "施護"), // 宋 施護譯
                "T1024", Kind.jin.of3("無垢淨光大陀羅尼經", "唐", "寂友"), // 唐 彌陀山譯
                "T1025", Kind.jin.of3("佛頂放無垢光明入普門觀察一切如來心陀羅尼經", "宋", "施護"), // 宋 施護譯
                "T1026", Kind.jin.of3("佛說造塔延命功德經", "唐", "般若"), // 唐 般若譯
                "T1027a", Kind.jin.of3("金剛光焰止風雨陀羅尼經", "唐", "菩提流志"), // 唐 菩提流志譯
                "T1027b", Kind.jin.of3("金剛光焰止風雨陀羅尼經", "唐", "菩提流志"), // 唐 菩提流志譯
                "T1028A", Kind.jin.of3("佛說護諸童子陀羅尼經", "元魏", "菩提流支"), // 元魏 菩提流支譯
                "T1028B", Kind.jin.of3("童子經念誦法", "唐", "善無畏"), // 唐 善無畏譯
                "T1029", Kind.jin.of2("佛說安宅陀羅尼呪經"), //

                "T1030", Kind.yiGui.of3("觀自在大悲成就瑜伽蓮華部念誦法門", "唐", "不空"), // 唐 不空譯
                "T1031", Kind.yiGui.of3("聖觀自在菩薩心真言瑜伽觀行儀軌", "唐", "不空"), // 唐 不空譯
                "T1032", Kind.yiGui.of3("瑜伽蓮華部念誦法", "唐", "不空"), // 唐 不空譯

                "T1033", Kind.jin.of3("金剛恐怖集會方廣軌儀觀自在菩薩三世最勝心明王經", "唐", "不空"), // 唐 不空譯
                "T1034", Kind.jin.of3("呪五首", "唐", "玄奘"), // 唐 玄奘譯
                "T1035", Kind.jin.of3("千轉陀羅尼觀世音菩薩呪", "唐", "智通"), // 唐 智通譯
                "T1036", Kind.jin.of3("千轉大明陀羅尼經", "宋", "施護"), // 宋 施護譯
                "T1037", Kind.jin.of3("觀自在菩薩說普賢陀羅尼經", "唐", "不空"), // 唐 不空譯
                "T1038", Kind.jin.of3("清淨觀世音普賢陀羅尼經", "唐", "智通"), // 唐 智通譯
                "T1039", Kind.jin.of3("阿唎多羅陀羅尼阿嚕力經", "唐", "不空"), // 唐 不空譯
                "T1040", Kind.jin.of3("金剛頂降三世大儀軌法王教中觀自在菩薩心真言一切如來蓮華大曼荼羅品", "唐", "不空"), // 唐 不空譯
                "T1041", Kind.jin.of3("觀自在菩薩心真言一印念誦法", "唐", "不空"), // 唐 不空譯
                "T1042", Kind.jin.of3("觀自在菩薩大悲智印周遍法界利益眾生薰真如法", "唐", "不空"), // 唐 不空譯
                "T1043", Kind.jin.of3("請觀世音菩薩消伏毒害陀羅尼呪經", "東晉", "難提"), // 東晉 難提譯
                "T1044", Kind.jin.of2("佛說六字呪王經", "失譯"), // 失譯
                "T1045a", Kind.jin.of2("佛說六字神呪王經", "失譯"), // 失譯
                "T1045b", Kind.jin.of2("六字神呪王經", "失譯"), // 失譯
                "T1046", Kind.jin.of2("六字大陀羅尼呪經", "失譯"), // 失譯
                "T1047", Kind.jin.of3("佛說聖六字大明王陀羅尼經", "宋", "施護"), // 宋 施護譯
                "T1048", Kind.jin.of3("佛說大護明大陀羅尼經", "宋", "法天"), // 宋 法天譯
                "T1049", Kind.jin.of3("聖六字增壽大明陀羅尼經", "宋", "施護"), // 宋 施護譯
                "T1050", Kind.jin.of3("佛說大乘莊嚴寶王經", "宋", "天息災"), // 宋 天息災譯

                "T1051", Kind.yiGui.of3("佛說一切佛攝相應大教王經聖觀自在菩薩念誦儀軌", "宋", "天息災"), // 宋 法賢譯

                "T1052", Kind.jin.of3("讚觀世音菩薩頌", "唐", "慧智"), // 唐 慧智譯
                "T1053", Kind.jin.of3("聖觀自在菩薩功德讚", "宋", "施護"), // 宋 施護譯
                "T1054", Kind.jin.of3("聖觀自在菩薩一百八名經", "宋", "天息災"), // 宋 天息災譯
                "T1055", Kind.jin.of3("佛說聖觀自在菩薩梵讚", "宋", "天息災"), // 宋 法賢譯
                "T1056", Kind.jin.of3("金剛頂瑜伽千手千眼觀自在菩薩修行儀軌經", "唐", "不空"), // 唐 不空譯
                "T1057a", Kind.jin.of3("千眼千臂觀世音菩薩陀羅尼神呪經", "唐", "智通"), // 唐 智通譯
                "T1057b", Kind.jin.of3("千眼千臂觀世音菩薩陀羅尼神呪經", "唐", "智通"), // 唐 智通譯
                "T1058", Kind.jin.of3("千手千眼觀世音菩薩姥陀羅尼身經", "唐", "菩提流志"), // 唐 菩提流志譯
                "T1059", Kind.jin.of3("千手千眼觀世音菩薩治病合藥經", "唐", "伽梵達摩"), // 唐 伽梵達摩譯
                "T1060", Kind.jin.of3("千手千眼觀世音菩薩廣大圓滿無礙大悲心陀羅尼經", "唐", "伽梵達摩"), // 唐 伽梵達摩譯
                "T1061", Kind.jin.of3("千手千眼觀自在菩薩廣大圓滿無礙大悲心陀羅尼呪本", "唐", "金剛智"), // 唐 金剛智譯
                "T1062A", Kind.jin.of3("千手千眼觀世音菩薩大身呪本", "唐", "金剛智"), // 唐 金剛智譯
                "T1062B", Kind.jin.of2("世尊聖者千眼千首千足千舌千臂觀自在菩提薩埵怛嚩廣大圓滿無礙大悲心陀羅尼", "空海"), //
                "T1063", Kind.jin.of2("番大悲神呪"), //
                "T1064", Kind.jin.of3("千手千眼觀世音菩薩大悲心陀羅尼", "唐", "不空"), // 唐 不空譯
                "T1065", Kind.jin.of3("千光眼觀自在菩薩祕密法經", "唐", "三昧蘇嚩羅"), // 唐 三昧蘇嚩羅譯

                "T1066", Kind.yiGui.of3("大悲心陀羅尼修行念誦略儀", "唐", "不空"), // 唐 不空譯
                "T1067", Kind.yiGui.of3("攝無礙大悲心大陀羅尼經計一法中出無量義南方滿願補陀落海會五部諸尊等弘誓力方位及威儀形色執持三摩耶幖幟曼荼羅儀軌", "唐", "不空"), // 唐 不空譯
                "T1068", Kind.yiGui.of3("千手觀音造次第法儀軌", "唐", "善無畏"), // 唐 善無畏譯

                "T1069", Kind.jin.of3("十一面觀自在菩薩心密言念誦儀軌經", "唐", "不空"), // 唐 不空譯
                "T1070", Kind.jin.of3("佛說十一面觀世音神呪經", "北周", "耶舍崛多"), // 北周 耶舍崛多譯
                "T1071", Kind.jin.of3("十一面神呪心經", "唐", "玄奘"), // 唐 玄奘譯
               
                "T1072A", Kind.yiGui.of3("聖賀野紇哩縛大威怒王立成大神驗供養念誦儀軌法品", "唐", "不空"), // 唐 不空譯
                "T1072B", Kind.yiGui.of2("馬頭觀音心陀羅尼", "空海"), //
                "T1073", Kind.yiGui.of2("何耶揭唎婆像法"), //
                "T1074", Kind.yiGui.of2("何耶揭唎婆觀世音菩薩受法壇"), //
               
                "T1075", Kind.jin.of3("佛說七俱胝佛母准提大明陀羅尼經", "唐", "金剛智"), // 唐 金剛智譯
                "T1076", Kind.jin.of3("七俱胝佛母所說准提陀羅尼經", "唐", "不空"), // 唐 不空譯
                "T1077", Kind.jin.of3("佛說七俱胝佛母心大准提陀羅尼經", "唐", "地婆訶羅"), // 唐 地婆訶羅譯
                
                "T1078", Kind.yiGui.of3("七佛俱胝佛母心大准提陀羅尼法", "唐", "善無畏"), // 唐 善無畏譯
                "T1079", Kind.yiGui.of3("七俱胝獨部法", "唐", "善無畏"), // 唐 善無畏譯
                
                "T1080", Kind.jin.of3("如意輪陀羅尼經", "唐", "菩提流志"), // 唐 菩提流志譯
                "T1081", Kind.jin.of3("佛說觀自在菩薩如意心陀羅尼呪經", "唐", "義淨"), // 唐 義淨譯
                "T1082", Kind.jin.of3("觀世音菩薩祕密藏如意輪陀羅尼神呪經", "唐", "實叉難陀"), // 唐 實叉難陀譯
                "T1083", Kind.jin.of3("觀世音菩薩如意摩尼陀羅尼經", "唐", "寶思惟"), // 唐 寶思惟譯

                "T1084", Kind.yiGui.of3("觀世音菩薩如意摩尼輪陀羅尼念誦法", "唐", "寶思惟"), // 唐 寶思惟譯
                "T1085", Kind.yiGui.of3("觀自在菩薩如意輪念誦儀軌", "唐", "不空"), // 唐 不空譯

                "T1086", Kind.lun.of3("觀自在菩薩如意輪瑜伽", "唐", "不空"), // 唐 不空譯
                "T1087", Kind.lun.of3("觀自在如意輪菩薩瑜伽法要", "唐", "金剛智"), // 唐 金剛智譯
                "T1088", Kind.lun.of2("如意輪菩薩觀門義注祕訣"), //
                "T1089", Kind.lun.of3("都表如意摩尼轉輪聖王次第念誦祕密最要略法", "唐", "解脫師子"), // 唐 解脫師子譯
                
                "T1090", Kind.jin.of3("佛說如意輪蓮華心如來修行觀門儀", "宋", "慈賢"), // 宋 慈賢譯
                "T1091", Kind.jin.of3("七星如意輪祕密要經", "唐", "不空"), // 唐 不空譯
                "T1092", Kind.jin.of3("不空羂索神變真言經", "唐", "菩提流志"), // 唐 菩提流志譯
                "T1093", Kind.jin.of3("不空羂索呪經", "隋", "闍那崛多"), // 隋 闍那崛多譯
                "T1094", Kind.jin.of3("不空羂索神呪心經", "唐", "玄奘"), // 唐 玄奘譯
                "T1095", Kind.jin.of3("不空羂索呪心經", "唐", "菩提流志"), // 唐 菩提流志譯
                "T1096", Kind.jin.of3("不空羂索陀羅尼經", "唐", "李無諂"), // 唐 李無諂譯
                "T1097", Kind.jin.of3("不空羂索陀羅尼自在王呪經", "唐", "寶思惟"), // 唐 寶思惟譯
                "T1098", Kind.jin.of3("佛說不空羂索陀羅尼儀軌經", "唐", "不空"), // 唐 阿目佉譯
                "T1099", Kind.jin.of3("佛說聖觀自在菩薩不空王祕密心陀羅尼經", "宋", "施護"), // 宋 施護等譯
                "T1100", Kind.jin.of3("葉衣觀自在菩薩經", "唐", "不空"), // 唐 不空譯
                "T1101", Kind.jin.of3("佛說大方廣曼殊室利經", "唐", "不空"), // 唐 不空譯
                "T1102", Kind.jin.of3("金剛頂經多羅菩薩念誦法", "唐", "不空"), // 唐 不空譯
                "T1103a", Kind.jin.of3("觀自在菩薩隨心呪經", "唐", "智通"), // 唐 智通譯
                "T1103b", Kind.jin.of3("觀自在菩薩怛嚩多唎隨心陀羅尼經", "唐", "智通"), // 唐 智通譯
                "T1104", Kind.jin.of3("佛說聖多羅菩薩經", "宋", "天息災"), // 宋 法賢譯
                "T1105", Kind.jin.of3("聖多羅菩薩一百八名陀羅尼經", "宋", "法天"), // 宋 法天譯
                "T1106", Kind.jin.of3("讚揚聖德多羅菩薩一百八名經", "宋", "天息災"), // 宋 天息災譯
                "T1107", Kind.jin.of3("聖多羅菩薩梵讚", "宋", "施護"), // 宋 施護譯
                "T1108A", Kind.jin.of3("聖救度佛母二十一種禮讚經", "元", "安藏"), // 元 安藏譯
                "T1108B", Kind.jin.of2("救度佛母二十一種禮讚經", "安藏"), //
                
                "T1109", Kind.lun.of3("白救度佛母讚", "清", "阿旺扎什"), // 清 阿旺扎什譯
                
                "T1110", Kind.jin.of3("佛說一髻尊陀羅尼經", "唐", "不空"), // 唐 不空譯
                "T1111", Kind.jin.of3("青頸觀自在菩薩心陀羅尼經", "唐", "不空"), // 唐 不空注

                "T1112", Kind.yiGui.of3("金剛頂瑜伽青頸大悲王觀自在念誦儀軌", "唐", "金剛智"), // 唐 金剛智譯

                "T1113A", Kind.jin.of3("觀自在菩薩廣大圓滿無礙大悲心陀羅尼", "高麗", "指空"), // 高麗 指空校
                "T1113B", Kind.jin.of3("大慈大悲救苦觀世音自在王菩薩廣大圓滿無礙自在青頸大悲心陀羅尼", "唐", "不空"), // 唐 不空譯
                "T1114", Kind.jin.of3("毘俱胝菩薩一百八名經", "宋", "法天"), // 宋 法天譯
                
                "T1115", Kind.yiGui.of2("觀自在菩薩阿麼𪘨法"), //
                
                "T1116", Kind.jin.of3("廣大蓮華莊嚴曼拏羅滅一切罪陀羅尼經", "宋", "施護"), // 宋 施護譯
                "T1117", Kind.jin.of3("佛說觀自在菩薩母陀羅尼經", "宋", "天息災"), // 宋 法賢譯
                "T1118", Kind.jin.of3("佛說十八臂陀羅尼經", "宋", "天息災"), // 宋 法賢譯

                "T1119", Kind.yiGui.of3("大樂金剛薩埵修行成就儀軌", "唐", "不空"), // 唐 不空譯
                "T1120A", Kind.yiGui.of3("金剛頂勝初瑜伽經中略出大樂金剛薩埵念誦儀", "唐", "不空"), // 唐 不空譯
                "T1120B", Kind.yiGui.of3("勝初瑜伽儀軌真言", "唐", "空海"), // 唐 空海請來
                "T1121", Kind.yiGui.of2("金剛頂普賢瑜伽大教王經大樂不空金剛薩埵一切時方成就儀"), //
                "T1122", Kind.yiGui.of3("金剛頂瑜伽他化自在天理趣會普賢修行念誦儀軌", "唐", "不空"), // 唐 不空譯
                "T1123", Kind.yiGui.of3("金剛頂勝初瑜伽普賢菩薩念誦法", "唐", "不空"), // 唐 不空譯
                "T1124", Kind.yiGui.of3("普賢金剛薩埵略瑜伽念誦儀軌", "唐", "不空"), // 唐 不空譯
                "T1125", Kind.yiGui.of3("金剛頂瑜伽金剛薩埵五祕密修行念誦儀軌", "唐", "不空"), // 唐 不空譯

                "T1126", Kind.jin.of3("佛說普賢曼拏羅經", "宋", "施護"), // 宋 施護譯
                "T1127", Kind.jin.of3("佛說普賢菩薩陀羅尼經", "宋", "法天"), // 宋 法天譯
                "T1128", Kind.jin.of3("最上大乘金剛大教寶王經", "宋", "法天"), // 宋 法天譯
                "T1129", Kind.jin.of3("佛說金剛手菩薩降伏一切部多大教王經", "宋", "法天"), // 宋 法天譯
                
                "T1130", Kind.lun.of3("大乘金剛髻珠菩薩修行分", "唐", "菩提流志"), // 唐 菩提流志譯
                "T1131", Kind.lun.of3("聖金剛手菩薩一百八名梵讚", "宋", "天息災"), // 宋 法賢譯

                "T1132", Kind.yiGui.of3("金剛王菩薩祕密念誦儀軌", "唐", "不空"), // 唐 不空譯
                "T1133", Kind.yiGui.of3("金剛壽命陀羅尼念誦法", "唐", "不空"), // 唐 不空譯

                "T1134A", Kind.jin.of3("金剛壽命陀羅尼經法", "唐", "不空"), // 唐 不空譯
                "T1134B", Kind.jin.of3("金剛壽命陀羅尼經", "唐", "不空"), // 唐 不空譯
                "T1135", Kind.jin.of3("佛說一切如來金剛壽命陀羅尼經", "唐", "不空"), // 唐 不空譯
                "T1136", Kind.jin.of3("佛說一切諸如來心光明加持普賢菩薩延命金剛最勝陀羅尼經", "唐", "不空"), // 唐 不空譯
                "T1137", Kind.jin.of2("佛說善法方便陀羅尼經", "失譯"), // 失譯
                "T1138a", Kind.jin.of2("金剛祕密善門陀羅尼呪經", "失譯"), // 失譯
                "T1138b", Kind.jin.of2("金剛祕密善門陀羅尼經", "失譯"), // 失譯
                "T1139", Kind.jin.of3("護命法門神呪經", "唐", "菩提流志"), // 唐 菩提流志譯
                "T1140", Kind.jin.of3("佛說延壽妙門陀羅尼經", "宋", "天息災"), // 宋 法賢譯

                "T1141", Kind.yiGui.of3("慈氏菩薩略修瑜伽念誦法", "唐", "善無畏"), // 唐 善無畏譯

                "T1142", Kind.jin.of3("佛說慈氏菩薩陀羅尼", "宋", "天息災"), // 宋 法賢譯
                "T1143", Kind.jin.of3("佛說慈氏菩薩誓願陀羅尼經", "宋", "天息災"), // 宋 法賢譯
                "T1144", Kind.jin.of3("佛說彌勒菩薩發願王偈", "清", "工布查布"), // 清 工布查布譯

                "T1145", Kind.yiGui.of3("虛空藏菩薩能滿諸願最勝心陀羅尼求聞持法", "唐", "善無畏"), // 唐 善無畏譯
                "T1146", Kind.yiGui.of3("大虛空藏菩薩念誦法", "唐", "不空"), // 唐 不空譯

                "T1147", Kind.jin.of3("聖虛空藏菩薩陀羅尼經", "宋", "法天"), // 宋 法天譯
                "T1148", Kind.jin.of3("佛說虛空藏菩薩陀羅尼", "宋", "天息災"), // 宋 法賢譯
                "T1149", Kind.jin.of3("五大虛空藏菩薩速疾大神驗祕密式經", "唐", "金剛智"), // 唐 金剛智譯

                "T1150", Kind.yiGui.of3("轉法輪菩薩摧魔怨敵法", "唐", "不空"), // 唐 不空譯
                "T1151", Kind.yiGui.of3("修習般若波羅蜜菩薩觀行念誦儀軌", "唐", "不空"), // 唐 不空譯
                "T1152", Kind.yiGui.of3("佛說佛母般若波羅蜜多大明觀想儀軌", "宋", "施護"), // 宋 施護譯

                "T1153", Kind.jin.of3("普遍光明清淨熾盛如意寶印心無能勝大明王大隨求陀羅尼經", "唐", "不空"), // 唐 不空譯
                "T1154", Kind.jin.of3("佛說隨求即得大自在陀羅尼神呪經", "唐", "寶思惟"), // 唐 寶思惟譯

                "T1155", Kind.yiGui.of3("金剛頂瑜伽最勝祕密成佛隨求即得神變加持成就陀羅尼儀軌", "唐", "不空"), // 唐 不空譯
                "T1156A", Kind.yiGui.of3("大隨求即得大陀羅尼明王懺悔法", "唐", "惟謹"), // 唐 惟謹述

                "T1156B", Kind.lun.of2("宗叡僧正於唐國師所口受"), //

                "T1157", Kind.jin.of3("香王菩薩陀羅尼呪經", "唐", "義淨"), // 唐 義淨譯

                "T1158", Kind.yiGui.of3("地藏菩薩儀軌", "唐", "善無畏"), // 唐 輸婆迦羅譯
                "T1159A", Kind.yiGui.of2("[峚-大+(企-止)]𡇪大道心驅策法"), //

                "T1159B", Kind.jin.of2("佛說地藏菩薩陀羅尼經"), //
                "T1160", Kind.jin.of2("日光菩薩月光菩薩陀羅尼"), //
                "T1161", Kind.jin.of3("佛說觀藥王藥上二菩薩經", "劉宋", "畺良耶舍"), // 劉宋 畺良耶舍譯
                "T1162", Kind.jin.of3("持世陀羅尼經", "唐", "玄奘"), // 唐 玄奘譯
                "T1163", Kind.jin.of3("佛說雨寶陀羅尼經", "唐", "不空"), // 唐 不空譯
                "T1164", Kind.jin.of3("佛說大乘聖吉祥持世陀羅尼經", "宋", "法天"), // 宋 法天譯
                "T1165", Kind.jin.of3("聖持世陀羅尼經", "宋", "施護"), // 宋 施護譯

                "T1166", Kind.yiGui.of3("馬鳴菩薩大神力無比驗法念誦軌儀", "唐", "金剛智"), // 唐 金剛智譯

                "T1167", Kind.jin.of3("八大菩薩曼荼羅經", "唐", "不空"), // 唐 不空譯
                "T1168A", Kind.jin.of3("佛說大乘八大曼拏羅經", "宋", "天息災"), // 宋 法賢譯
                "T1168B", Kind.jin.of2("八曼荼羅經"), //
                "T1169", Kind.jin.of3("佛說持明藏瑜伽大教尊那菩薩大明成就儀軌經", "宋", "天息災"), // 宋 法賢譯
                "T1170", Kind.jin.of3("佛說金剛香菩薩大明成就儀軌經", "宋", "施護"), // 宋 施護譯
                "T1171", Kind.jin.of3("金剛頂經瑜伽文殊師利菩薩法", "唐", "不空"), // 唐 不空譯
                "T1172", Kind.jin.of3("金剛頂超勝三界經說文殊五字真言勝相", "唐", "不空"), // 唐 不空譯
                "T1173", Kind.jin.of3("金剛頂經曼殊室利菩薩五字心陀羅尼品", "唐", "金剛智"), // 唐 金剛智譯
                "T1174", Kind.jin.of3("五字陀羅尼頌", "唐", "不空"), // 唐 不空譯

                "T1175", Kind.yiGui.of3("金剛頂經瑜伽文殊師利菩薩供養儀軌", "唐", "不空"), // 唐 不空譯
                "T1176", Kind.yiGui.of3("曼殊室利童子菩薩五字瑜伽法", "唐", "不空"), // 唐 不空譯

                "T1177A", Kind.jin.of3("大乘瑜伽金剛性海曼殊室利千臂千鉢大教王經", "唐", "不空"), // 唐 不空譯
                
                "T1177B", Kind.lun.of3("千鉢文殊一百八名讚", "唐", "空海"), // 唐 空海請來
                
                "T1178", Kind.jin.of2("文殊菩薩獻佛陀羅尼名烏蘇吒"), //
                "T1179", Kind.jin.of2("文殊師利菩薩六字呪功能法經"), //
                "T1180", Kind.jin.of3("六字神呪經", "唐", "菩提流志"), // 唐 菩提流志譯
                "T1181", Kind.jin.of3("大方廣菩薩藏經中文殊師利根本一字陀羅尼經", "唐", "寶思惟"), // 唐 寶思惟譯
                "T1182", Kind.jin.of3("曼殊室利菩薩呪藏中一字呪王經", "唐", "義淨"), // 唐 義淨譯

                "T1183", Kind.yiGui.of3("一髻文殊師利童子陀羅尼念誦儀軌", "唐", "金剛福壽"), // 唐 金剛福壽譯
                "T1184", Kind.yiGui.of3("大聖妙吉祥菩薩祕密八字陀羅尼修行曼荼羅次第儀軌法", "唐", "菩提㗚使"), // 唐 菩提仙譯

                "T1185A", Kind.jin.of3("佛說文殊師利法寶藏陀羅尼經", "唐", "菩提流志"), // 唐 菩提流志譯
                "T1185B", Kind.jin.of3("文殊師利寶藏陀羅尼經", "唐", "菩提流志"), // 唐 菩提流志譯
                "T1186", Kind.jin.of3("佛說妙吉祥菩薩陀羅尼", "宋", "天息災"), // 宋 法賢譯
                "T1187", Kind.jin.of3("佛說最勝妙吉祥根本智最上祕密一切名義三摩地分", "宋", "施護"), // 宋 施護譯
                "T1188", Kind.jin.of3("文殊所說最勝名義經", "宋", "金總持"), // 宋 金總持等譯
                "T1189", Kind.jin.of3("佛說文殊菩薩最勝真實名義經", "元", "沙囉巴"), // 元 沙囉巴譯
                "T1190", Kind.jin.of3("聖妙吉祥真實名經", "元", "釋智"), // 元 釋智譯
                "T1191", Kind.jin.of3("大方廣菩薩藏文殊師利根本儀軌經", "宋", "天息災"), // 宋 天息災譯
                "T1192", Kind.jin.of3("妙吉祥平等祕密最上觀門大教王經", "宋", "慈賢"), // 宋 慈賢譯

                "T1193", Kind.yiGui.of3("妙吉祥平等瑜伽祕密觀身成佛儀軌", "宋", "慈賢"), // 宋 慈賢譯
                "T1194", Kind.yiGui.of3("妙吉祥平等觀門大教王經略出護摩儀", "宋", "慈賢"), // 宋 慈賢譯

                "T1195", Kind.jin.of3("大聖文殊師利菩薩讚佛法身禮", "唐", "不空"), // 唐 不空譯
                "T1196", Kind.jin.of3("曼殊室利菩薩吉祥伽陀", "宋", "天息災"), // 宋 法賢譯
                "T1197", Kind.jin.of3("佛說文殊師利一百八名梵讚", "宋", "法天"), // 宋 法天譯
                
                "T1198", Kind.yiGui.of3("聖者文殊師利發菩提心願文", "元", "智慧"), // 元 智慧譯
                "T1199", Kind.yiGui.of3("金剛手光明灌頂經最勝立印聖無動尊大威怒王念誦儀軌法品", "唐", "不空"), // 唐 不空譯
                "T1200", Kind.yiGui.of3("底哩三昧耶不動尊威怒王使者念誦法", "唐", "不空"), // 唐 不空譯
                "T1201", Kind.yiGui.of3("底哩三昧耶不動尊聖者念誦祕密法", "唐", "不空"), // 唐 不空譯
                "T1202", Kind.yiGui.of3("不動使者陀羅尼祕密法", "唐", "金剛智"), // 唐 金剛智譯
                
                "T1203", Kind.yiGui.of2("聖無動尊安鎮家國等法"), //
                "T1204", Kind.yiGui.of2("聖無動尊一字出生八大童子祕要法品"), //
                "T1205", Kind.yiGui.of3("勝軍不動明王四十八使者祕密成就儀軌", "唐", "遍智"), // 唐 遍智集

                "T1206", Kind.jin.of2("佛說俱利伽羅大龍勝外道伏陀羅尼經"), //

                "T1207", Kind.yiGui.of2("說矩里迦龍王像法"), //
                "T1208", Kind.yiGui.of3("俱力迦羅龍王儀軌", "唐", "金剛智"), // 唐 金剛智譯
                "T1209", Kind.yiGui.of3("金剛頂瑜伽降三世成就極深密門", "唐", "不空"), // 唐 不空譯
                "T1210", Kind.yiGui.of3("降三世忿怒明王念誦儀軌", "唐", "不空"), // 唐 不空譯
                "T1211", Kind.yiGui.of3("甘露軍荼利菩薩供養念誦成就儀軌", "唐", "不空"), // 唐 不空譯
                "T1212", Kind.yiGui.of3("西方陀羅尼藏中金剛族阿蜜哩多軍吒利法", "唐", "海雲"), // 唐 海雲記
                "T1213", Kind.yiGui.of3("千臂軍荼利梵字真言", "唐", "義操"), // 唐 義操記
                "T1214", Kind.yiGui.of3("聖閻曼德迦威怒王立成大神驗念誦法", "唐", "不空"), // 唐 不空譯
                "T1215", Kind.yiGui.of2("大乘方廣曼殊室利菩薩華嚴本教閻曼德迦忿怒王真言大威德儀軌品"), //
                "T1216", Kind.yiGui.of2("大方廣曼殊室利童真菩薩華嚴本教讚閻曼德迦忿怒王真言阿毘遮嚕迦儀軌品"), //
                
                "T1217", Kind.jin.of3("佛說妙吉祥最勝根本大教經", "宋", "天息災"), // 宋 法賢譯
                
                "T1218", Kind.yiGui.of3("文殊師利耶曼德迦呪法", "唐", "宗叡"), // 唐 宗叡將來
                "T1219", Kind.yiGui.of3("曼殊室利焰曼德迦萬愛祕術如意法", "唐", "一行"), // 唐 一行撰
                "T1220", Kind.yiGui.of3("金剛藥叉瞋怒王息災大威神驗念誦儀軌", "唐", "金剛智"), // 唐 金剛智譯
                "T1221", Kind.yiGui.of3("青色大金剛藥叉辟鬼魔法", "唐", "空蜞"), // 唐 空蜝述

                "T1222a", Kind.jin.of3("聖迦抳忿怒金剛童子菩薩成就儀軌經", "唐", "不空"), // 唐 不空譯
                "T1222b", Kind.jin.of3("聖迦柅忿怒金剛童子菩薩成就儀軌經", "唐", "不空"), // 唐 不空譯
                "T1223", Kind.jin.of3("佛說無量壽佛化身大忿迅俱摩羅金剛念誦瑜伽儀軌法", "唐", "金剛智"), // 唐 金剛智譯
                "T1224", Kind.jin.of2("金剛童子持念經"), //
                "T1225", Kind.jin.of3("大威怒烏芻澁麼儀軌經", "唐", "不空"), // 唐 不空譯
                "T1226", Kind.jin.of3("烏芻澁明王儀軌梵字", "唐", "空海"), // 唐 空海請來
                "T1227", Kind.jin.of3("大威力烏樞瑟摩明王經", "唐", "阿質達霰"), // 唐 阿質達霰譯
                "T1228", Kind.jin.of3("穢跡金剛說神通大滿陀羅尼法術靈要門", "唐", "阿質達霰"), // 唐 阿質達霰譯
                "T1229", Kind.jin.of3("穢跡金剛禁百變法經", "唐", "阿質達霰"), // 唐 阿質達霰譯
                "T1230", Kind.jin.of2("佛說大輪金剛總持陀羅尼經"), //
                
                "T1231", Kind.yiGui.of2("大輪金剛修行悉地成就及供養法"), //
                "T1232", Kind.yiGui.of2("播般曩結使波金剛念誦儀"), //
                
                "T1233", Kind.jin.of3("佛說無能勝大明王陀羅尼經", "宋", "法天"), // 宋 法天譯
                "T1234", Kind.jin.of3("無能勝大明陀羅尼經", "宋", "法天"), // 宋 法天譯
                "T1235", Kind.jin.of3("無能勝大明心陀羅尼經", "宋", "法天"), // 宋 法天譯
                "T1236", Kind.jin.of3("聖無能勝金剛火陀羅尼經", "宋", "法天"), // 宋 法天譯
                "T1237", Kind.jin.of2("阿吒婆拘鬼神大將上佛陀羅尼神呪經", "失譯"), // 失譯
                "T1238", Kind.jin.of2("阿吒婆𤘽鬼神大將上佛陀羅尼經", "失譯"), // 失譯

                "T1239", Kind.yiGui.of3("阿吒薄俱元帥大將上佛陀羅尼經修行儀軌", "唐", "善無畏"), // 唐 善無畏譯

                "T1240", Kind.jin.of2("阿吒薄𤘽付囑呪"), //
                "T1241", Kind.jin.of2("伽馱金剛真言"), //
                "T1242", Kind.jin.of3("佛說妙吉祥瑜伽大教金剛陪囉嚩輪觀想成就儀軌經", "宋", "天息災"), // 宋 法賢譯
                "T1243", Kind.jin.of3("佛說出生一切如來法眼遍照大力明王經", "宋", "法護"), // 宋 法護譯
                "T1244", Kind.jin.of3("毘沙門天王經", "唐", "不空"), // 唐 不空譯
                "T1245", Kind.jin.of3("佛說毘沙門天王經", "宋", "法天"), // 宋 法天譯

                "T1246", Kind.yiGui.of3("摩訶吠室囉末那野提婆喝囉闍陀羅尼儀軌", "唐", "智慧輪"), // 唐 般若斫羯囉譯
                "T1247", Kind.yiGui.of3("北方毘沙門天王隨軍護法儀軌", "唐", "不空"), // 唐 不空譯
                "T1248", Kind.yiGui.of3("北方毘沙門天王隨軍護法真言", "唐", "不空"), // 唐 不空譯
                "T1249", Kind.yiGui.of3("毘沙門儀軌", "唐", "不空"), // 唐 不空譯
                "T1250", Kind.yiGui.of3("北方毘沙門多聞寶藏天王神妙陀羅尼別行儀軌", "唐", "不空"), // 唐 不空譯
                "T1251", Kind.yiGui.of3("吽迦陀野儀軌", "唐", "金剛智"), // 唐 金剛智譯

                "T1252a", Kind.jin.of3("佛說大吉祥天女十二名號經", "唐", "不空"), // 唐 不空譯
                "T1252b", Kind.jin.of3("佛說大吉祥天女十二名號經", "唐", "不空"), // 唐 不空譯
                "T1253", Kind.jin.of3("大吉祥天女十二契一百八名無垢大乘經", "唐", "不空"), // 唐 不空譯
                "T1254", Kind.jin.of3("末利支提婆華鬘經", "唐", "不空"), // 唐 不空譯
                "T1255a", Kind.jin.of3("佛說摩利支天菩薩陀羅尼經", "唐", "不空"), // 唐 不空譯
                "T1255b", Kind.jin.of3("佛說摩利支天經", "唐", "不空"), // 唐 不空譯
                "T1256", Kind.jin.of2("佛說摩利支天陀羅尼呪經", "失譯"), // 失譯
                "T1257", Kind.jin.of3("佛說大摩里支菩薩經", "宋", "天息災"), // 宋 天息災譯
                
                "T1258", Kind.yiGui.of3("摩利支菩薩略念誦法", "唐", "不空"), // 唐 不空譯
                "T1259", Kind.yiGui.of2("摩利支天一印法"), //
                "T1260", Kind.yiGui.of3("大藥叉女歡喜母并愛子成就法", "唐", "不空"), // 唐 不空譯
                
                "T1261", Kind.jin.of3("訶利帝母真言經", "唐", "不空"), // 唐 不空譯
                "T1262", Kind.jin.of2("佛說鬼子母經", "失譯"), // 失譯
                "T1263", Kind.jin.of3("氷揭羅天童子經", "唐", "不空"), // 唐 不空譯
                "T1264a", Kind.jin.of3("觀自在菩薩化身蘘麌哩曳童女銷伏毒害陀羅尼經", "唐", "不空"), // 唐 不空譯
                "T1264b", Kind.jin.of3("佛說穰麌梨童女經", "唐", "不空"), // 唐 不空譯
                "T1265", Kind.jin.of3("佛說常瞿利毒女陀羅尼呪經", "唐", "瞿多"), // 唐 瞿多譯
                
                "T1266", Kind.yiGui.of3("大聖天歡喜雙身毘那夜迦法", "唐", "不空"), // 唐 不空譯
                
                "T1267", Kind.jin.of3("使呪法經", "唐", "菩提流志"), // 唐 菩提留支譯
                "T1268", Kind.jin.of3("大使呪法經", "唐", "菩提流志"), // 唐 菩提留支譯
                "T1269", Kind.jin.of3("佛說金色迦那鉢底陀羅尼經", "唐", "金剛智"), // 唐 金剛智譯

                "T1270", Kind.yiGui.of3("大聖歡喜雙身大自在天毘那夜迦王歸依念誦供養法", "唐", "善無畏"), // 唐 善無畏譯
                "T1271", Kind.yiGui.of3("摩訶毘盧遮那如來定惠均等入三昧耶身雙身大聖歡喜天菩薩修行祕密法儀軌", "唐", "不空"), // 唐 不空譯

                "T1272", Kind.jin.of3("金剛薩埵說頻那夜迦天成就儀軌經", "宋", "天息災"), // 宋 法賢譯
                "T1273", Kind.jin.of3("毘那夜迦誐那鉢底瑜伽悉地品祕要", "唐", "含光"), // 唐 含光記

                "T1274", Kind.yiGui.of3("大聖歡喜雙身毘那夜迦天形像品儀軌", "唐", "憬瑟"), // 唐 憬瑟撰
                "T1275", Kind.yiGui.of3("聖歡喜天式法", "唐", "智慧輪"), // 唐 般若惹羯羅撰
                "T1276", Kind.yiGui.of3("文殊師利菩薩根本大教王經金翅鳥王品", "唐", "不空"), // 唐 不空譯
                "T1277", Kind.yiGui.of3("速疾立驗魔醯首羅天說阿尾奢法", "唐", "不空"), // 唐 不空譯
                "T1278", Kind.yiGui.of3("迦樓羅及諸天密言經", "唐", "般若力"), // 唐 般若力譯
                "T1279", Kind.yiGui.of2("摩醯首羅天法要"), //
                "T1280", Kind.yiGui.of2("摩醯首羅大自在天王神通化生伎藝天女念誦法"), //
                "T1281", Kind.yiGui.of3("那羅延天共阿修羅王鬪戰法", "唐", "寶思惟"), // 唐 寶思惟譯
                "T1282", Kind.yiGui.of2("寶藏天女陀羅尼法"), //
                
                "T1283", Kind.jin.of3("佛說寶藏神大明曼拏羅儀軌經", "宋", "法天"), // 宋 法天譯
                "T1284", Kind.jin.of3("佛說聖寶藏神儀軌經", "宋", "法天"), // 宋 法天譯
                "T1285", Kind.jin.of3("佛說寶賢陀羅尼經", "宋", "天息災"), // 宋 法賢譯

                "T1286", Kind.yiGui.of3("堅牢地天儀軌", "唐", "善無畏"), // 唐 善無畏譯
                "T1287", Kind.yiGui.of3("大黑天神法", "唐", "神愷"), // 唐 神愷記

                "T1288", Kind.jin.of3("佛說最上祕密那拏天經", "宋", "天息災"), // 宋 法賢譯
                "T1289", Kind.jin.of3("佛說金毘羅童子威德經", "唐", "不空"), // 唐 不空譯

                "T1290", Kind.yiGui.of3("焰羅王供行法次第", "唐", "不空"), // 唐 阿謨伽撰
                "T1291", Kind.yiGui.of3("深沙大將儀軌", "唐", "不空"), // 唐 不空譯
                "T1292", Kind.yiGui.of2("法華十羅剎法"), //
                "T1293", Kind.yiGui.of3("般若守護十六善神王形體", "唐", "金剛智"), // 唐 金剛智譯
                "T1294", Kind.yiGui.of2("施八方天儀則"), //
                "T1295", Kind.yiGui.of3("供養護世八天法", "唐", "法全"), // 唐 法全集
                "T1296", Kind.yiGui.of2("十天儀軌"), //
                "T1297", Kind.yiGui.of3("供養十二大威德天報恩品", "唐", "不空"), // 唐 不空譯
                "T1298", Kind.yiGui.of2("十二天供儀軌"), //

                "T1299", Kind.jin.of3("文殊師利菩薩及諸仙所說吉凶時日善惡宿曜經", "唐", "不空"), // 唐 不空譯
                "T1300", Kind.jin.of3("摩登伽經", "吳", "竺律炎", "支謙"), // 吳 竺律炎支謙共譯
                "T1301", Kind.jin.of3("舍頭諫太子二十八宿經", "西晉", "竺法護"), // 西晉 竺法護譯
                "T1302", Kind.jin.of3("諸星母陀羅尼經", "唐", "法成"), // 唐 法成譯
                "T1303", Kind.jin.of3("佛說聖曜母陀羅尼經", "宋", "法天"), // 宋 法天譯

                "T1304", Kind.yiGui.of3("宿曜儀軌", "唐", "一行"), // 唐 一行撰
                "T1305", Kind.yiGui.of3("北斗七星念誦儀軌", "唐", "金剛智"), // 唐 金剛智譯
                "T1306", Kind.yiGui.of3("北斗七星護摩祕要儀軌", "唐", "不空"), // 唐 不空述

                "T1307", Kind.jin.of2("佛說北斗七星延命經"), //
                
                "T1308", Kind.yiGui.of3("七曜攘災決", "唐", "金俱吒"), // 唐 金俱吒撰
                "T1309", Kind.yiGui.of3("七曜星辰別行法", "唐", "一行"), // 唐 一行撰
                "T1310", Kind.yiGui.of3("北斗七星護摩法", "唐", "一行"), // 唐 一行撰
                "T1311", Kind.yiGui.of3("梵天火羅九曜", "唐", "一行"), // 唐 一行述
                "T1312", Kind.yiGui.of3("難儞計濕嚩囉天說支輪經", "宋", "天息災"), // 宋 法賢譯
                
                "T1313", Kind.jin.of3("佛說救拔焰口餓鬼陀羅尼經", "唐", "不空"), // 唐 不空譯
                "T1314", Kind.jin.of3("佛說救面然餓鬼陀羅尼神呪經", "唐", "實叉難陀"), // 唐 實叉難陀譯
                
                "T1315", Kind.yiGui.of3("施諸餓鬼飲食及水法", "唐", "不空"), // 唐 不空譯
                "T1316", Kind.yiGui.of3("佛說甘露經陀羅尼呪", "唐", "實叉難陀"), // 唐 實叉難陀譯
                "T1317", Kind.yiGui.of3("甘露陀羅尼呪", "唐", "實叉難陀"), // 唐 實叉難陀譯
                "T1318", Kind.yiGui.of3("瑜伽集要救阿難陀羅尼焰口軌儀經", "唐", "不空"), // 唐 不空譯
                "T1319", Kind.yiGui.of3("瑜伽集要焰口施食起教阿難陀緣由", "唐", "不空"), // 唐 不空譯
                "T1320", Kind.yiGui.of2("瑜伽集要焰口施食儀"), //
                
                "T1321", Kind.jin.of3("佛說施餓鬼甘露味大陀羅尼經", "唐", "跋馱木阿"), // 唐 跋馱木阿譯

                "T1322", Kind.yiGui.of3("新集浴像儀軌", "唐", "慧琳"), // 唐 慧琳述

                "T1323", Kind.jin.of3("除一切疾病陀羅尼經", "唐", "不空"), // 唐 不空譯
                "T1324", Kind.jin.of3("能淨一切眼疾病陀羅尼經", "唐", "不空"), // 唐 不空譯
                "T1325", Kind.jin.of3("佛說療痔病經", "唐", "義淨"), // 唐 義淨譯
                "T1326", Kind.jin.of3("佛說呪時氣病經", "東晉", "曇無蘭"), // 東晉 曇無蘭譯
                "T1327", Kind.jin.of3("佛說呪齒經", "東晉", "曇無蘭"), // 東晉 曇無蘭譯
                "T1328", Kind.jin.of3("佛說呪目經", "東晉", "曇無蘭"), // 東晉 曇無蘭譯
                "T1329", Kind.jin.of3("佛說呪小兒經", "東晉", "曇無蘭"), // 東晉 曇無蘭譯
                "T1330", Kind.jin.of3("囉嚩拏說救療小兒疾病經", "宋", "天息災"), // 宋 法賢譯
                "T1331", Kind.jin.of3("佛說灌頂經", "東晉", "帛尸梨密多羅"), // 東晉 帛尸梨蜜多羅譯
                "T1332", Kind.jin.of2("七佛八菩薩所說大陀羅尼神呪經", "失譯"), // 失譯
                "T1333", Kind.jin.of2("虛空藏菩薩問七佛陀羅尼呪經", "失譯"), // 失譯
                "T1334", Kind.jin.of3("如來方便善巧呪經", "隋", "闍那崛多"), // 隋 闍那崛多譯
                "T1335", Kind.jin.of3("大吉義神呪經", "元魏", "曇曜"), // 元魏 曇曜譯
                "T1336", Kind.jin.of2("陀羅尼雜集", "失譯"), // 失譯
                "T1337", Kind.jin.of3("種種雜呪經", "北周", "闍那崛多"), // 北周 闍那崛多譯
                "T1338", Kind.jin.of3("呪三首經", "唐", "地婆訶羅"), // 唐 地婆訶羅譯
                "T1339", Kind.jin.of3("大方等陀羅尼經", "北涼", "法眾"), // 北涼 法眾譯
                "T1340", Kind.jin.of3("大法炬陀羅尼經", "隋", "闍那崛多"), // 隋 闍那崛多譯
                "T1341", Kind.jin.of3("大威德陀羅尼經", "隋", "闍那崛多"), // 隋 闍那崛多譯
                "T1342", Kind.jin.of3("佛說無崖際總持法門經", "西秦", "法堅"), // 西秦 聖堅譯
                "T1343", Kind.jin.of3("尊勝菩薩所問一切諸法入無量門陀羅尼經", "北齊", "萬天懿"), // 北齊 萬天懿譯
                "T1344", Kind.jin.of3("金剛上味陀羅尼經", "元魏", "佛陀扇多"), // 元魏 佛陀扇多譯
                "T1345", Kind.jin.of3("金剛場陀羅尼經", "隋", "闍那崛多"), // 隋 闍那崛多譯
                "T1346", Kind.jin.of3("諸佛集會陀羅尼經", "唐", "提雲般若"), // 唐 提雲般若等譯
                "T1347", Kind.jin.of3("息除中夭陀羅尼經", "宋", "施護"), // 宋 施護譯
                "T1348", Kind.jin.of3("佛說十二佛名神呪校量功德除障滅罪經", "隋", "闍那崛多"), // 隋 闍那崛多譯
                "T1349", Kind.jin.of3("佛說稱讚如來功德神呪經", "唐", "義淨"), // 唐 義淨譯
                "T1350", Kind.jin.of3("佛說一切如來名號陀羅尼經", "宋", "天息災"), // 宋 法賢譯
                "T1351", Kind.jin.of3("佛說持句神呪經", "吳", "支謙"), // 吳 支謙譯
                "T1352", Kind.jin.of3("佛說陀隣尼鉢經", "東晉", "曇無蘭"), // 東晉 曇無蘭譯
                "T1353", Kind.jin.of3("東方最勝燈王陀羅尼經", "隋", "闍那崛多"), // 隋 闍那崛多譯
                "T1354", Kind.jin.of3("東方最勝燈王如來經", "隋", "闍那崛多"), // 隋 闍那崛多等譯
                "T1355", Kind.jin.of3("佛說聖最上燈明如來陀羅尼經", "宋", "施護"), // 宋 施護譯
                "T1356", Kind.jin.of3("佛說華積陀羅尼神呪經", "吳", "支謙"), // 吳 支謙譯
                "T1357", Kind.jin.of2("佛說師子奮迅菩薩所問經", "失譯"), // 失譯
                "T1358", Kind.jin.of2("佛說花聚陀羅尼呪經", "失譯"), // 失譯
                "T1359", Kind.jin.of3("佛說花積樓閣陀羅尼經", "宋", "施護"), // 宋 施護譯
                "T1360", Kind.jin.of3("六門陀羅尼經", "唐", "玄奘"), // 唐 玄奘譯
                
                "T1361", Kind.lun.of3("六門陀羅尼經論", "古印度", "世親"), // 世親菩薩造
                
                "T1362", Kind.jin.of3("佛說善夜經", "唐", "義淨"), // 唐 義淨譯
                "T1363", Kind.jin.of3("勝幢臂印陀羅尼經", "唐", "玄奘"), // 唐 玄奘譯
                "T1364", Kind.jin.of3("妙臂印幢陀羅尼經", "唐", "實叉難陀"), // 唐 實叉難陀譯
                "T1365", Kind.jin.of3("八名普密陀羅尼經", "唐", "玄奘"), // 唐 玄奘譯
                "T1366", Kind.jin.of3("佛說祕密八名陀羅尼經", "宋", "天息災"), // 宋 法賢譯
                "T1367", Kind.jin.of2("佛說大普賢陀羅尼經", "失譯"), // 失譯
                "T1368", Kind.jin.of2("佛說大七寶陀羅尼經", "失譯"), // 失譯
                "T1369a", Kind.jin.of3("百千印陀羅尼經", "唐", "實叉難陀"), // 唐 實叉難陀譯
                "T1369b", Kind.jin.of3("百千印陀羅尼經", "唐", "實叉難陀"), // 唐 實叉難陀譯
                "T1370", Kind.jin.of3("佛說持明藏八大總持王經", "宋", "施護"), // 宋 施護譯
                "T1371", Kind.jin.of3("佛說聖大總持王經", "宋", "施護"), // 宋 施護譯
                "T1372", Kind.jin.of3("增慧陀羅尼經", "宋", "施護"), // 宋 施護譯
                "T1373", Kind.jin.of3("佛說施一切無畏陀羅尼經", "宋", "施護"), // 宋 施護等譯
                "T1374", Kind.jin.of3("佛說一切功德莊嚴王經", "唐", "義淨"), // 唐 義淨譯
                "T1375", Kind.jin.of3("佛說莊嚴王陀羅尼呪經", "唐", "義淨"), // 唐 義淨譯
                "T1376", Kind.jin.of3("佛說聖莊嚴陀羅尼經", "宋", "施護"), // 宋 施護譯
                "T1377", Kind.jin.of3("佛說寶帶陀羅尼經", "宋", "施護"), // 宋 施護譯
                "T1378a", Kind.jin.of3("佛說玄師颰陀所說神呪經", "東晉", "曇無蘭"), // 東晉 曇無蘭譯
                "T1378b", Kind.jin.of3("幻師颰陀神呪經", "東晉", "曇無蘭"), // 東晉 曇無蘭譯
                "T1379", Kind.jin.of3("佛說大愛陀羅尼經", "宋", "天息災"), // 宋 法賢譯
                "T1380", Kind.jin.of3("佛說善樂長者經", "宋", "天息災"), // 宋 法賢譯
                "T1381", Kind.jin.of3("佛說大吉祥陀羅尼經", "宋", "天息災"), // 宋 法賢譯
                "T1382", Kind.jin.of3("佛說宿命智陀羅尼", "宋", "天息災"), // 宋 法賢譯
                "T1383", Kind.jin.of3("佛說宿命智陀羅尼經", "宋", "天息災"), // 宋 法賢譯
                "T1384", Kind.jin.of3("佛說鉢蘭那賒嚩哩大陀羅尼經", "宋", "天息災"), // 宋 法賢譯
                "T1385", Kind.jin.of3("佛說俱枳羅陀羅尼經", "宋", "天息災"), // 宋 法賢譯
                "T1386", Kind.jin.of3("佛說妙色陀羅尼經", "宋", "天息災"), // 宋 法賢譯
                "T1387", Kind.jin.of3("佛說栴檀香身陀羅尼經", "宋", "天息災"), // 宋 法賢譯
                "T1388", Kind.jin.of3("佛說無畏陀羅尼經", "宋", "天息災"), // 宋 法賢譯
                "T1389", Kind.jin.of3("佛說無量壽大智陀羅尼", "宋", "天息災"), // 宋 法賢譯
                "T1390", Kind.jin.of3("佛說洛叉陀羅尼經", "宋", "天息災"), // 宋 法賢譯
                "T1391", Kind.jin.of3("佛說檀特羅麻油述經", "東晉", "曇無蘭"), // 東晉 曇無蘭譯
                "T1392", Kind.jin.of3("大寒林聖難拏陀羅尼經", "宋", "法天"), // 宋 法天譯
                "T1393", Kind.jin.of3("佛說摩尼羅亶經", "東晉", "曇無蘭"), // 東晉 曇無蘭譯
                "T1394", Kind.jin.of2("佛說安宅神呪經", "失譯"), // 失譯
                "T1395", Kind.jin.of3("拔濟苦難陀羅尼經", "唐", "玄奘"), // 唐 玄奘譯
                "T1396", Kind.jin.of3("佛說拔除罪障呪王經", "唐", "義淨"), // 唐 義淨譯
                "T1397", Kind.jin.of3("智炬陀羅尼經", "唐", "提雲般若"), // 唐 提雲般若等譯
                "T1398", Kind.jin.of3("佛說智光滅一切業障陀羅尼經", "宋", "施護"), // 宋 施護譯
                "T1399", Kind.jin.of3("佛說滅除五逆罪大陀羅尼經", "宋", "天息災"), // 宋 法賢譯
                "T1400", Kind.jin.of3("佛說消除一切災障寶髻陀羅尼經", "宋", "天息災"), // 宋 法賢譯
                "T1401", Kind.jin.of3("佛說大金剛香陀羅尼經", "宋", "施護"), // 宋 施護譯
                "T1402", Kind.jin.of3("消除一切閃電障難隨求如意陀羅尼經", "宋", "施護"), // 宋 施護譯
                "T1403", Kind.jin.of3("佛說如意摩尼陀羅尼經", "宋", "施護"), // 宋 施護譯
                "T1404", Kind.jin.of3("佛說如意寶總持王經", "宋", "施護"), // 宋 施護譯
                "T1405", Kind.jin.of3("佛說息除賊難陀羅尼經", "宋", "天息災"), // 宋 法賢譯
                "T1406", Kind.jin.of2("佛說辟除賊害呪經"), //
                "T1407", Kind.jin.of3("佛說辟除諸惡陀羅尼經", "宋", "天息災"), // 宋 法賢譯
                "T1408", Kind.jin.of3("佛說最上意陀羅尼經", "宋", "施護"), // 宋 施護譯
                "T1409", Kind.jin.of3("佛說聖最勝陀羅尼經", "宋", "施護"), // 宋 施護譯
                "T1410", Kind.jin.of3("佛說勝幡瓔珞陀羅尼經", "宋", "施護"), // 宋 施護譯
                "T1411", Kind.jin.of3("佛說蓮華眼陀羅尼經", "宋", "施護"), // 宋 施護譯
                "T1412", Kind.jin.of3("佛說寶生陀羅尼經", "宋", "施護"), // 宋 施護譯
                "T1413", Kind.jin.of3("佛說尊勝大明王經", "宋", "施護"), // 宋 施護譯
                "T1414", Kind.jin.of3("佛說金身陀羅尼經", "宋", "施護"), // 宋 施護譯
                "T1415", Kind.jin.of3("大金剛妙高山樓閣陀羅尼", "宋", "施護"), // 宋 施護譯
                "T1416", Kind.jin.of3("金剛摧碎陀羅尼", "宋", "慈賢"), // 宋 慈賢譯
                "T1417", Kind.jin.of3("佛說壞相金剛陀羅尼經", "元", "沙囉巴"), // 元 沙囉巴譯
                "T1418", Kind.jin.of3("佛說一切如來安像三昧儀軌經", "宋", "施護"), // 宋 施護譯
                "T1419", Kind.jin.of3("佛說造像量度經解", "清", "工布查布"), // 清 工布查布譯解
               
                "T1420", Kind.lun.of2("龍樹五明論"), //
               
                "T1421", Kind.lv.of3("彌沙塞部和醯五分律", "劉宋", "佛陀什", "竺道生"), // 劉宋 佛陀什共竺道生等譯
                "T1422a", Kind.lv.of3("彌沙塞五分戒本", "劉宋", "佛陀什"), // 劉宋 佛陀什等譯
                "T1422b", Kind.lv.of3("五分戒本", "劉宋", "佛陀什"), // 劉宋 佛陀什等譯
                "T1423", Kind.lv.of3("五分比丘尼戒本", "梁", "明徽"), // 梁 明徽集
                "T1424", Kind.lv.of3("彌沙塞羯磨本", "唐", "愛同"), // 唐 愛同錄
                "T1425", Kind.lv.of3("摩訶僧祇律", "東晉", "佛馱跋陀羅", "法顯"), // 東晉 佛陀跋陀羅共法顯譯
                "T1426", Kind.lv.of3("摩訶僧祇律大比丘戒本", "東晉", "佛馱跋陀羅"), // 東晉 佛陀跋陀羅譯
                "T1427", Kind.lv.of3("摩訶僧祇比丘尼戒本", "東晉", "法顯", "佛馱跋陀羅"), // 東晉 法顯共覺賢譯
                "T1428", Kind.lv.of3("四分律", "姚秦", "佛陀耶舍", "竺佛念"), // 姚秦 佛陀耶舍共竺佛念等譯
                "T1429", Kind.lv.of3("四分律比丘戒本", "後秦", "佛陀耶舍"), // 後秦 佛陀耶舍譯
                "T1430", Kind.lv.of3("四分僧戒本", "後秦", "佛陀耶舍"), // 後秦 佛陀耶舍譯
                "T1431", Kind.lv.of3("四分比丘尼戒本", "後秦", "佛陀耶舍"), // 後秦 佛陀耶舍譯
                "T1432", Kind.lv.of3("曇無德律部雜羯磨", "曹魏", "康僧鎧"), // 曹魏 康僧鎧譯
                "T1433", Kind.lv.of3("羯磨", "曹魏", "曇帝"), // 曹魏 曇諦譯
                "T1434", Kind.lv.of3("四分比丘尼羯磨法", "劉宋", "求那跋摩"), // 劉宋 求那跋摩譯
                "T1435", Kind.lv.of3("十誦律", "後秦", "弗若多羅", "鳩摩羅什"), // 後秦 弗若多羅共羅什譯
                "T1436", Kind.lv.of3("十誦比丘波羅提木叉戒本", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯
                "T1437", Kind.lv.of3("十誦比丘尼波羅提木叉戒本", "劉宋", "法頴"), // 劉宋 法顯集出
                "T1438", Kind.lv.of2("大沙門百一羯磨法"), //
                "T1439", Kind.lv.of3("十誦羯磨比丘要用", "劉宋", "僧璩"), // 劉宋 僧璩撰出
                "T1440", Kind.lv.of2("薩婆多毘尼毘婆沙", "失譯"), // 失譯
                "T1441", Kind.lv.of3("薩婆多部毘尼摩得勒伽", "劉宋", "僧伽跋摩"), // 劉宋 僧伽跋摩譯
                "T1442", Kind.lv.of3("根本說一切有部毘奈耶", "唐", "義淨"), // 唐 義淨譯
                "T1443", Kind.lv.of3("根本說一切有部苾芻尼毘奈耶", "唐", "義淨"), // 唐 義淨譯
                "T1444", Kind.lv.of3("根本說一切有部毘奈耶出家事", "唐", "義淨"), // 唐 義淨譯
                "T1445", Kind.lv.of3("根本說一切有部毘奈耶安居事", "唐", "義淨"), // 唐 義淨譯
                "T1446", Kind.lv.of3("根本說一切有部毘奈耶隨意事", "唐", "義淨"), // 唐 義淨譯
                "T1447", Kind.lv.of3("根本說一切有部毘奈耶皮革事", "唐", "義淨"), // 唐 義淨譯
                "T1448", Kind.lv.of3("根本說一切有部毘奈耶藥事", "唐", "義淨"), // 唐 義淨譯
                "T1449", Kind.lv.of3("根本說一切有部毘奈耶羯恥那衣事", "唐", "義淨"), // 唐 義淨譯
                "T1450", Kind.lv.of3("根本說一切有部毘奈耶破僧事", "唐", "義淨"), // 唐 義淨譯
                "T1451", Kind.lv.of3("根本說一切有部毘奈耶雜事", "唐", "義淨"), // 唐 義淨譯
                "T1452", Kind.lv.of3("根本說一切有部尼陀那目得迦", "唐", "義淨"), // 唐 義淨譯
                "T1453", Kind.lv.of3("根本說一切有部百一羯磨", "唐", "義淨"), // 唐 義淨譯
                "T1454", Kind.lv.of3("根本說一切有部戒經", "唐", "義淨"), // 唐 義淨譯
                "T1455", Kind.lv.of3("根本說一切有部苾芻尼戒經", "唐", "義淨"), // 唐 義淨譯
                "T1456", Kind.lv.of3("根本說一切有部毘奈耶尼陀那目得迦攝頌", "唐", "義淨"), // 唐 義淨譯
                "T1457", Kind.lv.of3("根本說一切有部略毘奈耶雜事攝頌", "唐", "義淨"), // 唐 義淨譯
                
                "T1458", Kind.lvShi.of3("根本薩婆多部律攝", "唐", "義淨", "勝友"), // 尊者勝友造  唐 義淨譯
                "T1459", Kind.lvShi.of3("根本說一切有部毘奈耶頌", "唐", "義淨", "毗舍佉"), // 尊者毘舍佉造  唐 義淨譯
                
                "T1460", Kind.lv.of3("解脫戒經", "東魏", "般若流支"), // 元魏 般若流支譯
                
                "T1461", Kind.lvShi.of3("律二十二明了論", "陳", "真諦", "弗陀多羅多"), // 弗陀多羅多造  陳 真諦譯
                "T1462", Kind.lvShi.of3("善見律毘婆沙", "蕭齊", "僧伽跋陀羅"), // 蕭齊 僧伽跋陀羅譯
                
                "T1463", Kind.lv.of2("毘尼母經", "失譯"), // 失譯
                "T1464", Kind.lv.of3("鼻奈耶", "前秦", "竺佛念"), // 姚秦 竺佛念譯
                "T1465", Kind.lv.of2("舍利弗問經", "失譯"), // 失譯
                "T1466", Kind.lv.of3("優波離問佛經", "劉宋", "求那跋摩"), // 宋 求那跋摩譯
                "T1467a", Kind.lv.of3("佛說犯戒罪報輕重經", "東漢", "安清"), // 後漢 安世高譯
                "T1467b", Kind.lv.of2("佛說犯戒罪報輕重經"), //
                "T1468", Kind.lv.of3("佛說目連所問經", "宋", "法天"), // 宋 法天譯
                "T1469", Kind.lv.of3("佛說迦葉禁戒經", "劉宋", "沮渠京聲"), // 宋 沮渠京聲譯
                "T1470", Kind.lv.of3("大比丘三千威儀", "東漢", "安清"), // 後漢 安世高譯
                "T1471", Kind.lv.of2("沙彌十戒法并威儀", "失譯"), // 失譯
                "T1472", Kind.lv.of3("沙彌威儀", "劉宋", "求那跋摩"), // 宋 求那跋摩譯
                "T1473", Kind.lv.of3("佛說沙彌十戒儀則經", "宋", "施護"), // 宋 施護譯
                "T1474", Kind.lv.of2("沙彌尼戒經", "失譯"), // 失譯
                "T1475", Kind.lv.of2("沙彌尼離戒文", "失譯"), // 失譯
                "T1476", Kind.lv.of3("佛說優婆塞五戒相經", "劉宋", "求那跋摩"), // 宋 求那跋摩譯
                "T1477", Kind.lv.of3("佛說戒消災經", "吳", "支謙"), // 吳 支謙譯
                "T1478", Kind.lv.of2("大愛道比丘尼經", "失譯"), // 失譯
                "T1479", Kind.lv.of3("佛說苾芻五法經", "宋", "法天"), // 宋 法天譯
                "T1480", Kind.lv.of3("佛說苾芻迦尸迦十法經", "宋", "法天"), // 宋 法天譯
                "T1481", Kind.lv.of3("佛說五恐怖世經", "劉宋", "沮渠京聲"), // 宋 沮渠京聲譯
                "T1482", Kind.lv.of3("佛阿毘曇經出家相品", "陳", "真諦"), // 陳 真諦譯
                "T1483a", Kind.lv.of2("佛說目連問戒律中五百輕重事", "失譯"), // 失譯
                "T1483b", Kind.lv.of2("佛說目連問戒律中五百輕重事經", "失譯"), // 失譯
                "T1484", Kind.lv.of3("梵網經", "後秦", "鳩摩羅什"), // 後秦 鳩摩羅什譯
                "T1485", Kind.lv.of3("菩薩瓔珞本業經", "前秦", "竺佛念"), // 姚秦 竺佛念譯
                "T1486", Kind.lv.of2("受十善戒經", "失譯"), // 失譯
                "T1487", Kind.lv.of3("佛說菩薩內戒經", "劉宋", "求那跋摩"), // 宋 求那跋摩譯
                "T1488", Kind.lv.of3("優婆塞戒經", "北涼", "曇無讖"), // 北涼 曇無讖譯
                "T1489", Kind.lv.of3("清淨毘尼方廣經", "後秦", "鳩摩羅什"), // 後秦 鳩摩羅什譯
                "T1490", Kind.lv.of3("寂調音所問經", "劉宋", "法海"), // 宋 法海譯
                "T1491", Kind.lv.of3("菩薩藏經", "梁", "僧伽婆羅"), // 梁 僧伽婆羅譯
                "T1492", Kind.lv.of3("佛說舍利弗悔過經", "東漢", "安清"), // 後漢 安世高譯
                "T1493", Kind.lv.of3("大乘三聚懺悔經", "隋", "闍那崛多", "達摩笈多"), // 隋 闍那崛多共笈多等譯
                "T1494", Kind.lv.of2("佛說淨業障經", "失譯"), // 失譯
                "T1495", Kind.lv.of3("善恭敬經", "隋", "闍那崛多"), // 隋 闍那崛多譯
                "T1496", Kind.lv.of3("佛說正恭敬經", "東魏", "佛陀扇多"), // 元魏 佛陀扇多譯
                "T1497", Kind.lv.of3("佛說大乘戒經", "宋", "施護"), // 宋 施護譯
                "T1498", Kind.lv.of3("佛說八種長養功德經", "宋", "法護"), // 宋 法護等譯
                "T1499", Kind.lv.of3("菩薩戒羯磨文", "唐", "玄奘", "彌勒菩薩"), // 彌勒菩薩說  唐 玄奘譯
                "T1500", Kind.lv.of3("菩薩戒本", "北涼", "曇無讖", "彌勒菩薩"), // 慈氏菩薩說  北涼 曇無讖譯
                "T1501", Kind.lv.of3("菩薩戒本", "唐", "玄奘", "彌勒菩薩"), // 彌勒菩薩說  唐 玄奘譯
                "T1502", Kind.lv.of3("菩薩受齋經", "西晉", "聶道真"), // 西晉 聶道真譯
                "T1503", Kind.lv.of3("優婆塞五戒威儀經", "劉宋", "求那跋摩"), // 宋 求那跋摩譯
                "T1504", Kind.lv.of2("菩薩五法懺悔文", "失譯"), // 失譯
                
                "T1505", Kind.lun.of3("四阿鋡暮抄解", "符秦", "婆素跋陀", "鳩摩羅佛提"), // 婆素跋陀造  符秦 鳩摩羅佛提等譯
                "T1506", Kind.lun.of3("三法度論", "東晉", "僧伽提婆"), // 東晉 僧伽提婆譯
                "T1507", Kind.lun.of2("分別功德論", "失譯"), // 失譯附後漢錄
                "T1508", Kind.lun.of3("阿含口解十二因緣經", "東漢", "安玄", "嚴佛調"), // 後漢 安玄共嚴佛調譯
                "T1509", Kind.lun.of3("大智度論", "後秦", "鳩摩羅什", "龍樹"), // 龍樹菩薩造  後秦 鳩摩羅什譯
                "T1510a", Kind.lun.of3("金剛般若論", "隋", "無著", "達摩笈多"), // 無著菩薩造  隋 達磨笈多譯
                "T1510b", Kind.lun.of4("金剛般若波羅蜜經論", new String[]{"古印度", "隋"}, "無著", "達摩笈多"), // 無著菩薩造  隋 達磨笈多譯
                "T1511", Kind.lun.of4("金剛般若波羅蜜經論", new String[]{"古印度", "元魏"}, "菩提流支", "世親"), // 天親菩薩造  元魏 菩提流支譯
                "T1512", Kind.lun.of4("金剛仙論", new String[]{"古印度", "元魏"}, "菩提流支", "世親", "金剛仙"), // 世親菩薩造  金剛仙論師釋  元魏 菩提流支譯

                "T1513", Kind.lunShi.of4("能斷金剛般若波羅蜜多經論釋", new String[]{"古印度", "唐"}, "義淨", "無著", "世親"), // 無著菩薩造頌  世親菩薩釋  唐 義淨譯

                "T1514", Kind.lun.of4("能斷金剛般若波羅蜜多經論頌", new String[]{"古印度", "唐"}, "義淨", "無著"), // 無著菩薩造  唐 義淨譯
                "T1515", Kind.lun.of3("金剛般若波羅蜜經破取著不壞假名論", "唐", "地婆訶羅", "功德施"), // 功德施菩薩造  唐 地婆訶羅等譯
                "T1516", Kind.lun.of3("聖佛母般若波羅蜜多九頌精義論", "宋", "法護", "勝德赤衣"), // 勝德赤衣菩薩造  宋 法護等譯
                "T1517", Kind.lun.of3("佛母般若波羅蜜多圓集要義釋論", "宋", "施護", "三寶尊", "陳那"), // 三寶尊菩薩造  大域龍菩薩造本論  宋 施護等譯
                "T1518", Kind.lun.of3("佛母般若波羅蜜多圓集要義論", "宋", "施護", "陳那"), // 大域龍菩薩造  宋 施護等譯

                "T1519", Kind.lun.of3("妙法蓮華經憂波提舍", "後魏", "菩提流支", "曇琳", "世親"), // 大乘論師婆藪槃豆釋  後魏 菩提留支共曇林等譯
                "T1520", Kind.lunShi.of3("妙法蓮華經論優波提舍", "元魏", "勒那摩提", "僧朗", "世親"), // 婆藪般豆菩薩造  元魏 勒那摩提共僧朗等譯

                "T1521", Kind.lun.of3("十住毘婆沙論", "後秦", "鳩摩羅什", "龍樹"), // 聖者龍樹造  後秦 鳩摩羅什譯

                "T1522", Kind.jinShi.of4("十地經論", new String[]{"古印度", "後魏"}, "菩提流支", "世親"), // 天親菩薩造  後魏 菩提流支等譯
                "T1523", Kind.jinShi.of3("大寶積經論", "後魏", "菩提流支"), // 後魏 菩提流支譯
                "T1524", Kind.jinShi.of3("無量壽經優波提舍", "元魏", "菩提流支", "世親"), // 婆藪槃豆菩薩造  元魏 菩提流支譯
                "T1525", Kind.jinShi.of3("彌勒菩薩所問經論", "後魏", "菩提流支"), // 後魏 菩提流支譯
                "T1526", Kind.jinShi.of4("寶髻經四法憂波提舍", new String[]{"古印度", "東魏"}, "毗目智仙", "世親"), // 天親菩薩造  元魏 毘目智仙譯
                "T1527", Kind.jinShi.of3("涅槃論", "元魏", "達摩菩提", "世親"), // 婆藪槃豆作  元魏 達磨菩提譯
                "T1528", Kind.jinShi.of4("涅槃經本有今無偈論", new String[]{"古印度", "陳"}, "真諦", "世親"), // 天親菩薩造  陳 真諦譯
                "T1529", Kind.jinShi.of4("遺教經論", new String[]{"古印度", "陳"}, "真諦", "世親"), // 天親菩薩造  陳 真諦譯
                "T1530", Kind.jinShi.of3("佛地經論", "唐", "玄奘", "親光"), // 親光菩薩等造  唐 玄奘譯
                "T1531", Kind.jinShi.of4("文殊師利菩薩問菩提經論", new String[]{"古印度", "東魏"}, "菩提流支", "世親"), // 天親菩薩造  元魏 菩提流支譯
                "T1532", Kind.jinShi.of4("勝思惟梵天所問經論", new String[]{"古印度", "後魏"}, "菩提流支", "世親"), // 天親菩薩造  後魏 菩提流支譯
                "T1533", Kind.jinShi.of4("轉法輪經憂波提舍", new String[]{"古印度", "東魏"}, "毗目智仙", "世親"), // 天親菩薩造  元魏 毘目智仙譯
                "T1534", Kind.jinShi.of3("三具足經憂波提舍", "東魏", "毗目智仙"), // 元魏 毘目智仙譯
                "T1535", Kind.jinShi.of2("大乘四法經釋"), //

                "T1536", Kind.lun.of3("阿毘達磨集異門足論", "唐", "玄奘", "舍利弗"), // 尊者舍利子說  唐 玄奘譯
                "T1537", Kind.lun.of3("阿毘達磨法蘊足論", "唐", "玄奘", "目犍連"), // 尊者大目乾連造  唐 玄奘譯
                "T1538", Kind.lun.of3("施設論", "宋", "法護"), // 宋 法護等譯
                "T1539", Kind.lun.of3("阿毘達磨識身足論", "唐", "玄奘", "提婆設摩"), // 提婆設摩造  唐 玄奘譯
                "T1540", Kind.lun.of3("阿毘達磨界身足論", "唐", "玄奘", "世友"), // 尊者世友造  唐 玄奘譯
                "T1541", Kind.lun.of3("眾事分阿毘曇論", "劉宋", "求那跋陀羅", "菩提耶舍", "世友"), // 尊者世友造  宋 求那跋陀羅共菩提耶舍譯
                "T1542", Kind.lun.of3("阿毘達磨品類足論", "唐", "玄奘", "世友"), // 尊者世友造  唐 玄奘譯
                "T1543", Kind.lun.of3("阿毘曇八犍度論", "符秦", "僧伽提婆", "竺佛念", "迦栴延子"), // 迦栴延子造  符秦 僧伽提婆共竺佛念譯
                "T1544", Kind.lun.of3("阿毘達磨發智論", "唐", "玄奘", "迦栴延子"), // 迦多衍尼子造  唐 玄奘譯
                "T1545", Kind.lun.of3("阿毘達磨大毘婆沙論", "唐", "玄奘"), // 五百大阿羅漢等造  唐 玄奘譯
                "T1546", Kind.lun.of3("阿毘曇毘婆沙論", "北涼", "浮陀跋摩", "道泰", "迦栴延子"), // 迦旃延子造  五百羅漢釋  北涼 浮陀跋摩共道泰等譯
                "T1547", Kind.lun.of3("鞞婆沙論", "符秦", "僧伽跋澄", "尸陀槃尼"), // 尸陀槃尼撰  符秦 僧伽跋澄譯
                "T1548", Kind.lun.of3("舍利弗阿毘曇論", "姚秦", "曇摩耶舍", "曇摩崛多"), // 姚秦 曇摩耶舍共曇摩崛多等譯
                "T1549", Kind.lun.of3("尊婆須蜜菩薩所集論", "符秦", "僧伽跋澄", "尊婆須蜜"), // 尊婆須蜜造  符秦 僧伽跋澄等譯
                "T1550", Kind.lun.of3("阿毘曇心論", "晉", "僧伽提婆", "慧遠", "法勝"), // 尊者法勝造  晉 僧迦提婆共慧遠等譯
                "T1551", Kind.lun.of3("阿毘曇心論經", "高齊", "那連提黎耶舍", "法勝", "優波扇多"), // 法勝論  優波扇多釋  高齊 那連提耶舍譯
                "T1552", Kind.lun.of3("雜阿毘曇心論", "劉宋", "僧伽跋摩", "法救"), // 尊者法救造  宋 僧伽跋摩等譯
                "T1553", Kind.lun.of2("阿毘曇甘露味論", "瞿沙"), // 尊者瞿沙造  失譯
                "T1554", Kind.lun.of3("入阿毘達磨論", "唐", "玄奘", "塞建地羅"), // 塞建陀羅造  唐 玄奘譯
                "T1555", Kind.lun.of3("五事毘婆沙論", "唐", "玄奘", "法救"), // 尊者法救造  唐 玄奘譯
                "T1556", Kind.lun.of3("薩婆多宗五事論", "唐", "法成"), // 唐 法成譯
                "T1557", Kind.lun.of3("阿毘曇五法行經", "東漢", "安清"), // 後漢 安世高譯
                "T1558", Kind.lun.of3("阿毘達磨俱舍論", "唐", "玄奘", "世親"), // 尊者世親造  唐 玄奘譯

                "T1559", Kind.lunShi.of3("阿毘達磨俱舍釋論", "陳", "真諦", "世親"), // 婆藪盤豆造  陳 真諦譯

                "T1560", Kind.lun.of4("阿毘達磨俱舍論本頌", new String[]{"古印度", "唐"}, "玄奘", "世親"), // 世親菩薩造  唐 玄奘譯

                "T1561", Kind.lunShi.of2("俱舍論實義疏", "安慧"), // 尊者安惠造

                "T1562", Kind.lun.of3("阿毘達磨順正理論", "唐", "玄奘", "眾賢"), // 尊者眾賢造  唐 玄奘譯
                "T1563", Kind.lun.of3("阿毘達磨藏顯宗論", "唐", "玄奘", "眾賢"), // 尊者眾賢造  唐 玄奘譯
                "T1564", Kind.lun.of4("中論", new String[]{"古印度", "姚秦"}, "鳩摩羅什", "龍樹", "青目"), // 龍樹菩薩造  梵志青目釋  姚秦 鳩摩羅什譯
                "T1565", Kind.lun.of4("順中論", new String[]{"古印度", "東魏"}, "般若流支", "龍樹", "無著"), // 龍樹菩薩造  無著菩薩釋  元魏 瞿曇般若流支譯

                "T1566", Kind.lunShi.of4("般若燈論釋", new String[]{"古印度", "唐"}, "波羅頗迦羅蜜多羅", "清辨", "龍樹"), // 偈本龍樹菩薩  釋論分別明菩薩  唐 波羅頗蜜多羅譯

                "T1567", Kind.lun.of3("大乘中觀釋論", "宋", "惟淨", "安慧"), // 安慧菩薩造  宋 惟淨等譯
                "T1568", Kind.lun.of4("十二門論", new String[]{"古印度", "姚秦"}, "鳩摩羅什", "龍樹"), // 龍樹菩薩造  姚秦 鳩摩羅什譯
                "T1569", Kind.lun.of3("百論", "姚秦", "鳩摩羅什", "婆藪開士", "迦那提婆"), // 提婆菩薩造  婆藪開士釋  姚秦 鳩摩羅什譯
                "T1570", Kind.lun.of4("廣百論本", new String[]{"古印度", "唐"}, "玄奘", "聖天"), // 聖天菩薩造  唐 玄奘譯

                "T1571", Kind.lunShi.of4("大乘廣百論釋論", new String[]{"古印度", "唐"}, "玄奘", "聖天", "護法"), // 聖天菩薩本  護法菩薩釋  唐 玄奘譯

                "T1572", Kind.lun.of3("百字論", "後魏", "菩提流支", "迦那提婆"), // 提婆菩薩造  後魏 菩提流支譯
                "T1573", Kind.lun.of3("壹輸盧迦論", "東魏", "般若流支", "龍樹"), // 龍樹菩薩造  後魏 瞿曇般若留支譯
                "T1574", Kind.lun.of3("大乘破有論", "宋", "施護", "龍樹"), // 龍樹菩薩造  宋 施護譯
                "T1575", Kind.lun.of3("六十頌如理論", "宋", "施護", "龍樹"), // 龍樹菩薩造  宋 施護譯
                "T1576", Kind.lun.of3("大乘二十頌論", "宋", "施護", "龍樹"), // 龍樹菩薩造  宋 施護譯
                "T1577", Kind.lun.of3("大丈夫論", "北涼", "道泰", "提婆羅"), // 提婆羅菩薩造  北涼 道泰譯
                "T1578", Kind.lun.of3("大乘掌珍論", "唐", "玄奘", "清辯"), // 清辯菩薩造  唐 玄奘譯
                "T1579", Kind.lun.of3("瑜伽師地論", "唐", "玄奘", "彌勒菩薩"), // 彌勒菩薩說  唐 玄奘譯

                "T1580", Kind.lunShi.of3("瑜伽師地論釋", "唐", "玄奘", "最勝子"), // 最勝子等造  唐 玄奘譯

                "T1581", Kind.lun.of3("菩薩地持經", "北涼", "曇無讖"), // 北涼 曇無讖譯
                "T1582", Kind.lun.of3("菩薩善戒經", "劉宋", "求那跋摩"), // 劉宋 求那跋摩譯
                "T1583", Kind.lun.of3("菩薩善戒經", "劉宋", "求那跋摩"), // 劉宋 求那跋摩譯
                "T1584", Kind.lun.of3("決定藏論", "梁", "真諦"), // 梁 真諦譯
                "T1585", Kind.lun.of3("成唯識論", "唐", "玄奘", "護法"), // 護法等菩薩造  唐 玄奘譯
                "T1586", Kind.lun.of4("唯識三十論頌", new String[]{"古印度", "唐"}, "玄奘", "世親"), // 世親菩薩造  唐 玄奘譯
                "T1587", Kind.lun.of3("轉識論", "陳", "真諦"), // 陳 真諦譯
                "T1588", Kind.lun.of4("唯識論", new String[]{"古印度", "東魏"}, "般若流支", "世親"), // 天親菩薩造  後魏 瞿曇般若流支譯
                "T1589", Kind.lun.of4("大乘唯識論", new String[]{"古印度", "陳"}, "真諦", "世親"), // 天親菩薩造  陳 真諦譯
                "T1590", Kind.lun.of4("唯識二十論", new String[]{"古印度", "唐"}, "玄奘", "世親"), // 世親菩薩造  唐 玄奘譯
                "T1591", Kind.lun.of3("成唯識寶生論", "唐", "義淨", "護法"), // 護法菩薩造  唐 義淨譯
                "T1592", Kind.lun.of3("攝大乘論", "後魏", "佛陀扇多", "無著"), // 阿僧伽作  後魏 佛陀扇多譯
                "T1593", Kind.lun.of4("攝大乘論", new String[]{"古印度", "陳"}, "真諦", "無著"), // 無著菩薩造  陳 真諦譯
                "T1594", Kind.lun.of4("攝大乘論本", new String[]{"古印度", "唐"}, "玄奘", "無著"), // 無著菩薩造  唐 玄奘譯

                "T1595", Kind.lunShi.of4("攝大乘論釋", new String[]{"古印度", "陳"}, "世親", "真諦"), // 世親菩薩釋  陳 真諦譯
                "T1596", Kind.lunShi.of4("攝大乘論釋論", new String[]{"古印度", "隋"}, "世親", "達摩笈多", "行矩"), // 世親菩薩造  隋 笈多共行矩等譯
                "T1597", Kind.lunShi.of4("攝大乘論釋", new String[]{"古印度", "唐"}, "世親", "玄奘"), // 世親菩薩造  唐 玄奘譯
                "T1598", Kind.lunShi.of3("攝大乘論釋", "唐", "無性", "玄奘"), // 無性菩薩造  唐 玄奘譯

                "T1599", Kind.lun.of4("中邊分別論", new String[]{"古印度", "陳"}, "真諦", "世親"), // 天親菩薩造  陳 真諦譯
                "T1600", Kind.lun.of4("辯中邊論", new String[]{"古印度", "唐"}, "玄奘", "世親"), // 世親菩薩造  唐 玄奘譯
                "T1601", Kind.lun.of3("辯中邊論頌", "唐", "玄奘", "彌勒菩薩"), // 彌勒菩薩說  唐 玄奘譯
                "T1602", Kind.lun.of4("顯揚聖教論", new String[]{"古印度", "唐"}, "玄奘", "無著"), // 無著菩薩造  唐 玄奘譯
                "T1603", Kind.lun.of4("顯揚聖教論頌", new String[]{"古印度", "唐"}, "玄奘", "無著"), // 無著菩薩造  唐 玄奘譯
                "T1604", Kind.lun.of4("大乘莊嚴經論", new String[]{"古印度", "唐"}, "波羅頗迦羅蜜多羅", "無著"), // 無著菩薩造  唐 波羅頗蜜多羅譯
                "T1605", Kind.lun.of4("大乘阿毘達磨集論", new String[]{"古印度", "唐"}, "玄奘", "無著"), // 無著菩薩造  唐 玄奘譯
                "T1606", Kind.lun.of3("大乘阿毘達磨雜集論", "唐", "玄奘", "安慧"), // 安慧菩薩糅  唐 玄奘譯
                "T1607", Kind.lun.of4("六門教授習定論", new String[]{"古印度", "唐"}, "義淨", "無著", "世親"), // 無著本  世親釋  唐 義淨譯
                "T1608", Kind.lun.of4("業成就論", new String[]{"古印度", "東魏"}, "毗目智仙", "世親"), // 天親菩薩造  元魏 毘目智仙譯
                "T1609", Kind.lun.of4("大乘成業論", new String[]{"古印度", "唐"}, "玄奘", "世親"), // 世親菩薩造  唐 玄奘譯
                "T1610", Kind.lun.of4("佛性論", new String[]{"古印度", "陳"}, "真諦", "世親"), // 天親菩薩造  陳 真諦譯
                "T1611", Kind.lun.of3("究竟一乘寶性論", "後魏", "勒那摩提"), // 後魏 勒那摩提譯
                "T1612", Kind.lun.of4("大乘五蘊論", new String[]{"古印度", "唐"}, "玄奘", "世親"), // 世親菩薩造  唐 玄奘譯
                "T1613", Kind.lun.of3("大乘廣五蘊論", "唐", "地婆訶羅", "安慧"), // 安慧菩薩造  唐 地婆訶羅譯
                "T1614", Kind.lun.of4("大乘百法明門論", new String[]{"古印度", "唐"}, "玄奘", "世親"), // 天親菩薩造  唐 玄奘譯
                "T1615", Kind.lun.of3("王法正理論", "唐", "玄奘", "彌勒菩薩"), // 彌勒菩薩造  唐 玄奘譯
                "T1616", Kind.lun.of3("十八空論", "陳", "真諦", "龍樹"), // 龍樹菩薩造  陳 真諦譯
                "T1617", Kind.lun.of3("三無性論", "陳", "真諦"), // 陳 真諦譯
                "T1618", Kind.lun.of3("顯識論", "陳", "真諦"), // 陳 真諦譯
                "T1619", Kind.lun.of3("無相思塵論", "陳", "真諦", "陳那"), // 陳那菩薩造  陳 真諦譯
                "T1620", Kind.lun.of3("解捲論", "陳", "真諦", "陳那"), // 陳那菩薩造  陳 真諦譯
                "T1621", Kind.lun.of3("掌中論", "唐", "義淨", "陳那"), // 陳那菩薩造  唐 義淨譯
                "T1622", Kind.lun.of3("取因假設論", "唐", "義淨", "陳那"), // 陳那菩薩造  唐 義淨譯
                "T1623", Kind.lun.of3("觀總相論頌", "唐", "義淨", "陳那"), // 陳那菩薩造  唐 義淨譯
                "T1624", Kind.lun.of3("觀所緣緣論", "唐", "玄奘", "陳那"), // 陳那菩薩造  唐 玄奘譯

                "T1625", Kind.lunShi.of3("觀所緣論釋", "唐", "義淨", "護法"), // 護法菩薩造  唐 義淨譯

                "T1626", Kind.lun.of3("大乘法界無差別論", "唐", "提雲般若", "堅慧"), // 堅慧菩薩造  唐 提雲般若等譯
                "T1627", Kind.lun.of3("大乘法界無差別論", "唐", "提雲般若", "堅慧"), // 堅慧菩薩造  唐 提雲般若譯
                "T1628", Kind.lun.of3("因明正理門論本", "唐", "玄奘", "陳那"), // 大域龍菩薩造  唐 玄奘譯
                "T1629", Kind.lun.of3("因明正理門論", "唐", "義淨", "陳那"), // 大域龍菩薩造  唐 義淨譯
                "T1630", Kind.lun.of3("因明入正理論", "唐", "玄奘", "商羯羅主"), // 南羯羅主菩薩造  唐 玄奘譯
                "T1631", Kind.lun.of3("迴諍論", "東魏", "毗目智仙", "般若流支", "龍樹"), // 龍樹菩薩造  後魏 毘目智仙共瞿曇流支譯
                "T1632", Kind.lun.of3("方便心論", "後魏", "吉迦夜"), // 後魏 吉迦夜譯
                "T1633", Kind.lun.of3("如實論", "陳", "真諦"), // 陳 真諦譯
                "T1634", Kind.lun.of3("入大乘論", "北涼", "道泰", "堅意"), // 堅意菩薩造  北涼 道泰等譯
                "T1635", Kind.lun.of3("大乘寶要義論", "宋", "法護"), // 宋 法護等譯
                "T1636", Kind.lun.of3("大乘集菩薩學論", "宋", "法護", "法稱"), // 法稱菩薩造  宋 法護等譯
                "T1637", Kind.lun.of3("集大乘相論", "宋", "施護", "覺吉祥智"), // 覺吉祥智菩薩造  宋 施護譯
                "T1638", Kind.lun.of3("集諸法寶最上義論", "宋", "施護", "善寂"), // 善寂菩薩造  宋 施護譯
                "T1639", Kind.lun.of3("提婆菩薩破楞伽經中外道小乘四宗論", "後魏", "菩提流支", "迦那提婆"), // 提波菩薩造  後魏 菩提流支譯
                "T1640", Kind.lun.of3("提婆菩薩釋楞伽經中外道小乘涅槃論", "後魏", "菩提流支", "迦那提婆"), // 提波菩薩造  後魏 菩提流支譯
                "T1641", Kind.lun.of3("隨相論", "陳", "真諦", "瞿那末底"), // 德慧法師造  陳 真諦譯
                "T1642", Kind.lun.of3("金剛針論", "宋", "法天", "法稱"), // 法稱菩薩造  宋 法天譯
                "T1643", Kind.lun.of3("尼乾子問無我義經", "宋", "日稱", "馬鳴"), // 馬鳴菩薩集  宋 日稱譯
                "T1644", Kind.lun.of3("佛說立世阿毘曇論", "陳", "真諦"), // 陳 真諦譯
                "T1645", Kind.lun.of3("彰所知論", "元", "沙囉巴", "發合思巴"), // 發合思巴造  元 沙羅巴譯
                "T1646", Kind.lun.of3("成實論", "姚秦", "鳩摩羅什", "訶梨跋摩"), // 訶梨跋摩造  姚秦 鳩摩羅什譯
                "T1647", Kind.lun.of3("四諦論", "陳", "真諦", "婆藪跋摩"), // 婆藪跋摩造  陳 真諦譯
                "T1648", Kind.lun.of3("解脫道論", "梁", "僧伽婆羅", "優波底沙"), // 優波底沙造  梁 僧伽婆羅譯
                "T1649", Kind.lun.of2("三彌底部論", "失譯"), // 失譯
                "T1650", Kind.lun.of2("辟支佛因緣論", "失譯"), // 失譯
                "T1651", Kind.lun.of3("十二因緣論", "後魏", "菩提流支", "淨意"), // 淨意菩薩造  後魏 菩提流支譯
                "T1652", Kind.lun.of3("緣生論", "隋", "達摩笈多", "鬱楞迦"), // 欝楞迦造  隋 達磨笈多譯
                "T1653", Kind.lun.of3("大乘緣生論", "唐", "不空", "鬱楞迦"), // 欝楞迦造  唐 不空譯

                "T1654", Kind.lunShi.of2("因緣心論頌因緣心論釋", "龍樹"), // 猛龍菩薩造

                "T1655", Kind.lun.of4("止觀門論頌", new String[]{"古印度", "唐"}, "義淨", "世親"), // 世親菩薩造  唐 義淨譯
                "T1656", Kind.lun.of3("寶行王正論", "陳", "真諦"), // 陳 真諦譯
                "T1657", Kind.lun.of3("手杖論", "唐", "義淨", "迦稱"), // 釋迦稱造  唐 義淨譯
                "T1658", Kind.lun.of3("諸教決定名義論", "宋", "施護", "彌勒菩薩"), // 慈氏菩薩造  宋 施護譯
                "T1659", Kind.lun.of4("發菩提心經論", new String[]{"古印度", "後秦"}, "鳩摩羅什", "世親"), // 天親菩薩造  後秦 鳩摩羅什譯
                "T1660", Kind.lun.of3("菩提資糧論", "隋", "達摩笈多", "龍樹", "自在"), // 龍樹本  自在比丘釋  隋 達磨笈多譯
                "T1661", Kind.lun.of3("菩提心離相論", "宋", "施護", "龍樹"), // 龍樹菩薩造  宋 施護譯
                "T1662", Kind.lun.of3("菩提行經", "宋", "天息災", "龍樹"), // 龍樹菩薩集頌  宋 天息災譯
                "T1663", Kind.lun.of3("菩提心觀釋", "宋", "法天"), // 宋 法天譯
                "T1664", Kind.lun.of3("廣釋菩提心論", "宋", "施護", "蓮華戒"), // 蓮華戒菩薩造  宋 施護譯
                "T1665", Kind.lun.of3("金剛頂瑜伽中發阿耨多羅三藐三菩提心論", "唐", "不空"), // 唐 不空譯
                "T1666", Kind.lun.of3("大乘起信論", "梁", "真諦", "馬鳴"), // 馬鳴菩薩造  梁 真諦譯
                "T1667", Kind.lun.of3("大乘起信論", "唐", "實叉難陀", "馬鳴"), // 馬鳴菩薩造  唐 實叉難陀譯
                "T1668", Kind.lun.of3("釋摩訶衍論", "姚秦", "筏提摩多", "龍樹"), // 龍樹菩薩造  姚秦 筏提摩多譯
                "T1669", Kind.lun.of3("大宗地玄文本論", "陳", "真諦", "馬鳴"), // 馬鳴菩薩造  陳 真諦譯

                "T1670A", Kind.jin.of2("那先比丘經", "失譯"), // 失譯
                "T1670B", Kind.jin.of2("那先比丘經", "失譯"), // 失譯
                "T1671", Kind.jin.of3("福蓋正行所集經", "宋", "日稱", "龍樹"), // 龍樹菩薩集  宋 日稱等譯

                "T1672", Kind.lun.of3("龍樹菩薩為禪陀迦王說法要偈", "劉宋", "求那跋摩"), // 宋 求那跋摩譯
                "T1673", Kind.lun.of3("勸發諸王要偈", "劉宋", "僧伽跋摩", "龍樹"), // 龍樹菩薩撰  宋 僧伽跋摩譯
                "T1674", Kind.lun.of3("龍樹菩薩勸誡王頌", "唐", "義淨"), // 唐 義淨譯
                "T1675", Kind.lun.of3("讚法界頌", "宋", "施護", "龍樹"), // 龍樹菩薩造  宋 施護譯
                "T1676", Kind.lun.of3("廣大發願頌", "宋", "施護", "龍樹"), // 龍樹菩薩造  宋 施護等譯
                "T1677", Kind.lun.of3("三身梵讚", "宋", "天息災"), // 宋 法賢譯
                "T1678", Kind.lun.of3("佛三身讚", "宋", "天息災"), // 西土賢聖撰  宋 法賢譯
                "T1679", Kind.lun.of3("佛一百八名讚", "宋", "法天"), // 宋 法天譯
                "T1680", Kind.lun.of3("一百五十讚佛頌", "唐", "義淨", "摩咥里制吒"), // 摩咥里制吒造  唐 義淨譯
                "T1681", Kind.lun.of3("佛吉祥德讚", "宋", "施護", "寂友"), // 寂友尊者造  宋 施護譯
                "T1682", Kind.lun.of3("七佛讚唄伽他", "宋", "法天"), // 宋 法天譯
                "T1683", Kind.lun.of3("犍稚梵讚", "宋", "天息災"), // 宋 法賢譯
                "T1684", Kind.lun.of3("八大靈塔梵讚", "宋", "天息災", "曷利沙伐彈那"), // 西天戒日王製  宋 法賢譯

                "T1685", Kind.jin.of3("佛說八大靈塔名號經", "宋", "天息災"), // 宋 法賢譯

                "T1686", Kind.lun.of3("賢聖集伽陀一百頌", "宋", "天息災"), // 宋 天息災譯
                "T1687", Kind.lun.of3("事師法五十頌", "宋", "日稱", "馬鳴"), // 馬鳴菩薩集  宋 日稱等譯
                "T1688", Kind.lun.of3("密跡力士大權神王經偈頌", "元", "管主八"), // 元 管主八撰
                "T1689", Kind.lun.of3("請賓頭盧法", "劉宋", "慧簡"), // 劉宋 慧簡譯
                "T1690", Kind.lun.of3("賓頭盧突羅闍為優陀延王說法經", "劉宋", "求那跋陀羅"), // 劉宋 求那跋陀羅譯
                "T1691", Kind.lun.of3("迦葉仙人說醫女人經", "宋", "天息災"), // 宋 法賢譯
                "T1692", Kind.lun.of3("勝軍化世百喻伽他經", "宋", "天息災"), // 宋 天息災譯
                
                "T1693", Kind.jinShi.of3("人本欲生經註", "東晉", "道安"), // 東晉 道安撰
                "T1694", Kind.jinShi.of3("陰持入經註", "吳", "陳慧"), // 吳 陳慧撰
                "T1695", Kind.jinShi.of3("大般若波羅蜜多經般若理趣分述讚", "唐", "窺基"), // 唐 窺基撰
                "T1696", Kind.jinShi.of3("大品經遊意", "隋", "吉藏"), // 隋 吉藏撰
                "T1697", Kind.jinShi.of3("大慧度經宗要", "新羅", "元曉"), // 新羅 元曉撰
                "T1698", Kind.jinShi.of3("金剛般若經疏", "隋", "智顗"), // 隋 智顗說
                "T1699", Kind.jinShi.of3("金剛般若疏", "隋", "吉藏"), // 隋 吉藏撰
                "T1700", Kind.jinShi.of3("金剛般若經贊述", "唐", "窺基"), // 唐 窺基撰
                "T1701", Kind.jinShi.of3("金剛般若經疏論纂要", "唐", "宗密", "長水子璿"), // 唐 宗密述  宋 子璿治定
                "T1702", Kind.jinShi.of3("金剛經纂要刊定記", "宋", "長水子璿"), // 宋 子璿錄
                "T1703", Kind.jinShi.of3("金剛般若波羅蜜經註解", "明", "宗泐", "如玘"), // 明 宗泐．如玘同註
                "T1704", Kind.jinShi.of3("金剛般若波羅蜜經略疏", "唐", "智儼"), // 唐 智儼述
                "T1705", Kind.jinShi.of3("仁王護國般若經疏", "隋", "智顗", "灌頂"), // 隋 智顗說  灌頂記
                "T1706", Kind.jinShi.of3("仁王護國般若波羅蜜經疏神寶記", "宋", "善月"), // 宋 善月述
                "T1707", Kind.jinShi.of3("仁王般若經疏", "隋", "吉藏"), // 隋 吉藏撰
                "T1708", Kind.jinShi.of3("仁王經疏", "唐", "圓測"), // 唐 圓測撰
                "T1709", Kind.jinShi.of3("仁王護國般若波羅蜜多經疏", "唐", "良賁"), // 唐 良賁述
                "T1710", Kind.jinShi.of3("般若波羅蜜多心經幽贊", "唐", "窺基"), // 唐 窺基撰
                "T1711", Kind.jinShi.of3("般若波羅蜜多心經贊", "唐", "圓測"), // 唐 圓測撰
                "T1712", Kind.jinShi.of3("般若波羅蜜多心經略疏", "唐", "法藏"), // 唐 法藏述
                "T1713", Kind.jinShi.of3("般若心經略疏連珠記", "宋", "師會"), // 宋 師會述
                "T1714", Kind.jinShi.of3("般若波羅蜜多心經註解", "明", "宗泐", "如玘"), // 明 宗泐．如玘同註
                "T1715", Kind.jinShi.of3("法華經義記", "梁", "法雲"), // 梁 法雲撰
                "T1716", Kind.jinShi.of3("妙法蓮華經玄義", "隋", "智顗"), // 隋 智顗說
                "T1717", Kind.jinShi.of3("法華玄義釋籤", "唐", "湛然"), // 唐 湛然述
                "T1718", Kind.jinShi.of3("妙法蓮華經文句", "隋", "智顗"), // 隋 智顗說
                "T1719", Kind.jinShi.of3("法華文句記", "唐", "湛然"), // 唐 湛然述
                "T1720", Kind.jinShi.of3("法華玄論", "隋", "吉藏"), // 隋 吉藏撰
                "T1721", Kind.jinShi.of3("法華義疏", "隋", "吉藏"), // 隋 吉藏撰
                "T1722", Kind.jinShi.of3("法華遊意", "隋", "吉藏"), // 隋 吉藏造
                "T1723", Kind.jinShi.of3("妙法蓮華經玄贊", "唐", "窺基"), // 唐 窺基撰
                "T1724", Kind.jinShi.of3("法華玄贊義決", "唐", "慧沼"), // 唐 慧沼撰
                "T1725", Kind.jinShi.of3("法華宗要", "新羅", "元曉"), // 新羅 元曉撰
                "T1726", Kind.jinShi.of3("觀音玄義", "隋", "智顗", "灌頂"), // 隋 智顗說．灌頂記
                "T1727", Kind.jinShi.of3("觀音玄義記", "宋", "知禮"), // 宋 知禮述
                "T1728", Kind.jinShi.of3("觀音義疏", "隋", "智顗", "灌頂"), // 隋 智顗說．灌頂記
                "T1729", Kind.jinShi.of3("觀音義疏記", "宋", "知禮"), // 宋 知禮述
                "T1730", Kind.jinShi.of3("金剛三昧經論", "新羅", "元曉"), // 新羅 元曉述
                "T1731", Kind.jinShi.of3("華嚴遊意", "隋", "吉藏"), // 隋 吉藏撰
                "T1732", Kind.jinShi.of3("大方廣佛華嚴經搜玄分齊通智方軌", "唐", "智儼"), // 唐 智儼述
                "T1733", Kind.jinShi.of3("華嚴經探玄記", "唐", "法藏"), // 唐 法藏述
                "T1734", Kind.jinShi.of3("花嚴經文義綱目", "唐", "法藏"), // 唐 法藏撰
                "T1735", Kind.jinShi.of3("大方廣佛華嚴經疏", "唐", "澄觀"), // 唐 澄觀撰
                "T1736", Kind.jinShi.of3("大方廣佛華嚴經隨疏演義鈔", "唐", "澄觀"), // 唐 澄觀述
                "T1737", Kind.jinShi.of3("大華嚴經略策", "唐", "澄觀"), // 唐 澄觀述
                "T1738", Kind.jinShi.of3("新譯華嚴經七處九會頌釋章", "唐", "澄觀"), // 唐 澄觀述
                "T1739", Kind.jinShi.of3("新華嚴經論", "唐", "李通玄"), // 唐 李通玄撰
                "T1740", Kind.jinShi.of3("大方廣佛華嚴經中卷卷大意略敘", "唐", "李通玄"), // 唐 李通玄造
                "T1741", Kind.jinShi.of3("略釋新華嚴經修行次第決疑論", "唐", "李通玄"), // 唐 李通玄撰
                "T1742", Kind.jinShi.of3("大方廣佛華嚴經願行觀門骨目", "唐", "湛然"), // 唐 湛然撰
                "T1743", Kind.jinShi.of3("皇帝降誕日於麟德殿講大方廣佛華嚴經玄義一部", "唐", "靜居"), // 唐 靜居撰
                "T1744", Kind.jinShi.of3("勝鬘寶窟", "隋", "吉藏"), // 隋 吉藏撰
                "T1745", Kind.jinShi.of3("無量壽經義疏", "隋", "慧遠"), // 隋 慧遠撰
                "T1746", Kind.jinShi.of3("無量壽經義疏", "隋", "吉藏"), // 隋 吉藏撰
                "T1747", Kind.jinShi.of3("兩卷無量壽經宗要", "新羅", "元曉"), // 新羅 元曉撰
                "T1748", Kind.jinShi.of3("無量壽經連義述文贊", "新羅", "憬興"), // 新羅 璟興撰
                "T1749", Kind.jinShi.of3("觀無量壽經義疏", "隋", "慧遠"), // 隋 慧遠撰
                "T1750", Kind.jinShi.of3("觀無量壽佛經疏", "隋", "智顗"), // 隋 智顗說
                "T1751", Kind.jinShi.of3("觀無量壽佛經疏妙宗鈔", "宋", "知禮"), // 宋 知禮述
                "T1752", Kind.jinShi.of3("觀無量壽經義疏", "隋", "吉藏"), // 隋 吉藏撰
                "T1753", Kind.jinShi.of3("觀無量壽佛經疏", "唐", "善導"), // 唐 善導集記
                "T1754", Kind.jinShi.of3("觀無量壽佛經義疏", "宋", "元照"), // 宋 元照述
                "T1755", Kind.jinShi.of3("阿彌陀經義記", "隋", "智顗"), // 隋 智顗說
                "T1756", Kind.jinShi.of3("阿彌陀經義述", "唐", "慧淨"), // 唐 慧淨述
                "T1757", Kind.jinShi.of3("阿彌陀經疏", "唐", "窺基"), // 唐 窺基撰
                "T1758", Kind.jinShi.of3("阿彌陀經通贊疏", "唐", "窺基"), // 唐 窺基撰
                "T1759", Kind.jinShi.of3("阿彌陀經疏", "新羅", "元曉"), // 新羅 元曉述
                "T1760", Kind.jinShi.of3("阿彌陀經疏", "宋", "智圓"), // 宋 智圓述
                "T1761", Kind.jinShi.of3("阿彌陀經義疏", "宋", "元照"), // 宋 元照述
                "T1762", Kind.jinShi.of3("阿彌陀經要解", "明", "智旭"), // 明 智旭解
                "T1763", Kind.jinShi.of3("大般涅槃經集解", "梁", "釋寶亮"), // 梁 寶亮等集
                "T1764", Kind.jinShi.of3("大般涅槃經義記", "隋", "慧遠"), // 隋 慧遠述
                "T1765", Kind.jinShi.of3("大般涅槃經玄義", "隋", "灌頂"), // 隋 灌頂撰
                "T1766", Kind.jinShi.of3("涅槃玄義發源機要", "宋", "智圓"), // 宋 智圓述
                "T1767", Kind.jinShi.of3("大般涅槃經疏", "隋", "灌頂"), // 隋 灌頂撰
                "T1768", Kind.jinShi.of3("涅槃經遊意", "隋", "吉藏"), // 隋 吉藏撰
                "T1769", Kind.jinShi.of3("涅槃宗要", "新羅", "元曉"), // 新羅 元曉撰
                "T1770", Kind.jinShi.of3("本願藥師經古迹", "新羅", "太賢"), // 新羅 太賢撰
                "T1771", Kind.jinShi.of3("彌勒經遊意", "隋", "吉藏"), // 隋 吉藏撰
                "T1772", Kind.jinShi.of3("觀彌勒上生兜率天經贊", "唐", "窺基"), // 唐 窺基撰
                "T1773", Kind.jinShi.of3("彌勒上生經宗要", "新羅", "元曉"), // 新羅 元曉撰
                "T1774", Kind.jinShi.of3("三彌勒經疏", "新羅", "憬興"), // 新羅 憬興撰
                "T1775", Kind.jinShi.of3("注維摩詰經", "後秦", "僧肇"), // 後秦 僧肇撰
                "T1776", Kind.jinShi.of3("維摩義記", "隋", "慧遠"), // 隋 慧遠撰
                "T1777", Kind.jinShi.of3("維摩經玄疏", "隋", "智顗"), // 隋 智顗撰
                "T1778", Kind.jinShi.of4("維摩經略疏", new String[]{"隋", "唐"}, "湛然", "智顗"), // 隋 智顗說　唐 湛然略
                "T1779", Kind.jinShi.of3("維摩經略疏垂裕記", "宋", "智圓"), // 宋 智圓述

                "T1780", Kind.lun.of3("淨名玄論", "隋", "吉藏"), // 隋 吉藏造

                "T1781", Kind.jinShi.of3("維摩經義疏", "隋", "吉藏"), // 隋 吉藏撰
                "T1782", Kind.jinShi.of3("說無垢稱經疏", "唐", "窺基"), // 唐 窺基撰
                "T1783", Kind.jinShi.of3("金光明經玄義", "隋", "智顗", "灌頂"), // 隋 智顗說  灌頂錄
                "T1784", Kind.jinShi.of3("金光明經玄義拾遺記", "宋", "知禮"), // 宋 知禮述
                "T1785", Kind.jinShi.of3("金光明經文句", "隋", "智顗", "灌頂"), // 隋 智顗說  灌頂錄
                "T1786", Kind.jinShi.of3("金光明經文句記", "宋", "知禮"), // 宋 知禮述
                "T1787", Kind.jinShi.of3("金光明經疏", "隋", "吉藏"), // 隋 吉藏撰
                "T1788", Kind.jinShi.of3("金光明最勝王經疏", "唐", "慧沼"), // 唐 慧沼撰
                "T1789", Kind.jinShi.of3("楞伽阿跋多羅寶經註解", "明", "宗泐", "如玘"), // 明 宗泐．如玘同註
                "T1790", Kind.jinShi.of3("入楞伽心玄義", "唐", "法藏"), // 唐 法藏撰
                "T1791", Kind.jinShi.of3("注大乘入楞伽經", "宋", "寶臣"), // 宋 寶臣述
                "T1792", Kind.jinShi.of3("佛說盂蘭盆經疏", "唐", "宗密"), // 唐 宗密述
                "T1793", Kind.jinShi.of3("溫室經義記", "隋", "慧遠"), // 隋 慧遠撰
                "T1794", Kind.jinShi.of3("註四十二章經", "宋", "趙德昌"), // 宋 真宗皇帝註
                "T1795", Kind.jinShi.of3("大方廣圓覺修多羅了義經略疏", "唐", "宗密"), // 唐 宗密述
                "T1796", Kind.jinShi.of3("大毘盧遮那成佛經疏", "唐", "一行"), // 唐 一行記
                "T1797", Kind.jinShi.of3("大毘盧遮那經供養次第法疏", "唐", "不可思議"), // 唐 不可思議撰
                "T1798", Kind.jinShi.of3("金剛頂經大瑜伽祕密心地法門義訣", "唐", "不空"), // 唐 不空撰
                "T1799", Kind.jinShi.of3("首楞嚴義疏注經", "宋", "長水子璿"), // 宋 子璿集
                "T1800", Kind.jinShi.of3("請觀音經疏", "隋", "智顗", "灌頂"), // 隋 智顗說  灌頂記
                "T1801", Kind.jinShi.of3("請觀音經疏闡義鈔", "宋", "智圓"), // 宋 智圓述
                "T1802", Kind.jinShi.of3("十一面神呪心經義疏", "唐", "慧沼"), // 唐 慧沼撰
                "T1803", Kind.jinShi.of3("佛頂尊勝陀羅尼經教跡義記", "唐", "法崇"), // 唐 法崇述

                "T1804", Kind.lvShi.of3("四分律刪繁補闕行事鈔", "唐", "道宣"), // 唐 道宣撰
                "T1805", Kind.lvShi.of3("四分律行事鈔資持記", "宋", "元照"), // 宋 元照撰
                "T1806", Kind.lvShi.of3("四分律比丘含注戒本", "唐", "道宣"), // 唐 道宣述
                "T1807", Kind.lvShi.of3("四分比丘戒本疏", "唐", "定賓"), // 唐 定賓撰
                "T1808", Kind.lvShi.of3("四分律刪補隨機羯磨", "唐", "道宣"), // 唐 道宣集
                "T1809", Kind.lvShi.of3("僧羯磨", "唐", "懷素"), // 唐 懷素集
                "T1810", Kind.lvShi.of3("尼羯磨", "唐", "懷素"), // 唐 懷素集
                "T1811", Kind.lvShi.of3("菩薩戒義疏", "隋", "智顗", "灌頂"), // 隋 智顗說  灌頂記
                "T1812", Kind.lvShi.of3("天台菩薩戒疏", "唐", "明曠"), // 唐 明曠刪補
                "T1813", Kind.lvShi.of3("梵網經菩薩戒本疏", "唐", "法藏"), // 唐 法藏撰
                "T1814", Kind.lvShi.of3("菩薩戒本疏", "新羅", "義寂"), // 新羅 義寂述
                "T1815", Kind.lvShi.of3("梵網經古迹記", "新羅", "太賢"), // 新羅 太賢集

                "T1816", Kind.lun.of3("金剛般若論會釋", "唐", "窺基"), // 唐 窺基撰
                "T1817", Kind.lun.of3("略明般若末後一頌讚述", "唐", "義淨"), // 唐 義淨述
                "T1818", Kind.lun.of3("法華論疏", "隋", "吉藏"), // 隋 吉藏撰
                "T1819", Kind.lun.of3("無量壽經優婆提舍願生偈註", "北魏", "曇鸞"), // 北魏 曇鸞註解
                "T1820", Kind.lun.of3("佛遺教經論疏節要", "宋", "淨源", "袾宏"), // 宋 淨源節要  明 袾宏補註
                "T1821", Kind.lun.of3("俱舍論記", "唐", "普光"), // 唐 普光述
                "T1822", Kind.lun.of3("俱舍論疏", "唐", "法寶"), // 唐 法寶撰
                "T1823", Kind.lun.of3("俱舍論頌疏論本", "唐", "圓暉"), // 唐 圓暉述
                "T1824", Kind.lun.of3("中觀論疏", "隋", "吉藏"), // 隋 吉藏撰
                "T1825", Kind.lun.of3("十二門論疏", "隋", "吉藏"), // 隋 吉藏撰
                "T1826", Kind.lun.of3("十二門論宗致義記", "唐", "法藏"), // 唐 法藏述
                "T1827", Kind.lun.of3("百論疏", "隋", "吉藏"), // 隋 吉藏撰
                "T1828", Kind.lun.of3("瑜伽論記", "唐", "遁倫"), // 唐 遁倫集撰
                "T1829", Kind.lun.of3("瑜伽師地論略纂", "唐", "窺基"), // 唐 窺基撰
                "T1830", Kind.lun.of3("成唯識論述記", "唐", "窺基"), // 唐 窺基撰
                "T1831", Kind.lun.of3("成唯識論掌中樞要", "唐", "窺基"), // 唐 窺基撰
                "T1832", Kind.lun.of3("成唯識論了義燈", "唐", "慧沼"), // 唐 惠沼述
                "T1833", Kind.lun.of3("成唯識論演祕", "唐", "智周"), // 唐 智周撰
                "T1834", Kind.lun.of3("唯識二十論述記", "唐", "窺基"), // 唐 窺基撰
                "T1835", Kind.lun.of3("辯中邊論述記", "唐", "窺基"), // 唐 窺基撰
                "T1836", Kind.lun.of3("大乘百法明門論解", "唐", "窺基", "普泰"), // 唐 窺基註解、明 普泰增修
                "T1837", Kind.lun.of3("大乘百法明門論疏", "唐", "普光"), // 唐 大乘光撰
                "T1838", Kind.lun.of3("大乘法界無差別論疏", "唐", "法藏"), // 唐 法藏撰
                "T1839", Kind.lun.of3("理門論述記", "唐", "神泰"), // 唐 神泰撰
                "T1840", Kind.lun.of3("因明入正理論疏", "唐", "窺基"), // 唐 窺基撰
                "T1841", Kind.lun.of3("因明義斷", "唐", "慧沼"), // 唐 慧沼撰
                "T1842", Kind.lun.of3("因明入正理論義纂要", "唐", "慧沼"), // 唐 慧沼集
                "T1843", Kind.lun.of3("大乘起信論義疏", "隋", "慧遠"), // 隋 慧遠撰
                "T1844", Kind.lun.of3("起信論疏", "新羅", "元曉"), // 新羅 元曉撰
                "T1845", Kind.lun.of3("大乘起信論別記", "新羅", "元曉"), // 新羅 元曉撰
                "T1846", Kind.lun.of3("大乘起信論義記", "唐", "法藏"), // 唐 法藏撰
                "T1847", Kind.lun.of3("大乘起信論義記別記", "唐", "法藏"), // 唐 法藏撰
                "T1848", Kind.lun.of3("起信論疏筆削記", "宋", "長水子璿"), // 宋 子璿錄
                "T1849", Kind.lun.of3("大乘起信論內義略探記", "新羅", "太賢"), // 新羅 太賢作
                "T1850", Kind.lun.of3("大乘起信論裂網疏", "明", "智旭"), // 明 智旭述
                "T1851", Kind.lun.of3("大乘義章", "隋", "慧遠"), // 隋 慧遠撰
                "T1852", Kind.lun.of3("三論玄義", "隋", "吉藏"), // 隋 吉藏撰
                "T1853", Kind.lun.of3("大乘玄論", "隋", "吉藏"), // 隋 吉藏撰
                "T1854", Kind.lun.of3("二諦義", "隋", "吉藏"), // 隋 吉藏撰
                "T1855", Kind.lun.of3("三論遊意義", "隋", "碩法師"), // 隋 磧法師撰
                "T1856", Kind.lun.of3("鳩摩羅什法師大義", "東晉", "慧遠", "鳩摩羅什"), // 東晉 慧遠問．羅什答
                "T1857", Kind.lun.of3("寶藏論", "後秦", "僧肇"), // 後秦 僧肇著
                "T1858", Kind.lun.of3("肇論", "後秦", "僧肇"), // 後秦 僧肇作
                "T1859", Kind.lun.of3("肇論疏", "唐", "元康"), // 唐 元康撰
                "T1860", Kind.lun.of3("肇論新疏", "元", "文才"), // 元 文才述
                "T1861", Kind.lun.of3("大乘法苑義林章", "唐", "窺基"), // 唐 窺基撰
                "T1862", Kind.lun.of3("勸發菩提心集", "唐", "慧沼"), // 唐 慧沼撰
                "T1863", Kind.lun.of3("能顯中邊慧日論", "唐", "慧沼"), // 唐 慧沼撰
                "T1864", Kind.lun.of3("大乘入道次第", "唐", "智周"), // 唐 智周撰
                "T1865", Kind.lun.of3("八識規矩補註", "明", "普泰"), // 明 普泰補註
                "T1866", Kind.lun.of3("華嚴一乘教義分齊章", "唐", "法藏"), // 唐 法藏述
                "T1867", Kind.lun.of3("華嚴五教止觀", "隋", "法順"), // 隋 杜順說
                "T1868", Kind.lun.of3("華嚴一乘十玄門", "唐", "智儼", "法順"), // 隋 杜順說．唐 智儼撰
                "T1869", Kind.lun.of3("華嚴五十要問答", "唐", "智儼"), // 唐 智儼集
                "T1870", Kind.lun.of3("華嚴經內章門等雜孔目章", "唐", "智儼"), // 唐 智儼集
                "T1871", Kind.lun.of3("華嚴經旨歸", "唐", "法藏"), // 唐 法藏述
                "T1872", Kind.lun.of3("華嚴策林", "唐", "法藏"), // 唐 法藏述
                "T1873", Kind.lun.of3("華嚴經問答", "唐", "法藏"), // 唐 法藏撰
                "T1874", Kind.lun.of3("華嚴經明法品內立三寶章", "唐", "法藏"), // 唐 法藏述
                "T1875", Kind.lun.of3("華嚴經義海百門", "唐", "法藏"), // 唐 法藏述
                "T1876", Kind.lun.of3("修華嚴奧旨妄盡還源觀", "唐", "法藏"), // 唐 法藏述
                "T1877", Kind.lun.of3("華嚴遊心法界記", "唐", "法藏"), // 唐 法藏撰
                "T1878", Kind.lun.of3("華嚴發菩提心章", "唐", "法藏"), // 唐 法藏述
                "T1879a", Kind.lun.of3("華嚴經關脈義記", "唐", "法藏"), // 唐 法藏撰
                "T1879b", Kind.lun.of2("華嚴關脈義記"), //
                "T1880", Kind.lun.of3("金師子章雲間類解", "宋", "法藏", "淨源"), // 唐 法藏撰．宋 淨源述
                "T1881", Kind.lun.of3("華嚴經金師子章註", "宋", "法藏", "承遷"), // 唐 法藏撰．宋 承遷註
                "T1882", Kind.lun.of3("三聖圓融觀門", "唐", "澄觀"), // 唐 澄觀述
                "T1883", Kind.lun.of3("華嚴法界玄鏡", "唐", "澄觀"), // 唐 澄觀述
                "T1884", Kind.lun.of3("註華嚴法界觀門", "唐", "宗密"), // 唐 宗密註
                "T1885", Kind.lun.of3("註華嚴經題法界觀門頌", "宋", "本嵩", "琮湛"), // 宋 本嵩述．琮湛註
                "T1886", Kind.lun.of3("原人論", "唐", "宗密"), // 唐 宗密述
                "T1887A", Kind.lun.of3("華嚴一乘法界圖", "新羅", "義湘"), // 新羅 義湘撰
                "T1887B", Kind.lun.of2("法界圖記叢髓錄"), //
                "T1888", Kind.lun.of3("解迷顯智成悲十明論", "唐", "李通玄"), // 唐 李通玄撰
                "T1889", Kind.lun.of3("海印三昧論", "新羅", "明皛"), // 新羅 明皛述
                "T1890", Kind.lun.of3("華嚴一乘成佛妙義", "新羅", "見登之"), // 新羅 見登之集
                "T1891", Kind.lun.of3("文殊指南圖讚", "宋", "惟白"), // 宋 惟白述
                "T1892", Kind.lun.of3("關中創立戒壇圖經", "唐", "道宣"), // 唐 道宣撰
                "T1893", Kind.lun.of3("淨心誡觀法", "唐", "道宣"), // 唐 道宣撰
                "T1894", Kind.lun.of3("釋門章服儀", "唐", "道宣"), // 唐 道宣述
                "T1895", Kind.lun.of3("量處輕重儀", "唐", "道宣"), // 唐 道宣緝
                "T1896", Kind.lun.of3("釋門歸敬儀", "唐", "道宣"), // 唐 道宣述
                "T1897", Kind.lun.of3("教誡新學比丘行護律儀", "唐", "道宣"), // 唐 道宣述
                "T1898", Kind.lun.of3("律相感通傳", "唐", "道宣"), // 唐 道宣撰
                "T1899", Kind.lun.of3("中天竺舍衛國祇洹寺圖經", "唐", "道宣"), // 唐 道宣撰
                "T1900", Kind.lun.of3("佛制比丘六物圖", "宋", "元照"), // 宋 元照撰
                "T1901", Kind.lun.of3("護命放生軌儀法", "唐", "義淨"), // 唐 義淨撰
                "T1902", Kind.lun.of3("受用三水要行法", "唐", "義淨"), // 唐 義淨撰
                "T1903", Kind.lun.of3("說罪要行法", "唐", "義淨"), // 唐 義淨撰
                "T1904", Kind.lun.of3("根本說一切有部出家授近圓羯磨儀範", "元", "拔合思巴"), // 元 拔合思巴集
                "T1905", Kind.lun.of3("根本說一切有部苾芻習學略法", "元", "拔合思巴"), // 元 拔合思巴集
                "T1906", Kind.lun.of3("菩薩戒本宗要", "新羅", "太賢"), // 新羅 大賢撰
                "T1907", Kind.lun.of3("菩薩戒本持犯要記", "新羅", "元曉"), // 新羅 元曉述
                "T1908", Kind.lun.of3("大乘六情懺悔", "新羅", "元曉"), // 新羅 元曉撰
                "T1909", Kind.lun.of3("慈悲道場懺法", "梁", "諸大法師"), // 梁 諸大法師集撰
                "T1910", Kind.lun.of2("慈悲水懺法"), //
                "T1911", Kind.lun.of3("摩訶止觀", "隋", "智顗"), // 隋 智顗說
                "T1912", Kind.lun.of3("止觀輔行傳弘決", "唐", "湛然"), // 唐 湛然述
                "T1913", Kind.lun.of3("止觀義例", "唐", "湛然"), // 唐 湛然述
                "T1914", Kind.lun.of3("止觀大意", "唐", "湛然"), // 唐 湛然述
                "T1915", Kind.lun.of3("修習止觀坐禪法要", "隋", "智顗"), // 隋 智顗述
                "T1916", Kind.lun.of3("釋禪波羅蜜次第法門", "隋", "智顗"), // 隋 智顗說
                "T1917", Kind.lun.of3("六妙法門", "隋", "智顗"), // 隋 智顗說
                "T1918", Kind.lun.of3("四念處", "隋", "智顗"), // 隋 智顗說
                "T1919", Kind.lun.of3("天台智者大師禪門口訣", "隋", "智顗"), // 隋 智顗說
                "T1920", Kind.lun.of3("觀心論", "隋", "智顗"), // 隋 智顗述
                "T1921", Kind.lun.of3("觀心論疏", "隋", "灌頂"), // 隋 灌頂撰
                "T1922", Kind.lun.of3("釋摩訶般若波羅蜜經覺意三昧", "隋", "智顗"), // 隋 智顗說
                "T1923", Kind.lun.of3("諸法無諍三昧法門", "陳", "慧思"), // 陳 慧思撰
                "T1924", Kind.lun.of3("大乘止觀法門", "陳", "慧思"), // 陳 慧思說
                "T1925", Kind.lun.of3("法界次第初門", "隋", "智顗"), // 隋 智顗撰
                "T1926", Kind.lun.of3("法華經安樂行義", "陳", "慧思"), // 陳 慧思說
                "T1927", Kind.lun.of3("十不二門", "唐", "湛然"), // 唐 湛然述
                "T1928", Kind.lun.of3("十不二門指要鈔", "宋", "知禮"), // 宋 知禮述
                "T1929", Kind.lun.of3("四教義", "隋", "智顗"), // 隋 智顗撰
                "T1930", Kind.lun.of3("天台八教大意", "隋", "灌頂"), // 隋 灌頂撰
                "T1931", Kind.lun.of3("天台四教儀", "高麗", "諦觀"), // 高麗 諦觀錄
                "T1932", Kind.lun.of3("金剛錍", "唐", "湛然"), // 唐 湛然述
                "T1933", Kind.lun.of3("南嶽思大禪師立誓願文", "陳", "慧思"), // 陳 慧思撰
                "T1934", Kind.lun.of3("國清百錄", "隋", "灌頂"), // 隋 灌頂纂
                "T1935", Kind.lun.of3("法智遺編觀心二百問", "宋", "繼忠"), // 宋 繼忠集
                "T1936", Kind.lun.of3("四明十義書", "宋", "知禮"), // 宋 知禮撰
                "T1937", Kind.lun.of3("四明尊者教行錄", "宋", "宗曉"), // 宋 宗曉編
                "T1938", Kind.lun.of3("天台傳佛心印記", "元", "懷則"), // 元 懷則述
                "T1939", Kind.lun.of3("教觀綱宗", "明", "智旭"), // 明 智旭述
                "T1940", Kind.lun.of3("方等三昧行法", "隋", "智顗"), // 隋 智顗說
                "T1941", Kind.lun.of3("法華三昧懺儀", "隋", "智顗"), // 隋 智顗撰
                "T1942", Kind.lun.of3("法華三昧行事運想補助儀", "唐", "湛然"), // 唐 湛然撰
                "T1943", Kind.lun.of2("略法華三昧補助儀"), //
                "T1944", Kind.lun.of2("禮法華經儀式"), //
                "T1945", Kind.lun.of3("金光明懺法補助儀", "宋", "遵式"), // 宋 遵式集
                "T1946", Kind.lun.of3("金光明最勝懺儀", "宋", "知禮"), // 宋 知禮集
                "T1947", Kind.lun.of3("釋迦如來涅槃禮讚文", "宋", "仁岳"), // 宋 仁岳撰
                "T1948", Kind.lun.of3("天台智者大師齋忌禮讚文", "宋", "遵式"), // 宋 遵式述
                "T1949", Kind.lun.of3("請觀世音菩薩消伏毒害陀羅尼三昧儀", "宋", "遵式"), // 宋 遵式集
                "T1950", Kind.lun.of3("千手眼大悲心呪行法", "宋", "知禮"), // 宋 知禮集
                "T1951", Kind.lun.of3("熾盛光道場念誦儀", "宋", "遵式"), // 宋 遵式撰
                "T1952", Kind.lun.of2("觀自在菩薩如意輪呪課法"), //
                "T1953", Kind.lun.of2("菩提心義"), //
                "T1954", Kind.lun.of3("明佛法根本碑", "唐", "智慧輪"), // 唐 智慧輪述
                "T1955", Kind.lun.of3("顯密圓通成佛心要集", "遼", "道[辰*殳]"), // 遼 道[厄*殳]集
                "T1956", Kind.lun.of3("密呪圓因往生集", "夏", "智廣"), // 夏 智廣等集
                "T1957", Kind.lun.of3("略論安樂淨土義", "後魏", "曇鸞"), // 後魏 曇鸞撰
                "T1958", Kind.lun.of3("安樂集", "唐", "道綽"), // 唐 道綽撰
                "T1959", Kind.lun.of3("觀念阿彌陀佛相海三昧功德法門", "唐", "善導"), // 唐 善導集記
                "T1960", Kind.lun.of3("釋淨土群疑論", "唐", "懷感"), // 唐 懷感撰
                "T1961", Kind.lun.of3("淨土十疑論", "隋", "智顗"), // 隋 智顗說
                "T1962", Kind.lun.of3("五方便念佛門", "隋", "智顗"), // 隋 智顗撰
                "T1963", Kind.lun.of3("淨土論", "唐", "迦才"), // 唐 迦才撰
                "T1964", Kind.lun.of3("西方要決釋疑通規", "唐", "窺基"), // 唐 基撰
                "T1965", Kind.lun.of3("遊心安樂道", "新羅", "元曉"), // 新羅 元曉撰
                "T1966", Kind.lun.of3("念佛鏡", "唐", "道鏡", "善道"), // 唐 道鏡、善道共集
                "T1967", Kind.lun.of3("念佛三昧寶王論", "唐", "飛錫"), // 唐 飛錫撰
                "T1968", Kind.lun.of3("往生淨土決疑行願二門", "宋", "遵式"), // 宋 遵式撰
                "T1969A", Kind.lun.of3("樂邦文類", "宋", "宗曉"), // 宋 宗曉編
                "T1969B", Kind.lun.of3("樂邦遺稿", "宋", "宗曉"), // 宋 宗曉編
                "T1970", Kind.lun.of3("龍舒增廣淨土文", "宋", "王日休"), // 宋 王日休撰
                "T1971", Kind.lun.of3("淨土境觀要門", "元", "懷則"), // 元 懷則述
                "T1972", Kind.lun.of3("淨土或問", "元", "惟則"), // 元 天如則著
                "T1973", Kind.lun.of3("廬山蓮宗寶鑑", "元", "普度"), // 元 普度編
                "T1974", Kind.lun.of3("寶王三昧念佛直指", "明", "妙協"), // 明 妙叶集
                "T1975", Kind.lun.of3("淨土生無生論", "明", "傳燈"), // 明 傳燈撰
                "T1976", Kind.lun.of3("西方合論", "明", "袁宏道"), // 明 袁宏道撰
                "T1977", Kind.lun.of3("淨土疑辨", "明", "袾宏"), // 明 袾宏撰
                "T1978", Kind.lun.of3("讚阿彌陀佛偈", "後魏", "曇鸞"), // 後魏 曇鸞撰
                "T1979", Kind.lun.of3("轉經行道願往生淨土法事讚", "唐", "善導"), // 唐 善導集記
                "T1980", Kind.lun.of3("往生禮讚偈", "唐", "善導"), // 唐 善導集記
                "T1981", Kind.lun.of3("依觀經等明般舟三昧行道往生讚", "唐", "善導"), // 唐 善導撰
                "T1982", Kind.lun.of3("集諸經禮懺儀", "唐", "智昇"), // 唐 智昇撰
                "T1983", Kind.lun.of3("淨土五會念佛略法事儀讚", "唐", "法照"), // 唐 法照述
                "T1984", Kind.lun.of3("往生淨土懺願儀", "宋", "遵式"), // 宋 遵式撰

                "T1985", Kind.yuLu.of3("鎮州臨濟慧照禪師語錄", "唐", "慧然"), // 唐 慧然集
                "T1986A", Kind.yuLu.of3("筠州洞山悟本禪師語錄", "日本", "慧印"), // 日本 慧印校
                "T1986B", Kind.yuLu.of3("瑞州洞山良价禪師語錄", "明", "圓信", "郭凝之"), // 明 語風圓信．郭凝之編
                "T1987A", Kind.yuLu.of3("撫州曹山元證禪師語錄", "日本", "慧印"), // 日本 慧印校
                "T1987B", Kind.yuLu.of3("撫州曹山本寂禪師語錄", "日本", "玄契"), // 日本 玄契編
                "T1988", Kind.yuLu.of3("雲門匡真禪師廣錄", "宋", "守堅"), // 宋 守堅集
                "T1989", Kind.yuLu.of3("潭州溈山靈祐禪師語錄", "明", "圓信", "郭凝之"), // 明 語風圓信．郭凝之編
                "T1990", Kind.yuLu.of3("袁州仰山慧寂禪師語錄", "明", "圓信", "郭凝之"), // 明 語風圓信．郭凝之編
                "T1991", Kind.yuLu.of3("金陵清涼院文益禪師語錄", "明", "圓信", "郭凝之"), // 明 語風圓信．郭凝之編
                "T1992", Kind.yuLu.of3("汾陽無德禪師語錄", "宋", "楚圓"), // 宋 楚圓集
                "T1993", Kind.yuLu.of3("黃龍慧南禪師語錄", "宋", "九頂慧泉"), // 宋 惠泉集
                "T1994A", Kind.yuLu.of3("楊岐方會和尚語錄", "宋", "仁勇"), // 宋 仁勇等編
                "T1994B", Kind.yuLu.of2("楊岐方會和尚後錄"), //
                "T1995", Kind.yuLu.of3("法演禪師語錄", "宋", "才良"), // 宋 才良等編
                "T1996", Kind.yuLu.of3("明覺禪師語錄", "宋", "惟蓋"), // 宋 惟蓋竺編
                "T1997", Kind.yuLu.of3("圓悟佛果禪師語錄", "宋", "紹隆"), // 宋 紹隆等編
                "T1998A", Kind.yuLu.of3("大慧普覺禪師語錄", "宋", "蘊聞"), // 宋 蘊聞編
                "T1998B", Kind.yuLu.of3("大慧普覺禪師宗門武庫", "宋", "道謙"), // 宋 道謙編
                "T1999", Kind.yuLu.of3("密菴和尚語錄", "宋", "崇岳", "了悟"), // 宋 崇岳．了悟等編
                "T2000", Kind.yuLu.of3("虛堂和尚語錄", "宋", "妙源") // 宋 妙源編
        );
    }

    private static void addT2000() {
        add(
                "T2001", Kind.yuLu.of3("宏智禪師廣錄", "宋", "宗法"), // 宋 集成等編
                "T2002A", Kind.yuLu.of3("如淨和尚語錄", "宋", "文素"), // 宋 文素編
                "T2002B", Kind.yuLu.of3("天童山景德寺如淨禪師續語錄", "宋", "義遠"), // 宋 義遠編
                "T2003", Kind.yuLu.of3("佛果圜悟禪師碧巖錄", "宋", "重顯", "克勤"), // 宋 重顯頌古．克勤評唱
                "T2004", Kind.yuLu.of3("萬松老人評唱天童覺和尚頌古從容庵錄", "宋", "正覺", "行秀"), // 宋 正覺頌古．元 行秀評唱

                "T2005", Kind.lun.of3("無門關", "宋", "宗紹"), // 宋 宗紹編
                "T2006", Kind.lun.of3("人天眼目", "宋", "智昭"), // 宋 智昭集
                "T2007", Kind.lun.of3("南宗頓教最上大乘摩訶般若波羅蜜經六祖惠能大師於韶州大梵寺施法壇經", "唐", "法海"), // 唐 法海集
                "T2008", Kind.lun.of3("六祖大師法寶壇經", "元", "宗寶"), // 元 宗寶編
                "T2009", Kind.lun.of2("少室六門"), //
                "T2010", Kind.lun.of3("信心銘", "隋", "鑑智僧璨"), // 隋 僧璨作
                "T2011", Kind.lun.of3("最上乘論", "唐", "弘忍"), // 唐 弘忍述
                "T2012A", Kind.lun.of3("黃檗山斷際禪師傳心法要", "唐", "裴休"), // 唐 裴休集
                "T2012B", Kind.lun.of3("黃檗斷際禪師宛陵錄", "唐", "裴休"), // 唐 裴休集
                "T2013", Kind.lun.of3("禪宗永嘉集", "唐", "永嘉玄覺"), // 唐 玄覺撰
                "T2014", Kind.lun.of3("永嘉證道歌", "唐", "永嘉玄覺"), // 唐 玄覺撰
                "T2015", Kind.lun.of3("禪源諸詮集都序", "唐", "宗密"), // 唐 宗密述
                "T2016", Kind.lun.of3("宗鏡錄", "宋", "延壽"), // 宋 延壽集
                "T2017", Kind.lun.of3("萬善同歸集", "宋", "延壽"), // 宋 延壽述
                "T2018", Kind.lun.of3("永明智覺禪師唯心訣", "宋", "延壽"), // 宋 延壽撰
                "T2019A", Kind.lun.of3("真心直說", "高麗", "普照"), // 高麗 知訥撰
                "T2019B", Kind.lun.of3("誡初心學人文", "高麗", "普照"), // 高麗 知訥撰
                "T2020", Kind.lun.of3("高麗國普照禪師修心訣", "高麗", "普照"), // 高麗 知訥撰
                "T2021", Kind.lun.of3("禪宗決疑集", "元", "智徹"), // 元 智徹述
                "T2022", Kind.lun.of3("禪林寶訓", "宋", "淨善"), // 宋 淨善重集
                "T2023", Kind.lun.of3("緇門警訓", "明", "如巹"), // 明 如巹續集
                "T2024", Kind.lun.of3("禪關策進", "明", "袾宏"), // 明 袾宏輯
                "T2025", Kind.lun.of3("勅修百丈清規", "元", "德輝"), // 元 德煇重編
                "T2026", Kind.lun.of2("撰集三藏及雜藏傳", "失譯"), // 失譯

                "T2027", Kind.jin.of3("迦葉結經", "東漢", "安清"), // 後漢 安世高譯
                "T2028", Kind.jin.of2("迦丁比丘說當來變經", "失譯"), // 失譯
                "T2029", Kind.jin.of2("佛使比丘迦旃延說法沒盡偈百二十章", "失譯"), // 失譯
                
                "T2030", Kind.lun.of3("大阿羅漢難提蜜多羅所說法住記", "唐", "玄奘"), // 唐 玄奘譯
                "T2031", Kind.lun.of3("異部宗輪論", "唐", "玄奘", "世友"), // 世友菩薩造  唐 玄奘譯
                "T2032", Kind.lun.of3("十八部論", "陳", "真諦"), // 陳 真諦譯
                "T2033", Kind.lun.of3("部執異論", "陳", "真諦", "天友"), // 天友菩薩造  陳 真諦譯

                "T2034", Kind.zhuanJi.of3("歷代三寶紀", "隋", "費長房"), // 隋 費長房撰
                "T2035", Kind.zhuanJi.of3("佛祖統紀", "宋", "志磐"), // 宋 志磐撰
                "T2036", Kind.zhuanJi.of3("佛祖歷代通載", "元", "念常"), // 元 念常集
                "T2037", Kind.zhuanJi.of3("釋氏稽古略", "元", "覺岸"), // 元 覺岸編
                "T2038", Kind.zhuanJi.of3("釋鑑稽古略續集", "明", "幻輪"), // 明 幻輪編
                "T2039", Kind.zhuanJi.of3("三國遺事", "高麗", "一然"), // 高麗 一然撰
                "T2040", Kind.zhuanJi.of3("釋迦譜", "梁", "僧祐"), // 梁 僧祐撰
                "T2041", Kind.zhuanJi.of3("釋迦氏譜", "唐", "道宣"), // 唐 道宣撰
                "T2042", Kind.zhuanJi.of3("阿育王傳", "西晉", "安法欽"), // 西晉 安法欽譯

                "T2043", Kind.jin.of3("阿育王經", "梁", "僧伽婆羅"), // 梁 僧伽婆羅譯
                "T2044", Kind.jin.of2("天尊說阿育王譬喻經", "失譯"), // 失譯
                "T2045", Kind.jin.of3("阿育王息壞目因緣經", "符秦", "曇摩難提"), // 符秦 曇摩難提譯

                "T2046", Kind.zhuanJi.of3("馬鳴菩薩傳", "後秦", "鳩摩羅什"), // 後秦 鳩摩羅什譯
                "T2047a", Kind.zhuanJi.of3("龍樹菩薩傳", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯
                "T2047b", Kind.zhuanJi.of3("龍樹菩薩傳", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯
                "T2048", Kind.zhuanJi.of3("提婆菩薩傳", "姚秦", "鳩摩羅什"), // 姚秦 鳩摩羅什譯
                "T2049", Kind.zhuanJi.of3("婆藪槃豆法師傳", "陳", "真諦"), // 陳 真諦譯
                "T2050", Kind.zhuanJi.of3("隋天台智者大師別傳", "隋", "灌頂"), // 隋 灌頂撰
                "T2051", Kind.zhuanJi.of3("唐護法沙門法琳別傳", "唐", "彥悰"), // 唐 彥琮撰
                "T2052", Kind.zhuanJi.of3("大唐故三藏玄奘法師行狀", "唐", "冥詳"), // 唐 冥詳撰
                "T2053", Kind.zhuanJi.of3("大唐大慈恩寺三藏法師傳", "唐", "慧立", "彥悰"), // 唐 慧立本、彥悰箋
                "T2054", Kind.zhuanJi.of3("唐大薦福寺故寺主翻經大德法藏和尚傳", "新羅", "崔致遠"), // 新羅 崔致遠撰
                "T2055", Kind.zhuanJi.of3("玄宗朝翻經三藏善無畏贈鴻臚卿行狀", "唐", "李華"), // 唐 李華撰
                "T2056", Kind.zhuanJi.of3("大唐故大德贈司空大辨正廣智不空三藏行狀", "唐", "趙遷"), // 唐 趙遷撰
                "T2057", Kind.zhuanJi.of2("大唐青龍寺三朝供奉大德行狀"), //
                "T2058", Kind.zhuanJi.of3("付法藏因緣傳", "元魏", "吉迦夜", "曇曜"), // 元魏 吉迦夜共曇曜譯
                "T2059", Kind.zhuanJi.of3("高僧傳", "梁", "慧皎"), // 梁 慧皎撰
                "T2060", Kind.zhuanJi.of3("續高僧傳", "唐", "道宣"), // 唐 道宣撰
                "T2061", Kind.zhuanJi.of3("宋高僧傳", "宋", "贊寧"), // 宋 贊寧等撰
                "T2062", Kind.zhuanJi.of3("大明高僧傳", "明", "如惺"), // 明 如惺撰
                "T2063", Kind.zhuanJi.of3("比丘尼傳", "梁", "寶唱"), // 梁 寶唱撰
                "T2064", Kind.zhuanJi.of2("神僧傳"), //
                "T2065", Kind.zhuanJi.of3("海東高僧傳", "高麗", "覺訓"), // 高麗 覺訓撰
                "T2066", Kind.zhuanJi.of3("大唐西域求法高僧傳", "唐", "義淨"), // 唐 義淨撰
                "T2067", Kind.zhuanJi.of3("弘贊法華傳", "唐", "慧詳"), // 唐 惠詳撰
                "T2068", Kind.zhuanJi.of3("法華傳記", "唐", "僧祥"), // 唐 僧詳撰
                "T2069", Kind.zhuanJi.of3("天台九祖傳", "宋", "士衡"), // 宋 士衡編
                "T2070", Kind.zhuanJi.of2("往生西方淨土瑞應傳"), //
                "T2071", Kind.zhuanJi.of3("淨土往生傳", "宋", "戒珠"), // 宋 戒珠敘
                "T2072", Kind.zhuanJi.of3("往生集", "明", "袾宏"), // 明 袾宏輯
                "T2073", Kind.zhuanJi.of3("華嚴經傳記", "唐", "法藏"), // 唐 法藏集
                "T2074", Kind.zhuanJi.of3("大方廣佛華嚴經感應傳", "唐", "慧英", "胡幽貞"), // 唐 惠英撰．胡幽貞纂
                "T2075", Kind.zhuanJi.of2("曆代法寶記"), //
                "T2076", Kind.zhuanJi.of3("景德傳燈錄", "宋", "道原"), // 宋 道原纂
                "T2077", Kind.zhuanJi.of3("續傳燈錄", "明", "居頂"), // 明 居頂輯
                "T2078", Kind.zhuanJi.of3("傳法正宗記", "宋", "契嵩"), // 宋 契嵩編
                "T2079", Kind.zhuanJi.of3("傳法正宗定祖圖", "宋", "契嵩"), // 宋 契嵩撰

                "T2080", Kind.lun.of3("傳法正宗論", "宋", "契嵩"), // 宋 契嵩編

                "T2081", Kind.zhuanJi.of3("兩部大法相承師資付法記", "唐", "海雲"), // 唐 海雲記
                "T2082", Kind.zhuanJi.of3("冥報記", "唐", "唐臨"), // 唐 唐臨撰
                "T2083", Kind.zhuanJi.of3("釋門自鏡錄", "唐", "懷信"), // 唐 懷信述
                "T2084", Kind.zhuanJi.of3("三寶感應要略錄", "宋", "非濁"), // 宋 非濁集
                "T2085", Kind.zhuanJi.of3("高僧法顯傳", "東晉", "法顯"), // 東晉 法顯記
                "T2086", Kind.zhuanJi.of2("北魏僧惠生使西域記"), //
                "T2087", Kind.zhuanJi.of3("大唐西域記", "唐", "玄奘", "辯機"), // 唐 玄奘譯、辯機撰
                "T2088", Kind.zhuanJi.of3("釋迦方志", "唐", "道宣"), // 唐 道宣撰
                "T2089", Kind.zhuanJi.of3("遊方記抄", "新羅", "慧超", "圓照"), // 新羅慧超唐圓照等撰
                "T2090", Kind.zhuanJi.of3("釋迦牟尼如來像法滅盡之記", "唐", "法成"), // 唐 法成譯
                "T2091", Kind.zhuanJi.of2("燉煌錄"), //
                "T2092", Kind.zhuanJi.of3("洛陽伽藍記", "東魏", "楊衒之"), // 元魏 楊衒之撰
                "T2093", Kind.zhuanJi.of3("寺塔記", "唐", "段成式"), // 唐 段成式撰
                "T2094", Kind.zhuanJi.of2("梁京寺記"), //
                "T2095", Kind.zhuanJi.of3("廬山記", "宋", "陳舜俞"), // 宋 陳舜俞撰
                "T2096", Kind.zhuanJi.of3("天台山記", "唐", "徐靈府"), // 唐 徐靈府撰
                "T2097", Kind.zhuanJi.of3("南嶽總勝集", "宋", "陳田夫"), // 宋 陳田夫撰
                "T2098", Kind.zhuanJi.of3("古清涼傳", "唐", "慧祥"), // 唐 慧祥撰
                "T2099", Kind.zhuanJi.of3("廣清涼傳", "宋", "延一"), // 宋 延一編
                "T2100", Kind.zhuanJi.of3("續清涼傳", "宋", "張商英"), // 宋 張商英述
                "T2101", Kind.zhuanJi.of3("補陀洛迦山傳", "元", "盛熙明"), // 元 盛熙明述
                "T2102", Kind.zhuanJi.of3("弘明集", "梁", "僧祐"), // 梁 僧祐撰
                "T2103", Kind.zhuanJi.of3("廣弘明集", "唐", "道宣"), // 唐 道宣撰
                "T2104", Kind.zhuanJi.of3("集古今佛道論衡", "唐", "道宣"), // 唐 道宣撰
                "T2105", Kind.zhuanJi.of3("續集古今佛道論衡", "唐", "智昇"), // 唐 智昇撰

                "T2106", Kind.zhuanJi.of3("集神州三寶感通錄", "唐", "道宣"), // 唐 道宣撰
                "T2107", Kind.zhuanJi.of3("道宣律師感通錄", "唐", "道宣"), // 唐 道宣撰

                "T2108", Kind.lun.of3("集沙門不應拜俗等事", "唐", "彥悰"), // 唐 彥悰纂錄
                "T2109", Kind.lun.of3("破邪論", "唐", "法琳"), // 唐 法琳撰
                "T2110", Kind.lun.of3("辯正論", "唐", "法琳"), // 唐 法琳撰
                "T2111", Kind.lun.of3("十門辯惑論", "唐", "復禮"), // 唐 復禮撰
                "T2112", Kind.lun.of3("甄正論", "唐", "玄嶷"), // 唐 玄嶷撰
                "T2113", Kind.lun.of3("北山錄", "唐", "神清", "慧寶"), // 唐 神清撰．慧寶注
                "T2114", Kind.lun.of3("護法論", "宋", "張商英"), // 宋 張商英述
                "T2115", Kind.lun.of3("鐔津文集", "宋", "契嵩"), // 宋 契嵩撰
                "T2116", Kind.lun.of3("辯偽錄", "元", "祥邁"), // 元 祥邁撰
                "T2117", Kind.lun.of3("三教平心論", "元", "劉謐"), // 元 劉謐撰
                "T2118", Kind.lun.of2("折疑論", "師子"), // 師子比丘述註
                "T2119", Kind.lun.of2("寺沙門玄奘上表記"), //
                "T2120", Kind.lun.of3("代宗朝贈司空大辨正廣智三藏和上表制集", "唐", "圓照"), // 唐 圓照集
                "T2121", Kind.lun.of3("經律異相", "梁", "寶唱"), // 梁 寶唱等集
                "T2122", Kind.lun.of3("法苑珠林", "唐", "道世"), // 唐 道世撰
                "T2123", Kind.lun.of3("諸經要集", "唐", "道世"), // 唐 道世集
                "T2124", Kind.lun.of3("法門名義集", "唐", "李師政"), // 唐 李師政撰
                "T2125", Kind.lun.of3("南海寄歸內法傳", "唐", "義淨"), // 唐 義淨撰
                "T2126", Kind.lun.of3("大宋僧史略", "宋", "贊寧"), // 宋 贊寧撰
                "T2127", Kind.lun.of3("釋氏要覽", "宋", "道誠"), // 宋 道誠集

                "T2128", Kind.yinYi.of3("一切經音義", "唐", "慧琳"), // 唐 慧琳撰
                "T2129", Kind.yinYi.of3("續一切經音義", "宋", "希麟"), // 宋 希麟集
                "T2130", Kind.yinYi.of2("翻梵語"), //
                "T2131", Kind.yinYi.of3("翻譯名義集", "宋", "法雲"), // 宋 法雲編
                "T2132", Kind.yinYi.of3("悉曇字記", "唐", "智廣"), // 唐 智廣撰
                "T2133A", Kind.yinYi.of3("梵語千字文", "唐", "義淨"), // 唐 義淨撰
                "T2133B", Kind.yinYi.of3("梵語千字文", "唐", "義淨"), // 唐 義淨撰
                "T2134", Kind.yinYi.of3("唐梵文字", "唐", "全真"), // 唐 全真集
                "T2135", Kind.yinYi.of3("梵語雜名", "唐", "禮言"), // 唐 禮言集
                "T2136", Kind.yinYi.of3("唐梵兩語雙對集", "唐", "僧怛多櫱多", "波羅瞿那彌捨沙"), // 唐 僧怛多蘖多．波羅瞿那彌捨沙集

                "T2137", Kind.lun.of3("金七十論", "陳", "真諦"), // 陳 真諦譯
                "T2138", Kind.lun.of3("勝宗十句義論", "唐", "玄奘", "慧月"), // 慧月造  唐 玄奘譯
                "T2139", Kind.lun.of2("老子化胡經"), //
                "T2140", Kind.lun.of2("摩尼教下部讚"), //
                "T2141A", Kind.lun.of3("摩尼光佛教法儀略", "唐", "拂多誕"), // 唐 拂多誕譯
                "T2141B", Kind.lun.of2("波斯教殘經"), //
                "T2142", Kind.lun.of2("序聽迷詩所經"), //
                "T2143", Kind.lun.of2("景教三威蒙度讚"), //
                "T2144", Kind.lun.of3("大秦景教流行中國碑頌", "唐", "景淨"), // 唐 景淨述
                "T2145", Kind.lun.of3("出三藏記集", "梁", "僧祐"), // 梁 僧祐撰

                "T2146", Kind.muLu.of3("眾經目錄", "隋", "法經"), // 隋 法經等撰
                "T2147", Kind.muLu.of3("眾經目錄", "隋", "彥琮"), // 隋 彥琮撰
                "T2148", Kind.muLu.of3("眾經目錄", "唐", "靜泰"), // 唐 靜泰撰
                "T2149", Kind.muLu.of3("大唐內典錄", "唐", "道宣"), // 唐 道宣撰
                "T2150", Kind.muLu.of3("續大唐內典錄", "唐", "道宣"), // 唐 道宣撰
                "T2151", Kind.muLu.of3("古今譯經圖紀", "唐", "釋靖邁"), // 唐 靖邁撰
                "T2152", Kind.muLu.of3("續古今譯經圖紀", "唐", "智昇"), // 唐 智昇撰
                "T2153", Kind.muLu.of3("大周刊定眾經目錄", "唐", "明佺"), // 唐 明佺等撰
                "T2154", Kind.muLu.of3("開元釋教錄", "唐", "智昇"), // 唐 智昇撰
                "T2155", Kind.muLu.of3("開元釋教錄略出", "唐", "智昇"), // 唐 智昇撰
                "T2156", Kind.muLu.of3("大唐貞元續開元釋教錄", "唐", "圓照"), // 唐 圓照集
                "T2157", Kind.muLu.of3("貞元新定釋教目錄", "唐", "圓照"), // 唐 圓照撰
                "T2158", Kind.muLu.of3("續貞元釋教錄", "南唐", "恆安"), // 南唐 恒安集
                "T2159", Kind.muLu.of3("傳教大師將來台州錄", "日本", "最澄"), // 日本 最澄撰
                "T2160", Kind.muLu.of3("傳教大師將來越州錄", "日本", "最澄"), // 日本 最澄撰
                "T2161", Kind.muLu.of3("御請來目錄", "日本", "空海"), // 日本 空海撰
                "T2162", Kind.muLu.of2("根本大和尚真跡策子等目錄"), //
                "T2163", Kind.muLu.of3("常曉和尚請來目錄", "日本", "常曉"), // 日本 常曉撰
                "T2164", Kind.muLu.of3("靈巖寺和尚請來法門道具等目錄", "日本", "圓行"), // 日本 圓行撰
                "T2165", Kind.muLu.of3("日本國承和五年入唐求法目錄", "日本", "圓仁"), // 日本 圓仁撰
                "T2166", Kind.muLu.of3("慈覺大師在唐送進錄", "日本", "圓仁"), // 日本 圓仁撰
                "T2167", Kind.muLu.of3("入唐新求聖教目錄", "日本", "圓仁"), // 日本 圓仁撰
                "T2168A", Kind.muLu.of3("惠運禪師將來教法目錄", "日本", "慧運"), // 日本 惠運撰
                "T2168B", Kind.muLu.of3("惠運律師書目錄", "日本", "慧運"), // 日本 惠運撰
                "T2169", Kind.muLu.of3("開元寺求得經疏記等目錄", "日本", "圓珍"), // 日本 圓珍撰
                "T2170", Kind.muLu.of3("福州溫州台州求得經律論疏記外書等目錄", "日本", "圓珍"), // 日本 圓珍撰
                "T2171", Kind.muLu.of3("青龍寺求法目錄", "日本", "圓珍"), // 日本 圓珍撰
                "T2172", Kind.muLu.of3("日本比丘圓珍入唐求法目錄", "日本", "圓珍"), // 日本 圓珍撰
                "T2173", Kind.muLu.of3("智證大師請來目錄", "日本", "圓珍"), // 日本 圓珍撰
                "T2174A", Kind.muLu.of3("新書寫請來法門等目錄", "日本", "宗叡"), // 日本 宗叡撰
                "T2174B", Kind.muLu.of2("禪林寺宗叡僧正目錄"), //
                "T2175", Kind.muLu.of2("錄外經等目錄"), //
                "T2176", Kind.muLu.of3("諸阿闍梨真言密教部類總錄", "日本", "安然"), // 日本 安然集
                "T2177", Kind.muLu.of3("華嚴宗章疏并因明錄", "日本", "圓超"), // 日本 圓超錄
                "T2178", Kind.muLu.of3("天台宗章疏", "日本", "玄日"), // 日本 玄日錄
                "T2179", Kind.muLu.of3("三論宗章疏", "日本", "安遠"), // 日本 安遠錄
                "T2180", Kind.muLu.of3("法相宗章疏", "日本", "平祚"), // 日本 平祚錄
                "T2181", Kind.muLu.of3("注進法相宗章疏", "日本", "藏俊"), // 日本 藏俊撰
                "T2182", Kind.muLu.of3("律宗章疏", "日本", "榮穩"), // 日本 榮穩錄
                "T2183", Kind.muLu.of3("東域傳燈目錄", "日本", "永超"), // 日本 永超集
                "T2184", Kind.muLu.of3("新編諸宗教藏總錄", "高麗", "義天"), // 高麗 義天錄

                "T2732", Kind.jinShi.of2("梁朝傅大士頌金剛經"), //
                "T2733", Kind.jinShi.of3("御注金剛般若波羅蜜經宣演", "唐", "道氤"), // 唐 道氤撰
                "T2734", Kind.jinShi.of3("金剛暎卷上", "唐", "寶達"), // 唐 寶達集
                "T2735", Kind.jinShi.of3("金剛般若經旨贊", "唐", "曇曠"), // 唐 曇曠撰
                "T2736", Kind.jinShi.of3("金剛般若經依天親菩薩論贊略釋秦本義記卷上", "唐", "知恩"), // 唐 知恩撰
                "T2737", Kind.jinShi.of2("金剛經疏"), //
                "T2738", Kind.jinShi.of2("金剛經疏"), //
                "T2739", Kind.jinShi.of2("金剛般若經挾註"), //
                "T2740", Kind.jinShi.of2("金剛般若義記"), //
                "T2741", Kind.jinShi.of2("金剛般若經疏"), //

                "T2742", Kind.lun.of2("金剛般若波羅蜜經傳外傳卷下"), //
                "T2743", Kind.lun.of2("持誦金剛經靈驗功德記"), //
                "T2744", Kind.lun.of2("仁王般若實相論卷第二"), //

                "T2745", Kind.jinShi.of2("仁王經疏"), //
                "T2746", Kind.jinShi.of2("般若波羅蜜多心經還源述"), //
                "T2747", Kind.jinShi.of2("挾註波羅蜜多心經"), //
                "T2748", Kind.jinShi.of2("法華義記卷第三"), //
                "T2749", Kind.jinShi.of2("法華經疏"), //
                "T2750", Kind.jinShi.of2("法華經疏"), //
                "T2751", Kind.jinShi.of2("法華經疏"), //
                "T2752", Kind.jinShi.of2("法華問答"), //
                "T2753", Kind.jinShi.of2("華嚴經章"), //
                "T2754", Kind.jinShi.of2("華嚴略疏卷第三"), //
                "T2755", Kind.jinShi.of2("華嚴經疏"), //
                "T2756", Kind.jinShi.of3("華嚴經義記卷第一", "後魏", "慧光"), // 後魏 慧光撰
                "T2757", Kind.jinShi.of3("華嚴經疏卷第三", "新羅", "元曉"), // 新羅 元曉撰
                "T2758", Kind.jinShi.of2("十地義記卷第一"), //
                "T2759", Kind.jinShi.of2("無量壽經義記卷下"), //
                "T2760", Kind.jinShi.of2("無量壽觀經義記"), //
                "T2761", Kind.jinShi.of2("勝鬘經記"), //
                "T2762", Kind.jinShi.of2("勝鬘經疏", "昭法師"), // 昭法師撰
                "T2763", Kind.jinShi.of2("挾注勝鬘經"), //
                "T2764A", Kind.jinShi.of2("涅槃經義記"), //
                "T2764B", Kind.jinShi.of2("大涅槃經義記卷第四"), //
                "T2765", Kind.jinShi.of2("涅槃經疏"), //
                "T2766", Kind.jinShi.of2("藥師經疏"), //
                "T2767", Kind.jinShi.of2("藥師經疏"), //
                "T2768", Kind.jinShi.of2("維摩義記"), //
                "T2769", Kind.jinShi.of2("維摩經義記卷第四"), //
                "T2770", Kind.jinShi.of2("維摩經疏"), //
                "T2771", Kind.jinShi.of2("維摩經疏"), //
                "T2772", Kind.jinShi.of2("維摩經疏卷第三．第六"), //
                "T2773", Kind.jinShi.of2("維摩經抄"), //
                "T2774", Kind.jinShi.of2("維摩經疏"), //
                "T2775", Kind.jinShi.of2("維摩疏釋前小序抄"), //
                "T2776", Kind.jinShi.of3("釋肇序", "唐", "體請"), // 唐 體請記
                "T2777", Kind.jinShi.of3("淨名經集解關中疏", "唐", "道液"), // 唐 道掖撰
                "T2778", Kind.jinShi.of3("淨名經關中釋抄", "唐", "道液"), // 唐 道掖撰
                "T2779", Kind.jinShi.of2("佛說楞伽經禪門悉談章"), //
                "T2780", Kind.jinShi.of3("溫室經疏", "唐", "慧淨"), // 唐 慧淨撰
                "T2781", Kind.jinShi.of3("盂蘭盆經讚述", "唐", "慧淨"), // 唐 慧淨撰
                "T2782", Kind.jinShi.of3("大乘稻芉經隨聽疏", "唐", "法成"), // 唐 法成撰
                "T2783", Kind.jinShi.of2("大乘稻芉經隨聽疏決"), //
                "T2784", Kind.jinShi.of2("大乘四法經釋抄"), //
                "T2785", Kind.jinShi.of2("大乘四法經論廣釋開決記"), //
                "T2786", Kind.jinShi.of2("天請問經疏"), //

                "T2787", Kind.lvShi.of2("四分戒本疏卷第一．第二．第三"), //
                "T2788", Kind.lvShi.of2("律戒本疏"), //
                "T2789", Kind.lvShi.of2("律戒本疏"), //
                "T2790", Kind.lvShi.of2("律雜抄"), //
                "T2791", Kind.lvShi.of2("宗四分比丘隨門要略行儀"), //
                "T2792", Kind.lvShi.of2("毘尼心"), //
                "T2793", Kind.lvShi.of2("三部律抄"), //
                "T2794", Kind.lvShi.of2("律抄"), //
                "T2795", Kind.lvShi.of2("四部律并論要用抄"), //
                "T2796", Kind.lvShi.of2("律抄第三卷手決"), //
                "T2797", Kind.lvShi.of2("梵網經述記卷第一"), //

                "T2798", Kind.jinShi.of2("本業瓔珞經疏"), //

                "T2799", Kind.lun.of3("十地論義疏卷第一．第三", "北周", "法上"), // 北周 法上撰
                "T2800", Kind.lun.of3("廣百論疏卷第一", "唐", "文軌"), // 唐 文軌撰
                "T2801", Kind.lun.of3("瑜伽師地論分門記", "唐", "法成", "智慧山"), // 唐 法成撰．智慧山記
                "T2802", Kind.lun.of3("瑜伽論手記", "唐", "法成", "福慧"), // 唐 法成述．福慧記
                "T2803", Kind.lun.of2("地持義記卷第四"), //
                "T2804", Kind.lun.of2("唯識三十論要釋"), //
                "T2805", Kind.lun.of2("攝大乘講疏卷第五．第七"), //
                "T2806", Kind.lun.of2("攝大乘論抄"), //
                "T2807", Kind.lun.of2("攝大乘論章卷第一"), //
                "T2808", Kind.lun.of2("攝論章卷第一"), //
                "T2809", Kind.lun.of2("攝大乘義章卷第四"), //
                "T2810", Kind.lun.of3("大乘百法明門論開宗義記", "唐", "曇曠"), // 唐 曇曠撰
                "T2811", Kind.lun.of2("大乘百法明門論開宗義記序釋"), //
                "T2812", Kind.lun.of3("大乘百法明門論開宗義決", "唐", "曇曠"), // 唐 曇曠撰
                "T2813", Kind.lun.of3("大乘起信論略述", "唐", "曇曠"), // 唐 曇曠撰
                "T2814", Kind.lun.of3("大乘起信論廣釋卷第三．四．五", "唐", "曇曠"), // 唐 曇曠撰
                "T2815", Kind.lun.of2("起信論註"), //
                "T2816", Kind.lun.of2("因緣心釋論開決記"), //
                "T2817", Kind.lun.of2("大乘經纂要義"), //
                "T2818", Kind.lun.of2("大乘二十二問本"), //
                "T2819", Kind.lun.of2("諸經要抄"), //
                "T2820", Kind.lun.of2("菩薩藏修道眾經抄卷第十二"), //
                "T2821", Kind.lun.of2("諸經要略文"), //
                "T2822", Kind.lun.of2("大乘要語"), //
                "T2823", Kind.lun.of3("大乘入道次第開決", "唐", "曇曠"), // 唐 曇曠撰
                "T2824", Kind.lun.of2("天台分門圖"), //
                "T2825", Kind.lun.of2("真言要決卷第一．第三"), //
                "T2826", Kind.lun.of3("略諸經論念佛法門往生淨土集卷上", "唐", "慧日"), // 唐 慧日撰
                "T2827", Kind.lun.of3("淨土五會念佛誦經觀行儀卷中．下", "唐", "法照"), // 唐 法照撰
                "T2828", Kind.lun.of2("大乘淨土讚"), //
                "T2829", Kind.lun.of2("持齋念佛懺悔禮文"), //
                "T2830A", Kind.lun.of2("道安法師念佛讚"), //
                "T2830B", Kind.lun.of2("道安法師念佛讚文"), //
                "T2831", Kind.lun.of2("無心論"), //
                "T2832", Kind.lun.of2("南天竺國菩提達摩禪師觀門"), //
                "T2833", Kind.lun.of2("觀心論"), //
                "T2834", Kind.lun.of2("大乘無生方便門"), //
                "T2835", Kind.lun.of3("大乘開心顯性頓悟真宗論", "唐", "慧光"), // 唐 慧光釋
                "T2836", Kind.lun.of3("大乘北宗論", "唐", "慧光"), // 唐 慧光釋
                "T2837", Kind.lun.of2("楞伽師資記", "唐", "淨覺"), // 唐 淨覺集
                "T2838", Kind.lun.of2("傳法寶紀", "唐", "杜朏"), // 唐 杜朏撰
                "T2839", Kind.lun.of2("讚禪門詩"), //
                "T2840", Kind.lun.of2("三界圖"), //
                "T2841", Kind.lun.of2("大佛略懺"), //
                "T2842", Kind.lun.of2("印沙佛文"), //
                "T2843", Kind.lun.of2("大悲啟請"), //
                "T2844", Kind.lun.of2("文殊師利菩薩無相十禮"), //
                "T2845", Kind.lun.of2("押座文類"), //
                "T2846", Kind.lun.of2("祈願文"), //
                "T2847", Kind.lun.of2("祈願文"), //
                "T2848", Kind.lun.of2("迴向文"), //
                "T2849", Kind.lun.of2("大乘四齋日"), //
                "T2850", Kind.lun.of2("地藏菩薩十齋日"), //
                "T2851", Kind.lun.of2("和菩薩戒文"), //
                "T2852", Kind.lun.of2("入布薩堂說偈文等"), //
                "T2853", Kind.lun.of2("布薩文等"), //
                "T2854", Kind.lun.of2("禮懺文"), //
                "T2855", Kind.lun.of2("禮懺文"), //
                "T2856", Kind.lun.of2("禮懺文"), //
                "T2857", Kind.lun.of2("索法號義辯諷誦文"), //
                "T2858", Kind.lun.of2("大目乾連冥間救母變文并圖"), //
                "T2859", Kind.lun.of2("惠遠外傳"), //
                "T2860", Kind.lun.of2("府君存惠傳"), //
                "T2861", Kind.lun.of2("泉州千佛新著諸祖師頌"), //
                "T2862", Kind.lun.of2("大蕃沙洲釋門教法和尚洪辯修功德記"), //
                "T2863", Kind.lun.of2("王梵志詩集"), //
                "T2864", Kind.lun.of2("進旨"), //

                "T2865", Kind.jin.of2("護身命經", "道真"), // 界　比丘道真
                "T2866", Kind.jin.of2("護身命經"), //
                "T2867", Kind.jin.of2("慈仁問八十種好經"), //
                "T2868", Kind.jin.of2("決罪福經"), //
                "T2869", Kind.jin.of2("妙好寶車經"), //
                "T2870", Kind.jin.of2("像法決疑經"), //
                "T2871", Kind.jin.of2("大通方廣懺悔滅罪莊嚴成佛經"), //
                "T2872", Kind.jin.of2("妙法蓮華經度量天地品第二十九"), //
                "T2873", Kind.jin.of2("首羅比丘經"), //
                "T2874", Kind.jin.of2("小法滅盡經"), //
                "T2875", Kind.jin.of2("大方廣華嚴十惡品經"), //
                "T2876", Kind.jin.of2("天公經"), //
                "T2877", Kind.jin.of2("如來在金棺囑累清淨莊嚴敬福經"), //
                "T2878", Kind.jin.of2("救疾經"), //
                "T2879", Kind.jin.of2("普賢菩薩說證明經"), //
                "T2880", Kind.jin.of2("究竟大悲經卷第二．三．四"), //
                "T2881", Kind.jin.of2("善惡因果經"), //
                "T2882", Kind.jin.of2("呪魅經"), //
                "T2883", Kind.jin.of2("法王經"), //
                "T2884", Kind.jin.of2("大威儀請問"), //
                "T2885", Kind.jin.of2("佛性海藏智慧解脫破心相經"), //
                "T2886", Kind.jin.of2("佛為心王菩薩說投陀經卷上", "惠辨"), // 五陰山室寺惠辨禪師註
                "T2887", Kind.jin.of2("父母恩重經"), //
                "T2888", Kind.jin.of2("延壽命經"), //
                "T2889", Kind.jin.of2("續命經"), //
                "T2890", Kind.jin.of2("如來成道經"), //
                "T2891", Kind.jin.of2("山海慧菩薩經"), //
                "T2892", Kind.jin.of2("現報當受經"), //
                "T2893", Kind.jin.of2("大辯邪正經"), //
                "T2894", Kind.jin.of2("三廚經", "菩提達磨", "闍那崛多"), // 西國婆羅門達多羅及闍那崛多等奉詔譯
                "T2895", Kind.jin.of2("要行捨身經"), //
                "T2896", Kind.jin.of2("示所犯者瑜伽法鏡經"), //
                "T2897", Kind.jin.of3("天地八陽神呪經", "唐", "義淨"), // 唐 三藏法師義淨奉詔譯
                "T2898", Kind.jin.of2("高王觀世音經"), //
                "T2899", Kind.jin.of2("妙法蓮華經馬明菩薩品第三十"), //
                "T2900", Kind.jin.of2("齋法清淨經"), //
                "T2901", Kind.jin.of2("法句經"), //

                "T2902", Kind.jinShi.of2("法句經疏"), //

                "T2903", Kind.jin.of2("無量大慈教經"), //
                "T2904", Kind.jin.of2("七千佛神符經"), //
                "T2905", Kind.jin.of2("現在十方千五百佛名並雜佛同號"), //
                "T2906", Kind.jin.of2("三萬佛同根本神祕之印並法龍種上尊王佛法"), //
                "T2907", Kind.jin.of2("普賢菩薩行願王經"), //
                "T2908", Kind.jin.of2("大方廣佛華嚴經普賢菩薩行願王品"), //
                "T2909", Kind.jin.of2("地藏菩薩經"), //
                "T2910", Kind.jin.of2("金有陀羅尼經"), //
                "T2911", Kind.jin.of2("讚僧功德經"), //
                "T2912", Kind.jin.of2("無常三啟經"), //
                "T2913", Kind.jin.of2("七女觀經"), //
                "T2914", Kind.jin.of2("觀經"), //
                "T2915", Kind.jin.of2("救諸眾生一切苦難經"), //
                "T2916", Kind.jin.of2("勸善經"), //
                "T2917A", Kind.jin.of2("新菩薩經"), //
                "T2917B", Kind.jin.of2("新菩薩經"), //
                "T2918", Kind.jin.of2("釋家觀化還愚經"), //
                "T2919", Kind.jin.of2("佛母經"), //
                "T2920", Kind.jin.of2("僧伽和尚欲入涅槃說六度經"), //

                "TX0001", Kind.lun.of3("第一編　佛法總學", "民國", "釋太虛"), // 民國 釋太虛著
                "TX0002", Kind.lun.of3("第二編　五乘共學", "民國", "釋太虛"), // 民國 釋太虛著
                "TX0003", Kind.lun.of3("第三編　三乘共學", "民國", "釋太虛"), // 民國 釋太虛著
                "TX0004", Kind.lun.of3("第四編　大乘通學", "民國", "釋太虛"), // 民國 釋太虛著
                "TX0005", Kind.lun.of3("第五編　法性空慧學", "民國", "釋太虛"), // 民國 釋太虛著
                "TX0006", Kind.lun.of3("第六編　法相唯識學", "民國", "釋太虛"), // 民國 釋太虛著
                "TX0007", Kind.lun.of3("第七編　法界圓覺學", "民國", "釋太虛"), // 民國 釋太虛著
                "TX0008", Kind.lun.of3("第八編　律釋", "民國", "釋太虛"), // 民國 釋太虛著
                "TX0009", Kind.lun.of3("第九編　制議", "民國", "釋太虛"), // 民國 釋太虛著
                "TX0010", Kind.lun.of3("第十編　學行", "民國", "釋太虛"), // 民國 釋太虛著
                "TX0011", Kind.lun.of3("第十一編　宗依論", "民國", "釋太虛"), // 民國 釋太虛著
                "TX0012", Kind.lun.of3("第十二編　宗體論", "民國", "釋太虛"), // 民國 釋太虛著
                "TX0013", Kind.lun.of3("第十三編　宗用論", "民國", "釋太虛"), // 民國 釋太虛著
                "TX0014", Kind.lun.of3("第十四編　支論", "民國", "釋太虛"), // 民國 釋太虛著
                "TX0015", Kind.lun.of3("第十五編　時論", "民國", "釋太虛"), // 民國 釋太虛著
                "TX0016", Kind.lun.of3("第十六編　書評", "民國", "釋太虛"), // 民國 釋太虛著
                "TX0017", Kind.lun.of3("第十七編　酬對", "民國", "釋太虛"), // 民國 釋太虛著
                "TX0018", Kind.lun.of3("第十八編　講演", "民國", "釋太虛"), // 民國 釋太虛著
                "TX0019", Kind.lun.of3("第十九編　文叢", "民國", "釋太虛"), // 民國 釋太虛著
                "TX0020", Kind.lun.of3("第二十編　詩存", "民國", "釋太虛")  // 民國 釋太虛著
        );
    }

    private static void addU() {
        add(
                "U1368", Kind.lunShi.of3("大乘百法明門論疏", "唐", "義忠"), // 唐 義忠述
                "U1418", Kind.jinShi.of4("華嚴經疏科", new String[]{"唐", "宋"}, "澄觀", "淨源") // 唐 澄觀述　宋 淨源重刊
        );
    }

    private static void addX() {
        add(
                "X0001", Kind.jin.of2("圓覺經佚文"), //
                "X0005", Kind.jin.of3("無量壽經會譯", "清", "魏源"), // 清 魏源會譯
                "X0006", Kind.jin.of2("阿彌陀經異本"), //
                "X0008", Kind.jin.of3("楞伽阿跋多羅寶經會譯", "明", "員珂"), // 明 員珂會譯
                "X0010", Kind.jin.of2("大明仁孝皇后夢感佛說第一希有大功德經"), //
                "X0011", Kind.jin.of3("佛說無量壽佛名號利益大事因緣經", "曹魏", "康僧鎧"), // 曹魏 康僧鎧譯
                "X0012", Kind.jin.of3("觀世音菩薩往生淨土本緣經", "西晉", "失譯"), // 失譯 附西晉錄
                "X0013", Kind.jin.of2("念佛超脫輪迴捷徑經"), //
                "X0014", Kind.jin.of3("十往生阿彌陀佛國經", "周", "失譯"), // 失譯 出周錄
                "X0015", Kind.jin.of2("淨度三昧經"), //
                "X0017", Kind.jin.of3("佛說長壽滅罪護諸童子陀羅尼經", "唐", "佛陀波利"), // 唐 佛陀波利譯
                "X0019", Kind.jin.of2("佛說斷溫經"), //
                "X0020", Kind.jin.of3("佛說地藏菩薩發心因緣十王經", "唐", "藏川"), // 唐 藏川述
                "X0021", Kind.jin.of3("佛說預修十王生七經", "唐", "藏川"), // 唐 藏川述
                "X0023", Kind.jin.of2("大藏正教血盆經"), //
                "X0024", Kind.jin.of2("壽生經"), //
                "X0025", Kind.jin.of2("化珠保命真經"), //
                "X0026", Kind.jin.of2("大梵天王問佛決疑經"), //
                "X0027", Kind.jin.of2("大梵天王問佛決疑經"), //
                "X0028", Kind.jin.of3("造像量度經", "清", "工布查布"), // 清 工布查布譯
                "X0034", Kind.jin.of2("觀世音菩薩救苦經"), //

                "X0057", Kind.lun.of2("十二禮", "龍樹菩薩", "禪那崛多別"), // 龍樹菩薩造　禪那崛多別譯

                "X0181", Kind.yiGui.of2("大聖妙吉祥菩薩最勝威德祕密八字陀羅尼修行念誦儀軌次第法", "義雲法金剛", "菩提仙"), // 義雲法金剛．菩提仙同譯

                "X0182", Kind.lun.of3("正了知王藥叉眷屬法", "唐", "義淨"), // 唐 義淨譯
                "X0183", Kind.lun.of3("二十八夜叉大軍王名號", "梁", "僧伽婆羅"), // 梁 僧伽婆羅譯抄之
                "X0184", Kind.lun.of3("二十八藥叉大將名號", "唐", "不空"), // 唐 不空譯抄之
                "X0185", Kind.lun.of3("權現金色迦那婆底九目天法", "唐", "菩提留支"), // 唐 菩提留支譯
                "X0188", Kind.lun.of3("祕密要術法", "唐", "阿謨伽"), // 唐 阿謨伽譯
                "X0190", Kind.lun.of3("阿迦陀密一印千類千轉三使者成就經法", "唐", "不空"), // 唐 不空譯

                "X0191", Kind.yiGui.of3("七俱胝准提陀羅尼念誦儀軌", "唐", "不空"), // 唐 不空譯

                "X0192", Kind.jin.of3("佛說如意虗空藏菩薩陀羅尼經", "唐", "菩提留支"), // 唐 菩提留支譯
                "X0193", Kind.jin.of2("佛說却溫黃神咒經"), //

                "X0201", Kind.yiGui.of2("五大牛玉雨寶陀羅尼儀軌", "縛日羅枳惹曩"), // 縛日羅枳惹曩譯

                "X0202", Kind.jin.of2("佛說大如意寶珠輪牛王守護神咒經", "阿謨伽三藏"), // 阿謨伽三藏譯
                "X0203", Kind.jin.of2("作世水宅心陀羅尼"), //
                "X0204", Kind.jin.of3("妙法蓮華三昧祕密三摩耶經", "唐", "不空"), // 唐 不空譯
                "X0205", Kind.jin.of3("佛說阿彌陀佛根本祕密神咒經", "曹魏", "菩提流支"), // 曹魏 菩提流支譯

                "X0206", Kind.lun.of3("馬鳴菩薩成就悉地念誦", "唐", "不空"), // 唐 不空譯
                "X0207", Kind.lun.of3("十六大羅漢因果識見頌", "唐", "闍那多迦"), // 唐 闍那多迦譯

                "X0208", Kind.jinShi.of3("華嚴經論〔卷十〕", "後魏", "靈辨"), // 後魏 靈辨造
                "X0211", Kind.jinShi.of3("華嚴經文義記〔卷六〕", "唐", "靈裕"), // 唐 靈裕集記
                "X0218", Kind.jinShi.of3("華嚴經入法界品十八問答", "唐", "澄觀"), // 唐 澄觀述
                "X0220", Kind.jinShi.of3("華嚴經綸貫", "宋", "復菴"), // 宋 復菴述
                "X0221", Kind.jinShi.of3("續華嚴經略疏刊定記", "唐", "慧苑"), // 唐 慧苑述
                "X0223", Kind.jinShi.of3("華嚴經合論", "唐", "李通玄", "志寧"), // 唐 李通玄造論　志寧釐經合論
                "X0225", Kind.jinShi.of3("華嚴經合論簡要", "明", "李贄"), // 明 李贄簡要
                "X0226", Kind.jinShi.of3("華嚴經合論纂要", "明", "方澤"), // 明 方澤纂
                "X0227", Kind.jinShi.of3("華嚴經行願品疏", "唐", "澄觀"), // 唐 澄觀述
                "X0228", Kind.jinShi.of3("華嚴經行願品疏科", "唐", "宗密"), // 唐 宗密撰集
                "X0229", Kind.jinShi.of3("華嚴經行願品疏鈔", "唐", "澄觀", "宗密"), // 唐 澄觀別行疏　宗密隨疏鈔
                "X0230", Kind.jinShi.of3("華嚴經普賢行願品疏科", "宋", "遵式"), // 宋 遵式治定
                "X0231", Kind.jinShi.of3("華嚴經疏科文", "唐", "澄觀"), // 唐 澄觀排定
                "X0232", Kind.jinShi.of3("華嚴經疏鈔玄談", "唐", "澄觀"), // 唐 澄觀撰述
                "X0234", Kind.jinShi.of4("華嚴經疏注", new String[]{"唐", "宋"}, "澄觀", "淨源"), // 唐 澄觀述　宋 淨源錄疏注經
                "X0235", Kind.jinShi.of3("華嚴經談玄抉擇", "遼", "鮮演"), // 遼 鮮演述
                "X0236", Kind.jinShi.of3("華嚴懸談會玄記", "元", "普瑞"), // 元 普瑞集
                "X0237", Kind.jinShi.of3("華嚴經文義要決問答", "新羅", "表員"), // 新羅 表員集
                "X0238", Kind.jinShi.of3("華嚴經要解", "宋", "戒環"), // 宋 戒環集
                "X0239", Kind.jinShi.of3("華嚴經吞海集", "宋", "道通"), // 宋 道通述
                "X0240", Kind.jinShi.of4("華嚴綱要", new String[]{"唐", "明"}, "澄觀", "德清"), // 唐 澄觀疏義　明 德清提挈
                "X0241", Kind.jinShi.of3("華嚴經綱目貫攝", "清", "永光"), // 清 永光錄集
                "X0242", Kind.jinShi.of3("華嚴經三十九品大意", "清", "永光"), // 清 永光敬錄
                "X0243", Kind.jinShi.of3("圓覺經大疏", "唐", "宗密"), // 唐 宗密述
                "X0244", Kind.jinShi.of3("圓覺經大疏鈔科", "唐", "宗密"), // 唐 宗密製
                "X0245", Kind.jinShi.of3("圓覺經大疏釋義鈔", "唐", "宗密"), // 唐 宗密撰
                "X0246", Kind.jinShi.of3("圓覺經略疏科", "唐", "宗密"), // 唐 宗密製
                "X0248", Kind.jinShi.of3("圓覺經略疏鈔", "唐", "宗密"), // 唐 宗密(於大疏略出)
                "X0249", Kind.jinShi.of3("圓覺經鈔辨疑誤", "宋", "觀復"), // 宋 觀復撰
                "X0250", Kind.jinShi.of3("圓覺經疏鈔隨文要解", "元", "清遠"), // 元 清遠述
                "X0251", Kind.jinShi.of3("御註圓覺經", "宋", "宋孝宗"), // 宋 孝宗帝註
                "X0252", Kind.jinShi.of3("圓覺經類解", "宋", "行霆"), // 宋 行霆解
                "X0253", Kind.jinShi.of3("圓覺經夾頌集解講義", "宋", "周琪"), // 宋 周琪述
                "X0254", Kind.jinShi.of3("圓覺經心鏡", "宋", "智聰"), // 宋 智聰述
                "X0255", Kind.jinShi.of3("圓覺經序注", "宋", "如山"), // 宋 如山註序
                "X0256", Kind.jinShi.of3("圓覺經略疏序注", "宋", "如山"), // 宋 如山注
                "X0257", Kind.jinShi.of3("圓覺經集註", "宋", "元粹"), // 宋 元粹述
                "X0258", Kind.jinShi.of3("圓覺經直解", "明", "德清"), // 明 德清解
                "X0259", Kind.jinShi.of3("圓覺經近釋", "明", "通潤"), // 明 通潤述
                "X0260", Kind.jinShi.of3("圓覺經要解", "明", "寂正"), // 明 寂正要解
                "X0261", Kind.jinShi.of3("圓覺經精解評林", "明", "焦竑"), // 明 焦竑纂
                "X0262", Kind.jinShi.of3("圓覺經句釋正白", "清", "弘麗"), // 清 弘麗著
                "X0263", Kind.jinShi.of3("圓覺經析義疏", "清", "通理"), // 清 通理述
                "X0264", Kind.jinShi.of3("大寶積經述", "唐", "徐鍔"), // 唐 徐鍔撰
                "X0265", Kind.jinShi.of3("楞嚴經義疏注經科", "宋", "子璿"), // 宋 子璿述
                "X0267", Kind.jinShi.of3("楞嚴經義疏釋要鈔", "宋", "懷遠"), // 宋 懷遠錄
                "X0268", Kind.jinShi.of3("楞嚴經集註", "宋", "思坦"), // 宋 思坦集註
                "X0269", Kind.jinShi.of3("楞嚴經熏聞記", "宋", "仁岳"), // 宋 仁岳述
                "X0270", Kind.jinShi.of3("楞嚴經要解", "宋", "戒環"), // 宋 戒環解
                "X0271", Kind.jinShi.of3("楞嚴經箋", "宋", "惟慤", "可度"), // 宋 惟慤科　可度箋
                "X0272", Kind.jinShi.of3("楞嚴經合論", "宋", "德洪", "正受"), // 宋 德洪造論　正受會合
                "X0273", Kind.jinShi.of3("楞嚴經正脉疏科", "明", "真鑑"), // 明 真鑑作
                "X0274", Kind.jinShi.of3("楞嚴經正脉疏懸示", "明", "真鑑"), // 明 真鑑述
                "X0275", Kind.jinShi.of3("楞嚴經正脉疏", "明", "真鑑"), // 明 真鑑述
                "X0276", Kind.jinShi.of3("楞嚴經摸象記", "明", "袾宏"), // 明 袾宏述
                "X0277", Kind.jinShi.of3("楞嚴經懸鏡", "明", "德清"), // 明 德清述
                "X0278", Kind.jinShi.of3("楞嚴經通議略科", "明", "德清"), // 明 德清排訂
                "X0279", Kind.jinShi.of3("楞嚴經通議", "明", "德清"), // 明 德清述
                "X0280", Kind.jinShi.of3("楞嚴經臆說", "明", "圓澄"), // 明 圓澄註
                "X0281", Kind.jinShi.of4("楞嚴經圓通疏", new String[]{"元", "明"}, "惟則", "傳燈"), // 元 惟則會解　明 傳燈疏
                "X0282", Kind.jinShi.of3("楞嚴經玄義", "明", "傳燈"), // 明 傳燈述
                "X0283", Kind.jinShi.of3("楞嚴經秘錄", "明", "一松", "靈述"), // 明 一松說　靈述記
                "X0284", Kind.jinShi.of3("楞嚴經玄義", "明", "智旭", "道昉"), // 明 智旭撰述　道昉參訂
                "X0285", Kind.jinShi.of3("楞嚴經文句", "明", "智旭", "道昉"), // 明 智旭撰述　道昉參訂
                "X0286", Kind.jinShi.of3("楞嚴經如說", "明", "鍾惺"), // 明 鍾惺撰
                "X0287", Kind.jinShi.of3("楞嚴經疏解蒙鈔", "明", "錢謙益"), // 明 錢謙益鈔
                "X0288", Kind.jinShi.of3("楞嚴經證疏廣解", "明", "凌弘憲"), // 明 凌弘憲點釋
                "X0289", Kind.jinShi.of3("楞嚴經合轍", "明", "通潤"), // 明 通潤述
                "X0290", Kind.jinShi.of2("楞嚴經直指科文"), //
                "X0291", Kind.jinShi.of3("楞嚴經直指", "明", "圅昰"), // 明 圅昰疏
                "X0292", Kind.jinShi.of3("楞嚴經擊節", "明", "大韶"), // 明 大韶撰
                "X0293", Kind.jinShi.of3("楞嚴經懸談", "明", "觀衡"), // 明 觀衡撰
                "X0294", Kind.jinShi.of3("楞嚴經說約", "明", "陸西星"), // 明 陸西星述
                "X0295", Kind.jinShi.of3("楞嚴經述旨", "明", "陸西星"), // 明 陸西星述
                "X0296", Kind.jinShi.of3("楞嚴經截流", "明", "傳如"), // 明 傳如述
                "X0297", Kind.jinShi.of3("楞嚴經圓通疏前茅", "明", "傳燈"), // 明 傳燈述
                "X0298", Kind.jinShi.of3("楞嚴經直解", "明", "廣莫"), // 明 廣莫直解
                "X0299", Kind.jinShi.of3("楞嚴經講錄", "明", "乘旹"), // 明 乘旹講錄
                "X0300", Kind.jinShi.of3("楞嚴經纂註", "明", "真界"), // 明 真界纂註
                "X0301", Kind.jinShi.of3("楞嚴經精解評林", "明", "焦竑"), // 明 焦竑纂
                "X0302", Kind.jinShi.of3("楞嚴經略疏", "明", "元賢"), // 明 元賢述
                "X0303", Kind.jinShi.of3("楞嚴經貫攝", "清", "劉道開"), // 清 劉道開纂述
                "X0304", Kind.jinShi.of3("楞嚴經觀心定解科", "清", "靈耀"), // 清 靈耀述
                "X0305", Kind.jinShi.of3("楞嚴經觀心定解大綱", "清", "靈耀"), // 清 靈耀述
                "X0306", Kind.jinShi.of3("楞嚴經觀心定解", "清", "靈耀"), // 清 靈耀述
                "X0307", Kind.jinShi.of3("楞嚴經指掌疏懸示", "清", "通理"), // 清 通理述
                "X0308", Kind.jinShi.of3("楞嚴經指掌疏", "清", "通理"), // 清 通理述
                "X0309", Kind.jinShi.of3("楞嚴經指掌疏事義", "清", "通理"), // 清 通理述
                "X0310", Kind.jinShi.of3("楞嚴經勢至圓通章科解", "明", "正相"), // 明 正相解
                "X0311", Kind.jinShi.of3("楞嚴經勢至圓通章疏鈔", "清", "續法"), // 清 續法集
                "X0312", Kind.jinShi.of3("楞嚴經勢至圓通章解", "清", "行策"), // 清 行策撰
                "X0313", Kind.jinShi.of3("楞嚴經序指味疏", "清", "諦閑"), // 清 諦閑述
                "X0314", Kind.jinShi.of3("楞嚴經寶鏡疏科文", "清", "溥畹"), // 清 溥畹撰
                "X0315", Kind.jinShi.of3("楞嚴經寶鏡疏懸談", "清", "溥畹"), // 清 溥畹述
                "X0316", Kind.jinShi.of3("楞嚴經寶鏡疏", "清", "溥畹"), // 清 溥畹述
                "X0317", Kind.jinShi.of3("楞嚴經正見", "清", "濟時"), // 清 濟時述
                "X0318", Kind.jinShi.of3("楞嚴經宗通", "明", "曾鳳儀"), // 明 曾鳳儀宗通
                "X0321", Kind.jinShi.of3("楞伽經註", "唐", "智嚴"), // 唐 智嚴註
                "X0322", Kind.jinShi.of2("楞伽經疏"), //
                "X0323", Kind.jinShi.of3("楞伽經通義", "宋", "善月"), // 宋 善月述
                "X0324", Kind.jinShi.of3("楞伽經集註", "宋", "正受"), // 宋 正受集記
                "X0325", Kind.jinShi.of3("楞伽經纂", "宋", "楊彥國"), // 宋 楊彥國纂
                "X0326", Kind.jinShi.of3("觀楞伽經記", "明", "德清"), // 明 德清筆記
                "X0327", Kind.jinShi.of3("楞伽補遺", "明", "德清"), // 明 德清撰
                "X0328", Kind.jinShi.of3("楞伽經玄義", "明", "智旭"), // 明 智旭撰述
                "X0329", Kind.jinShi.of3("楞伽經義疏", "明", "智旭"), // 明 智旭疏義
                "X0330", Kind.jinShi.of3("楞伽經宗通", "明", "曾鳳儀"), // 明 曾鳳儀宗通
                "X0331", Kind.jinShi.of3("楞伽經合轍", "明", "通潤"), // 明 通潤述
                "X0332", Kind.jinShi.of3("楞伽經參訂疏", "明", "廣莫"), // 明 廣莫參訂
                "X0333", Kind.jinShi.of3("楞伽經精解評林", "明", "焦竑"), // 明 焦竑纂
                "X0334", Kind.jinShi.of3("楞伽經心印", "清", "圅昰"), // 清 圅昰疏
                "X0338", Kind.jinShi.of3("維摩經文疏", "隋", "智顗"), // 隋 智顗撰
                "X0340", Kind.jinShi.of3("維摩經疏記", "唐", "湛然"), // 唐 湛然述
                "X0343", Kind.jinShi.of3("維摩經略疏", "胡", "吉藏"), // 胡 吉藏撰
                "X0345", Kind.jinShi.of3("維摩經疏記鈔", "唐", "道暹"), // 唐 道暹私記
                "X0347", Kind.jinShi.of3("維摩經評註", "明", "楊起元"), // 明 楊起元評註
                "X0348", Kind.jinShi.of3("維摩經無我疏", "明", "傳燈"), // 明 傳燈著
                "X0349", Kind.jinShi.of3("維摩經疏科", "明"), // 明
                "X0351", Kind.jinShi.of3("勝鬘經義記", "隋", "慧遠"), // 隋 慧遠撰
                "X0352", Kind.jinShi.of3("勝鬘經述記", "唐", "大乘基", "義令"), // 唐 大乘基說　義令記
                "X0353", Kind.jinShi.of4("勝鬘經疏義私鈔", new String[]{"唐", "日本"}, "聖德太子", "明空"), // 日本 聖德太子疏　唐 明空私鈔
                "X0355", Kind.jinShi.of3("金光明經玄義科", "明", "明得"), // 明 明得排定
                "X0356", Kind.jinShi.of4("金光明經玄義拾遺記會本", new String[]{"隋", "唐", "宋", "明"}, "智顗", "灌頂", "知禮", "明得"), // 隋 智顗說　唐 灌頂錄　宋 知禮述　明 明得會
                "X0357", Kind.jinShi.of3("金光明經文句科", "明", "明得"), // 明 明得排定
                "X0358", Kind.jinShi.of4("金光明經文句文句記會本", new String[]{"隋", "唐", "宋", "明"}, "智顗", "灌頂", "知禮", "明得"), // 隋 智顗說　唐 灌頂錄　宋 知禮述　明 明得會
                "X0359", Kind.jinShi.of3("金光明經玄義順正記", "宋", "從義"), // 宋 從義撰
                "X0360", Kind.jinShi.of3("金光明經文句新記", "宋", "從義"), // 宋 從義撰
                "X0361", Kind.jinShi.of3("金光明經照解", "宋", "宗曉"), // 宋 宗曉述
                "X0362", Kind.jinShi.of3("金光明經科註", "明", "受汰"), // 明 受汰集
                "X0364", Kind.jinShi.of3("思益梵天所問經簡註", "明", "圓澄"), // 明 圓澄註
                "X0365", Kind.jinShi.of3("大乘本生心地觀經淺註懸示", "清", "來舟"), // 清 來舟述
                "X0366", Kind.jinShi.of2("大乘本生心地觀經淺註科文"), //
                "X0367", Kind.jinShi.of3("大乘本生心地觀經淺註", "清", "來舟"), // 清 來舟集
                "X0368", Kind.jinShi.of3("大乘密嚴經疏", "唐", "法藏"), // 唐 法藏撰
                "X0369", Kind.jinShi.of3("解深密經疏", "唐", "圓測"), // 唐 圓測撰
                "X0370", Kind.jinShi.of3("占察善惡業報經玄義", "明", "智旭"), // 明 智旭撰
                "X0371", Kind.jinShi.of3("占察善惡業報經義疏", "明", "智旭"), // 明 智旭撰
                "X0372", Kind.jinShi.of4("盂蘭盆經疏新記", new String[]{"唐", "宋"}, "宗密", "元照"), // 唐 宗密疏　宋 元照記
                "X0373", Kind.jinShi.of3("盂蘭盆經疏會古通今記", "宋", "普觀"), // 宋 普觀述
                "X0374", Kind.jinShi.of3("盂蘭盆經疏孝衡鈔科", "宋", "遇榮"), // 宋 遇榮集定
                "X0375", Kind.jinShi.of3("盂蘭盆經疏孝衡鈔", "宋", "遇榮"), // 宋 遇榮鈔
                "X0376", Kind.jinShi.of3("盂蘭盆經疏鈔餘義", "宋", "日新"), // 宋 日新錄
                "X0377", Kind.jinShi.of3("盂蘭盆經新疏", "明", "智旭"), // 明 智旭疏
                "X0378", Kind.jinShi.of3("盂蘭盆經疏折中疏", "清", "靈耀"), // 清 靈耀撰
                "X0379", Kind.jinShi.of3("盂蘭盆經略疏", "清", "元奇"), // 清 元奇書
                "X0381", Kind.jinShi.of3("藥師經直解", "清", "靈耀"), // 清 靈耀撰
                "X0382", Kind.jinShi.of3("地藏本願經科文", "清", "岳玄"), // 清 岳玄排
                "X0383", Kind.jinShi.of3("地藏本願經綸貫", "清", "靈椉"), // 清 靈椉撰
                "X0384", Kind.jinShi.of3("地藏本願經科註", "清", "靈椉"), // 清 靈椉輯
                "X0388", Kind.jinShi.of2("彌勒上生經述贊"), //
                "X0389", Kind.jinShi.of2("彌勒下生經述贊"), //
                "X0393", Kind.jinShi.of3("彌勒上生經瑞應鈔科", "宋", "守千"), // 宋 守千集
                "X0394", Kind.jinShi.of3("彌勒上生經瑞應鈔", "宋", "守千"), // 宋 守千集
                "X0397", Kind.jinShi.of3("無量壽經記", "唐", "玄一"), // 唐 玄一集
                "X0400", Kind.jinShi.of3("無量壽經起信論", "清", "彭際清"), // 清 彭際清述
                "X0401", Kind.jinShi.of3("摩訶阿彌陀經衷論", "清", "王耕心"), // 清 王耕心衷論
                "X0405", Kind.jinShi.of3("釋觀無量壽佛經記", "唐", "法聰"), // 唐 法聰撰
                "X0406", Kind.jinShi.of4("觀無量壽經疏妙宗鈔科", new String[]{"宋", "明"}, "知禮", "真覺"), // 宋 知禮排定　明 真覺重排
                "X0407", Kind.jinShi.of4("觀無量壽佛經疏妙宗鈔", new String[]{"隋", "宋", "日本"}, "智顗", "知禮", "實觀"), // 隋 智顗說　宋 知禮述　日本 實觀分會
                "X0408", Kind.jinShi.of3("觀無量壽佛經融心解", "宋", "知禮"), // 宋 知禮撰
                "X0410", Kind.jinShi.of3("觀無量壽經扶新論", "宋", "戒度"), // 宋 戒度述
                "X0411", Kind.jinShi.of3("觀無量壽經義疏正觀記", "宋", "戒度"), // 宋 戒度述
                "X0412", Kind.jinShi.of3("觀無量壽佛經圖頌", "明", "傳燈"), // 明 傳燈述
                "X0413", Kind.jinShi.of3("觀無量壽經直指疏", "清", "續法"), // 清 續法集
                "X0414", Kind.jinShi.of3("觀無量壽佛經約論", "清", "彭際清"), // 清 彭際清述
                "X0420", Kind.jinShi.of3("阿彌陀經義疏聞持記", "宋", "元照", "戒度"), // 宋 元照述　戒度記
                "X0421", Kind.jinShi.of3("阿彌陀經句解", "元", "性澄"), // 元 性澄句解
                "X0422", Kind.jinShi.of3("阿彌陀經略解", "明", "大佑"), // 明 大佑述
                "X0423", Kind.jinShi.of3("阿彌陀經略解圓中鈔", "明", "大佑", "傳燈"), // 明 大佑述　傳燈鈔
                "X0424", Kind.jinShi.of3("阿彌陀經疏鈔", "明", "袾宏"), // 明 袾宏述
                "X0425", Kind.jinShi.of3("阿彌陀經疏鈔事義", "明", "袾宏"), // 明 袾宏述
                "X0426", Kind.jinShi.of3("阿彌陀經疏鈔問辯", "明", "袾宏"), // 明 袾宏述
                "X0427", Kind.jinShi.of3("阿彌陀經疏鈔演義", "明", "古德法師", "慈航智願"), // 明 古德法師演義　慈航智願定本
                "X0428", Kind.jinShi.of4("阿彌陀經疏鈔擷", new String[]{"明", "清"}, "袾宏", "徐槐廷"), // 明 袾宏疏鈔　清 徐槐廷擷
                "X0429", Kind.jinShi.of3("阿彌陀經已決", "明", "大慧"), // 明 大慧釋
                "X0430", Kind.jinShi.of4("阿彌陀經要解便蒙鈔", new String[]{"明", "清"}, "智旭", "達默", "達林"), // 明 智旭要解　清 達默造鈔　達林參訂
                "X0431", Kind.jinShi.of3("阿彌陀經略註", "清", "續法"), // 清 續法錄註
                "X0432", Kind.jinShi.of3("阿彌陀經註", "清", "鄭澄德", "鄭澄源"), // 清 鄭澄德．鄭澄源註
                "X0433", Kind.jinShi.of3("阿彌陀經約論", "清", "彭際清"), // 清 彭際清述
                "X0434", Kind.jinShi.of3("阿彌陀經直解正行", "清", "了根"), // 清 了根纂註
                "X0435", Kind.jinShi.of3("阿彌陀經摘要易解", "清", "真嵩"), // 清 真嵩述
                "X0438", Kind.jinShi.of3("大日經義釋", "唐", "一行"), // 唐 一行述記
                "X0439", Kind.jinShi.of3("大日經義釋演密鈔", "遼", "覺苑"), // 遼 覺苑撰
                "X0445", Kind.jinShi.of3("佛頂尊勝陀羅尼經釋", "清", "續法"), // 清 續法釋
                "X0446", Kind.jinShi.of3("七俱胝佛母所說準提陀羅尼經會釋", "清", "弘贊"), // 清 弘贊會釋
                "X0447", Kind.jinShi.of3("觀自在菩薩如意心陀羅尼經略疏", "清", "續法"), // 清 續法述
                "X0448", Kind.jinShi.of3("大般若經關法", "宋", "大隱", "永隆"), // 宋 大隱．永隆排定
                "X0449", Kind.jinShi.of3("大般若經綱要", "清", "葛䵻"), // 清 葛䵻提綱
                "X0451", Kind.jinShi.of3("大品經義疏", "胡", "吉藏"), // 胡 吉藏撰
                "X0454", Kind.jinShi.of3("金剛經註", "東晉", "僧肇"), // 東晉 僧肇注
                "X0456", Kind.jinShi.of3("金剛經註疏", "唐", "慧淨"), // 唐 慧淨註
                "X0459", Kind.jinShi.of3("金剛經解義", "唐", "慧能"), // 唐 慧能解義
                "X0460", Kind.jinShi.of3("金剛經口訣", "唐", "慧能"), // 唐 慧能說
                "X0461", Kind.jinShi.of3("金剛經註", "宋", "道川"), // 宋 道川頌並著語
                "X0462", Kind.jinShi.of3("金剛經會解", "宋", "善月"), // 宋 善月述
                "X0463", Kind.jinShi.of3("金剛經采微科", "宋", "曇應"), // 宋 曇應排
                "X0464", Kind.jinShi.of3("金剛經采微", "宋", "曇應"), // 宋 曇應述
                "X0465", Kind.jinShi.of3("金剛經采微餘釋", "宋", "曇應"), // 宋 曇應述
                "X0466", Kind.jinShi.of3("金剛疏科釋", "元", "徐行善"), // 元 徐行善科
                "X0467", Kind.jinShi.of4("銷釋金剛經科儀會要註解", new String[]{"宋", "明"}, "宗鏡", "覺連"), // 宋 宗鏡述　明 覺連重集
                "X0468", Kind.jinShi.of3("金剛經註解", "明", "洪蓮"), // 明 洪蓮編
                "X0469", Kind.jinShi.of3("金剛經補註", "明", "韓巖", "程衷懋"), // 明 韓巖集解　程衷懋補註
                "X0470", Kind.jinShi.of3("金剛經註解鐵鋑錎", "明", "屠垠"), // 明 屠根註
                "X0471", Kind.jinShi.of3("金剛經宗通", "明", "曾鳳儀"), // 明 曾鳳儀宗通
                "X0472", Kind.jinShi.of3("金剛經偈釋", "明", "曾鳳儀"), // 明 曾鳳儀釋
                "X0473", Kind.jinShi.of3("金剛經釋", "明", "真可"), // 明 真可撰
                "X0474", Kind.jinShi.of3("金剛經決疑", "明", "德清"), // 明 德清撰
                "X0475", Kind.jinShi.of3("金剛經鎞", "明", "廣伸"), // 明 廣伸述
                "X0476", Kind.jinShi.of3("金剛經統論", "明", "林兆恩"), // 明 林兆恩撰
                "X0477", Kind.jinShi.of3("金剛經正眼", "明", "大韻"), // 明 大韻筆記
                "X0478", Kind.jinShi.of3("金剛經筆記", "明", "如觀"), // 明 如觀註
                "X0479", Kind.jinShi.of3("金剛經破空論", "明", "智旭"), // 明 智旭造論
                "X0480", Kind.jinShi.of3("金剛經觀心釋", "明", "智旭"), // 明 智旭述
                "X0481", Kind.jinShi.of3("金剛經略談", "明", "觀衡"), // 明 觀衡撰
                "X0482", Kind.jinShi.of3("金剛經略疏", "明", "元賢"), // 明 元賢述
                "X0483", Kind.jinShi.of3("金剛經音釋直解", "明", "圓杲"), // 明 圓杲解註
                "X0484", Kind.jinShi.of3("金剛經大意", "清", "王起隆"), // 清 王起隆述
                "X0485", Kind.jinShi.of3("金剛經如是解", "清", "無是道人"), // 清 無是道人註解
                "X0486", Kind.jinShi.of3("金剛經會解了義", "清", "徐昌治"), // 清 徐昌治纂
                "X0487", Kind.jinShi.of3("金剛新眼疏經偈合釋", "清", "通理"), // 清 通理述
                "X0488", Kind.jinShi.of3("金剛經郢說", "清", "徐發"), // 清 徐發詮次
                "X0489", Kind.jinShi.of3("金剛經註正訛", "清", "仲之屏"), // 清 仲之屏彙纂
                "X0490", Kind.jinShi.of3("金剛經淺解", "清", "翁春", "王錫琯"), // 清 翁春．王錫琯解釋
                "X0491", Kind.jinShi.of4("金剛經疏記科會", new String[]{"唐", "宋", "清"}, "宗密", "子璿", "大璸"), // 唐 宗密疏　宋 子璿記　清 大璸科會
                "X0492", Kind.jinShi.of3("金剛經疏記會編", "清", "行策"), // 清 行策會編
                "X0493", Kind.jinShi.of3("金剛經部旨", "清", "靈耀"), // 清 靈耀撰
                "X0494", Kind.jinShi.of3("金剛經註釋", "清", "溥仁", "子真"), // 清 溥仁乩書　子真乩訂
                "X0495", Kind.jinShi.of3("金剛經演古", "清", "寂燄"), // 清 寂燄述
                "X0496", Kind.jinShi.of3("金剛經直說", "清", "迹刪鷲"), // 清 迹刪鷲述
                "X0497", Kind.jinShi.of3("金剛經石注", "清", "石成金"), // 清 石成金撰集
                "X0498", Kind.jinShi.of3("金剛經正解", "清", "龔穊綵"), // 清 龔穊綵註
                "X0499", Kind.jinShi.of3("金剛經法眼懸判疏鈔", "清", "性起"), // 清 性起述
                "X0500", Kind.jinShi.of3("金剛經法眼註疏", "清", "性起"), // 清 性起述
                "X0501", Kind.jinShi.of3("金剛經如是經義", "清", "行敏"), // 清 行敏述
                "X0502", Kind.jinShi.of3("金剛經註講", "清", "行敏"), // 清 行敏述
                "X0503", Kind.jinShi.of3("金剛經注解", "清", "孚佑帝君"), // 清 孚佑帝君註解
                "X0504", Kind.jinShi.of3("金剛經彙纂", "清", "孫念劬"), // 清 孫念劬纂
                "X0505", Kind.jinShi.of3("金剛經心印疏", "清", "溥畹"), // 清 溥畹述
                "X0506", Kind.jinShi.of3("金剛經注", "清", "俞樾"), // 清 俞樾註
                "X0507", Kind.jinShi.of3("金剛經訂義", "清", "俞樾"), // 清 俞樾著
                "X0508", Kind.jinShi.of3("金剛經闡說", "清", "存吾"), // 清 存吾闡說
                "X0509", Kind.jinShi.of3("金剛經解義", "清", "徐槐廷"), // 清 徐槐廷述
                "X0510", Kind.jinShi.of3("金剛經易解", "清", "謝承謨"), // 清 謝承謨註釋
                "X0513", Kind.jinShi.of4("仁王經合疏", new String[]{"隋", "明"}, "智顗", "灌頂", "道霈"), // 隋 智顗說　灌頂記　明 道霈合
                "X0514", Kind.jinShi.of4("仁王經疏會本", new String[]{"隋", "清"}, "智顗", "灌頂", "成蓮"), // 隋 智顗說　灌頂記　清 成蓮合
                "X0515", Kind.jinShi.of3("仁王經科疏科文", "明", "真貴"), // 明 真貴述
                "X0516", Kind.jinShi.of3("仁王經科疏懸談", "明", "真貴"), // 明 真貴述
                "X0517", Kind.jinShi.of3("仁王經科疏", "明", "真貴"), // 明 真貴述
                "X0519", Kind.jinShi.of3("仁王經疏法衡鈔", "唐", "遇榮"), // 唐 遇榮集
                "X0520", Kind.jinShi.of3("仁王經疏", "宋", "淨源"), // 宋 淨源撰集
                "X0521", Kind.jinShi.of3("般若心經疏", "唐", "慧淨"), // 唐 慧淨作
                "X0522", Kind.jinShi.of3("般若心經疏", "唐", "靖邁"), // 唐 靖邁撰
                "X0524", Kind.jinShi.of3("般若心經幽贊添改科", "宋", "守千"), // 宋 守千添改
                "X0525", Kind.jinShi.of3("般若心經幽贊崆峒記", "宋", "守千"), // 宋 守千集
                "X0526", Kind.jinShi.of3("般若心經註", "中天竺", "提婆"), // 中天竺 提婆註
                "X0528", Kind.jinShi.of3("般若心經略疏", "唐", "明曠"), // 唐 明曠述
                "X0529", Kind.jinShi.of3("般若心經疏", "宋", "智圓"), // 宋 智圓述
                "X0530", Kind.jinShi.of3("般若心經疏詒謀鈔", "宋", "智圓"), // 宋 智圓撰
                "X0531", Kind.jinShi.of4("般若心經略疏顯正記", new String[]{"唐", "宋"}, "法藏", "仲希"), // 唐 法藏疏　宋 仲希說
                "X0532", Kind.jinShi.of3("般若心經略疏小鈔", "明", "錢謙益"), // 明 錢謙益集
                "X0533", Kind.jinShi.of4("般若心經三注", new String[]{"唐", "宋"}, "慧忠", "道楷", "懷深"), // 唐 慧忠著　宋 道楷．懷琛述
                "X0534", Kind.jinShi.of3("般若心經注", "宋", "道隆"), // 宋 道隆述
                "X0535", Kind.jinShi.of3("般若心經解義節要", "明", "宋濂"), // 明 宋濂文句
                "X0536", Kind.jinShi.of3("般若心經注解", "明", "真可"), // 明 真可撰
                "X0537", Kind.jinShi.of3("般若心經直談", "明", "真可"), // 明 真可撰
                "X0538", Kind.jinShi.of3("般若心經要論", "明", "真可"), // 明 真可說
                "X0539", Kind.jinShi.of3("般若心經說", "明", "真可"), // 明 真可說
                "X0540", Kind.jinShi.of3("般若心經釋義", "明", "謝觀光"), // 明 謝觀光釋
                "X0541", Kind.jinShi.of3("般若心經釋疑", "明", "謝觀光"), // 明 謝觀光釋
                "X0542", Kind.jinShi.of3("般若心經直說", "明", "德清"), // 明 德清述
                "X0543", Kind.jinShi.of3("般若心經提綱", "明", "李贄"), // 明 李贄撰
                "X0544", Kind.jinShi.of3("般若心經釋略", "明", "林兆恩"), // 明 林兆恩撰
                "X0545", Kind.jinShi.of3("般若心經概論", "明", "林兆恩"), // 明 林兆恩撰
                "X0546", Kind.jinShi.of3("般若心經說", "明", "洪恩"), // 明 洪恩述
                "X0547", Kind.jinShi.of3("般若心經註解", "明", "諸萬里"), // 明 諸萬里註
                "X0548", Kind.jinShi.of3("般若心經斲輪解", "明", "通容"), // 明 通容述
                "X0549", Kind.jinShi.of3("般若心經正眼", "明", "大文"), // 明 大文述
                "X0550", Kind.jinShi.of3("般若心經開度", "明", "弘麗"), // 明 弘麗著
                "X0551", Kind.jinShi.of3("般若心經發隱", "明", "正相"), // 明 正相解
                "X0552", Kind.jinShi.of3("般若心經際決", "明", "大慧"), // 明 大慧釋
                "X0553", Kind.jinShi.of3("般若心經添足", "明", "弘贊"), // 明 弘贊述
                "X0554", Kind.jinShi.of3("般若心經貫義", "明", "弘贊"), // 明 弘贊述
                "X0555", Kind.jinShi.of3("般若心經釋要", "明", "智旭"), // 明 智旭述
                "X0556", Kind.jinShi.of3("般若心經小談", "明", "觀衡"), // 明 觀衡述
                "X0557", Kind.jinShi.of3("般若心經一貫疏", "明", "益證"), // 明 益證疏
                "X0558", Kind.jinShi.of3("般若心經指掌", "明", "元賢"), // 明 元賢述
                "X0559", Kind.jinShi.of3("般若心經事觀解", "清", "續法"), // 清 續法述
                "X0560", Kind.jinShi.of3("般若心經理性解", "清", "續法"), // 清 續法述
                "X0561", Kind.jinShi.of3("般若心經大意", "清", "王起隆"), // 清 王起隆述
                "X0562", Kind.jinShi.of3("般若心經解", "清", "徐昌治"), // 清 徐昌治解
                "X0563", Kind.jinShi.of3("般若心經請益說", "清", "道霈"), // 清 道霈說
                "X0564", Kind.jinShi.of3("般若心經註疏", "清", "仲之屏"), // 清 仲之屏纂註
                "X0565", Kind.jinShi.of3("般若心經論", "清", "圅昰"), // 清 圅昰撰
                "X0566", Kind.jinShi.of3("般若心經彙纂", "清", "孫念劬"), // 清 孫念劬纂
                "X0567", Kind.jinShi.of3("般若心經如是經義", "清", "行敏"), // 清 行敏述
                "X0568", Kind.jinShi.of3("般若心經註講", "清", "行敏"), // 清 行敏述
                "X0569", Kind.jinShi.of3("般若心經句解易知", "清", "王澤泩"), // 清 王澤泩註解
                "X0570", Kind.jinShi.of3("般若心經解義", "清", "徐槐廷"), // 清 徐槐廷解義
                "X0571", Kind.jinShi.of3("般若心經註解", "清", "敬止"), // 清 敬止撰
                "X0572", Kind.jinShi.of3("般若心經易解", "清", "謝承謨"), // 清 謝承謨註釋
                "X0573", Kind.jinShi.of3("般若心經註解", "唐", "大顛祖師"), // 唐 大顛祖師註解
                "X0574", Kind.jinShi.of3("般若心經註解", "明", "何道全"), // 明 何道全註
                "X0575", Kind.jinShi.of2("般若心經註解"), //
                "X0576", Kind.jinShi.of3("般若心經註解", "清", "孚佑帝君"), // 清 孚佑帝君註解
                "X0577", Kind.jinShi.of3("法華經疏", "宋", "竺道生"), // 宋 竺道生撰
                "X0582", Kind.jinShi.of3("法華統略", "胡", "吉藏"), // 胡 吉藏撰
                "X0583", Kind.jinShi.of3("法華經大意", "唐", "湛然"), // 唐 湛然述
                "X0584", Kind.jinShi.of3("法華三大部科文", "唐", "湛然"), // 唐 湛然述
                "X0585", Kind.jinShi.of3("法華經三大部讀教記", "宋", "法照"), // 宋 法照撰
                "X0586", Kind.jinShi.of3("法華經三大部補注", "宋", "從義"), // 宋 從義撰
                "X0587", Kind.jinShi.of3("大部妙玄格言", "宋", "善月"), // 宋 善月述
                "X0588", Kind.jinShi.of3("法華經玄籤備撿", "宋", "有嚴"), // 宋 有嚴述
                "X0589", Kind.jinShi.of3("法華經玄義節要", "明", "智旭"), // 明 智旭節
                "X0590", Kind.jinShi.of3("法華經玄義輯略", "明", "傳燈"), // 明 傳燈錄
                "X0591", Kind.jinShi.of3("法華經釋籤緣起序指明", "清", "靈耀"), // 清 靈耀述
                "X0592", Kind.jinShi.of3("法華經玄籤證釋", "清", "智銓"), // 清 智銓述
                "X0593", Kind.jinShi.of3("法華經文句輔正記", "唐", "道暹"), // 唐 道暹述
                "X0594", Kind.jinShi.of3("法華經疏義纘", "唐", "智度"), // 唐 智度述
                "X0595", Kind.jinShi.of3("妙經文句私志諸品要義", "唐", "智雲"), // 唐 智雲述
                "X0596", Kind.jinShi.of3("妙經文句私志記", "唐", "智雲"), // 唐 智雲撰
                "X0597", Kind.jinShi.of3("法華經文句記箋難", "宋", "有嚴"), // 宋 有嚴箋
                "X0598", Kind.jinShi.of3("法華經文句格言", "宋", "善月"), // 宋 善月述
                "X0599", Kind.jinShi.of3("法華經文句纂要", "清", "道霈"), // 清 道霈纂要
                "X0600", Kind.jinShi.of3("法華經入疏", "宋", "道威"), // 宋 道威入注
                "X0601", Kind.jinShi.of2("法華經要解科"), //
                "X0602", Kind.jinShi.of3("法華經要解", "宋", "戒環"), // 宋 戒環解
                "X0603", Kind.jinShi.of3("法華經合論", "宋", "慧洪", "張商英"), // 宋 慧洪造　張商英撰
                "X0604", Kind.jinShi.of3("法華經句解", "宋", "聞達"), // 宋 聞達解
                "X0605", Kind.jinShi.of4("法華經科註", new String[]{"宋", "明"}, "守倫", "法濟"), // 宋 守倫註　明 法濟參訂
                "X0606", Kind.jinShi.of3("法華經科註", "元", "徐行善"), // 元 徐行善科註
                "X0607", Kind.jinShi.of3("法華經科註", "明", "一如"), // 明 一如集註
                "X0608", Kind.jinShi.of3("法華經知音", "明", "如愚"), // 明 如愚著
                "X0609", Kind.jinShi.of3("法華經大意", "明", "無相"), // 明 無相說
                "X0610", Kind.jinShi.of3("法華經擊節", "明", "德清"), // 明 德清述
                "X0611", Kind.jinShi.of3("法華經通義", "明", "德清"), // 明 德清述
                "X0612", Kind.jinShi.of3("法華經精解評林", "明", "焦竑"), // 明 焦竑纂
                "X0613", Kind.jinShi.of3("法華經意語", "明", "圓澄", "明海"), // 明 圓澄說　明海重訂
                "X0614", Kind.jinShi.of3("法華經大窾", "明", "通潤"), // 明 通潤箋
                "X0615", Kind.jinShi.of3("法華經綸貫", "明", "智旭"), // 明 智旭述
                "X0616", Kind.jinShi.of3("法華經會義", "明", "智旭"), // 明 智旭述
                "X0617", Kind.jinShi.of3("法華經卓解", "清", "徐昌治"), // 清 徐昌治著
                "X0618", Kind.jinShi.of3("法華經大成科", "清", "際慶"), // 清 際慶排錄
                "X0619", Kind.jinShi.of3("法華經大成", "清", "大義"), // 清 大義集

                "X0620", Kind.yinYi.of3("法華經大成音義", "清", "淨昇"), // 清 淨昇集

                "X0621", Kind.jinShi.of3("法華經授手〔卷首〕", "清", "智祥"), // 清 智祥集
                "X0622", Kind.jinShi.of3("法華經授手科", "清", "智祥"), // 清 智祥排
                "X0623", Kind.jinShi.of3("法華經授手", "清", "智祥"), // 清 智祥集
                "X0624", Kind.jinShi.of3("法華經演義科", "清", "廣和"), // 清 廣和標科
                "X0625", Kind.jinShi.of3("法華經演義", "清", "一松", "廣和"), // 清 一松講錄　廣和編定
                "X0626", Kind.jinShi.of3("法華經科拾懸談卷首", "清", "佛閑", "智一"), // 清 佛閑立科　智一拾遺
                "X0627", Kind.jinShi.of3("法華經科拾科", "清", "佛閑", "智一"), // 清 佛閑立科　智一重訂
                "X0628", Kind.jinShi.of3("法華經科拾", "清", "佛閑", "智一"), // 清 佛閑立科　智一拾遺
                "X0629", Kind.jinShi.of3("法華經指掌疏科文", "清", "通理"), // 清 通理述
                "X0630", Kind.jinShi.of3("法華經指掌疏懸示", "清", "通理"), // 清 通理述
                "X0631", Kind.jinShi.of3("法華經指掌疏", "清", "通理"), // 清 通理述
                "X0632", Kind.jinShi.of3("法華經指掌疏事義", "清", "通理"), // 清 通理述
                "X0633", Kind.jinShi.of3("法華經為為章", "唐", "窺基"), // 唐 窺基撰
                "X0636", Kind.jinShi.of3("法華經玄贊攝釋", "唐", "智周"), // 唐 智周撰
                "X0637", Kind.jinShi.of3("法華經玄贊決擇記", "唐", "崇俊", "法清"), // 唐 崇俊撰　法清集疏
                "X0638", Kind.jinShi.of3("法華經玄贊要集", "唐", "栖復"), // 唐 栖復集
                "X0639", Kind.jinShi.of2("法華經玄贊釋"), //
                "X0640", Kind.jinShi.of2("觀音經玄義記會本科"), //
                "X0641", Kind.jinShi.of2("觀音經玄義記條箇"), //
                "X0642", Kind.jinShi.of4("觀音經玄義記會本", new String[]{"隋", "宋"}, "智顗", "知禮"), // 隋 智顗說　宋 知禮述
                "X0643", Kind.jinShi.of2("觀音經義疏記會本科"), //
                "X0644", Kind.jinShi.of2("觀音經義疏記條箇"), //
                "X0645", Kind.jinShi.of4("觀音經義疏記會本", new String[]{"隋", "宋"}, "智顗", "知禮"), // 隋 智顗說　宋 知禮述
                "X0646", Kind.jinShi.of3("觀音經普門品重頌", "宋", "遵式"), // 宋 遵式述
                "X0647", Kind.jinShi.of3("觀音經普門品膚說", "清", "靈耀"), // 清 靈耀說
                "X0648", Kind.jinShi.of3("高王觀音經註釋", "清", "周上智"), // 清 周上智錄出
                "X0649", Kind.jinShi.of2("普賢觀經義疏科"), //
                "X0650", Kind.jinShi.of4("普賢觀經義疏", new String[]{"宋", "日本"}, "本如", "處咸", "亮潤"), // 宋 本如述　處咸續解　日本 亮潤分會
                "X0651", Kind.jinShi.of3("金剛三昧經注解", "明", "圓澄"), // 明 圓澄註
                "X0652", Kind.jinShi.of3("金剛三昧經通宗記", "清", "𧧌震"), // 清 𧧌震述
                "X0656", Kind.jinShi.of4("涅槃經玄義文句", new String[]{"隋", "唐", "日本"}, "灌頂", "道暹", "守篤"), // 隋 灌頂撰　唐 道暹撰　日本 守篤分會
                "X0657", Kind.jinShi.of3("涅槃經治定疏科", "宋", "智圓"), // 宋 智圓撰
                "X0658", Kind.jinShi.of2("涅槃經會疏條箇"), //
                "X0659", Kind.jinShi.of4("涅槃經會疏", new String[]{"隋", "唐", "日本"}, "灌頂", "湛然", "本純"), // 隋 灌頂撰　唐 湛然再治　日本 本純分會
                "X0660", Kind.jinShi.of3("涅槃經疏私記", "唐", "行滿"), // 唐 行滿集
                "X0661", Kind.jinShi.of3("涅槃經疏私記", "唐", "道暹"), // 唐 道暹述
                "X0662", Kind.jinShi.of3("涅槃經疏三德指歸", "宋", "智圓"), // 宋 智圓述
                "X0663", Kind.jinShi.of3("科南本涅槃經", "元", "師正", "可度"), // 元 師正排科　可度重訂
                "X0664", Kind.jinShi.of4("涅槃經會疏解", new String[]{"元", "明"}, "師正", "圓澄"), // 元 師正分科　明 圓澄會疏
                "X0665", Kind.jinShi.of4("遺教經補註", new String[]{"宋", "明"}, "守遂", "了童"), // 宋 守遂註　明 了童補註
                "X0666", Kind.jinShi.of3("遺教經解", "明", "智旭"), // 明 智旭述
                "X0669", Kind.jinShi.of4("四十二章經註", new String[]{"宋", "明"}, "守遂", "了童"), // 宋 守遂註　明 了童補註
                "X0670", Kind.jinShi.of3("四十二章經解", "明", "智旭"), // 明 智旭著
                "X0671", Kind.jinShi.of3("四十二章經疏鈔", "清", "續法"), // 清 續法述
                "X0672", Kind.jinShi.of3("八大人覺經略解", "明", "智旭"), // 明 智旭解
                "X0673", Kind.jinShi.of3("八大人覺經疏", "清", "續法"), // 清 續法述

                "X0674", Kind.lun.of3("閱經十二種", "清", "淨挺"), // 清 淨挺著
                "X0675", Kind.lun.of3("佛祖三經指南", "明", "道霈"), // 明 道霈述

                "X0676", Kind.lvShi.of4("梵網菩薩戒經義疏", new String[]{"隋", "唐"}, "智顗", "灌頂"), // 隋 智顗說　唐 灌頂記
                "X0678", Kind.lvShi.of3("梵網菩薩戒經疏註", "宋", "與咸"), // 宋 與咸(入疏箋經加註釋疏)
                "X0679", Kind.lvShi.of3("梵網菩薩戒經義疏發隱", "明", "袾宏"), // 明 袾宏發隱
                "X0680", Kind.lvShi.of3("梵網菩薩戒經義疏發隱事義", "明", "袾宏"), // 明 袾宏述
                "X0681", Kind.lvShi.of3("梵網菩薩戒經義疏發隱問辯", "明", "袾宏"), // 明 袾宏述
                "X0682", Kind.lvShi.of3("梵網經記", "唐", "傳奧"), // 唐 傳奧述
                "X0683", Kind.lvShi.of3("梵網經菩薩戒本私記", "新羅", "元曉"), // 新羅 元曉造
                "X0686", Kind.lvShi.of3("梵網經菩薩戒本述記", "唐", "勝莊"), // 唐 勝莊撰
                "X0687", Kind.lvShi.of3("梵網經菩薩戒本疏", "唐", "知周"), // 唐 知周撰
                "X0690", Kind.lvShi.of3("梵網經菩薩戒疏", "唐", "法銑"), // 唐 法銑撰
                "X0691", Kind.lvShi.of3("梵網經菩薩戒注", "宋", "慧因"), // 宋 慧因註
                "X0692", Kind.lvShi.of3("菩薩戒疏隨見錄", "明", "今釋"), // 明 今釋造
                "X0693", Kind.lvShi.of3("梵網經玄義", "明", "智旭", "道昉"), // 明 智旭述　道昉訂
                "X0694", Kind.lvShi.of3("梵網經合註", "明", "智旭", "道昉"), // 明 智旭註　道昉訂
                "X0695", Kind.lvShi.of3("梵網經菩薩戒略疏", "明", "弘贊"), // 明 弘贊述
                "X0696", Kind.lvShi.of3("半月誦菩薩戒儀式註", "明", "弘贊"), // 明 弘贊注
                "X0697", Kind.lvShi.of3("梵網經直解", "明", "寂光"), // 明 寂光直解
                "X0698", Kind.lvShi.of2("梵網經直解事義"), //
                "X0699", Kind.lvShi.of3("梵網經順硃", "清", "德玉"), // 清 德玉順硃
                "X0700", Kind.lvShi.of3("梵網經菩薩戒初津", "清", "書玉"), // 清 書玉述
                "X0702", Kind.lvShi.of3("菩薩戒本箋要", "明", "智旭"), // 明 智旭箋
                "X0703", Kind.lvShi.of3("菩薩戒羯磨文釋", "明", "智旭"), // 明 智旭釋

                "X0704", Kind.jinShi.of3("地持論義記", "隋", "慧遠"), // 隋 慧遠述
                "X0705", Kind.jinShi.of3("瓔珞本業經疏", "新羅", "元曉"), // 新羅 元曉撰
                "X0706", Kind.jinShi.of3("十善業道經節要", "清", "蕅益"), // 清 蕅益編訂

                "X0707", Kind.lvShi.of3("新刪定四分僧戒本", "唐", "道宣"), // 唐 道宣刪定
                "X0708", Kind.lvShi.of3("毗尼珍敬錄", "明", "廣承", "智旭"), // 明 廣承輯錄　智旭會補
                "X0709", Kind.lvShi.of3("毗尼止持會集", "清", "讀體"), // 清 讀體集
                "X0712", Kind.lvShi.of3("四分律含注戒本疏發揮記", "宋", "允堪"), // 宋 允堪述
                "X0713", Kind.lvShi.of3("四分律含注戒本疏科", "宋", "元照"), // 宋 元照錄
                "X0714", Kind.lvShi.of4("四分律含注戒本疏行宗記", new String[]{"唐", "宋", "日本"}, "道宣", "元照", "即靜"), // 唐 道宣撰　宋 元照述　日本 即靜分會
                "X0715", Kind.lvShi.of3("釋四分戒本序", "宋", "道言"), // 宋 道言述
                "X0716", Kind.lvShi.of3("四分戒本緣起事義", "明", "廣莫"), // 明 廣莫輯錄
                "X0717", Kind.lvShi.of3("四分戒本如釋", "明", "弘贊"), // 明 弘贊繹
                "X0718", Kind.lvShi.of3("四分戒本約義", "明", "元賢"), // 明 元賢述
                "X0719", Kind.lvShi.of3("重治毗尼事義集要", "明", "智旭"), // 明 智旭輯繹
                "X0720", Kind.lvShi.of3("毗尼關要", "清", "德基"), // 清 德基輯
                "X0721", Kind.lvShi.of3("毗尼關要事義", "清", "德基"), // 清 德基輯
                "X0722", Kind.lvShi.of3("四分刪定比丘尼戒本", "宋", "元照"), // 宋 元照重定
                "X0723", Kind.lvShi.of3("四分比丘尼鈔科", "宋", "允堪"), // 宋 允堪述
                "X0724", Kind.lvShi.of3("四分比丘尼鈔", "唐", "道宣"), // 唐 道宣述
                "X0725", Kind.lvShi.of3("式叉摩那尼戒本", "明", "弘贊"), // 明 弘贊輯
                "X0726", Kind.lvShi.of3("四分律隨機羯磨疏正源記", "宋", "允堪"), // 宋 允堪述
                "X0727", Kind.lvShi.of3("四分律刪補隨機羯磨疏科", "宋", "元照"), // 宋 元照錄
                "X0728", Kind.lvShi.of4("四分律刪補隨機羯磨疏濟緣記", new String[]{"唐", "宋", "日本"}, "道宣", "元照", "禪能"), // 唐 道宣疏　宋 元照述　日本 禪能合會
                "X0729", Kind.lvShi.of3("羯磨經序解", "宋", "則安"), // 宋 則安述
                "X0730", Kind.lvShi.of4("毗尼作持續釋", new String[]{"唐", "清"}, "道宣", "讀體"), // 唐 道宣撰集　清 讀體續釋
                "X0731", Kind.lvShi.of3("四分律疏", "唐", "法礪"), // 唐 法礪撰述
                "X0732", Kind.lvShi.of3("四分律搜玄錄", "唐", "志鴻"), // 唐 志鴻撰述
                "X0733", Kind.lvShi.of3("四分律疏飾宗義記", "唐", "定賓"), // 唐 定賓作
                "X0734", Kind.lvShi.of3("四分律疏", "唐", "智首"), // 唐 智首撰
                "X0735", Kind.lvShi.of3("四分律開宗記", "唐", "懷素"), // 唐 懷素撰
                "X0736", Kind.lvShi.of3("四分律行事鈔批", "唐", "大覺"), // 唐 大覺撰
                "X0737", Kind.lvShi.of3("四分律行事鈔簡正記", "後唐", "景霄"), // 後唐 景霄纂
                "X0738", Kind.lvShi.of3("四分律行事鈔科", "宋", "元照"), // 宋 元照錄
                "X0740", Kind.lvShi.of3("資持記序解并五例講義", "宋", "則安"), // 宋 則安述
                "X0741", Kind.lvShi.of4("行事鈔諸家記標目", new String[]{"宋", "日本"}, "慧顯", "戒月"), // 宋 慧顯集　日本 戒月改錄
                "X0742", Kind.lvShi.of3("資持記立題拾義", "宋", "道標"), // 宋 道標出
                "X0743", Kind.lvShi.of3("毗尼討要", "唐", "玄惲"), // 唐 玄惲纂
                "X0744", Kind.lvShi.of3("四分律名義標釋", "明", "弘贊"), // 明 弘贊輯
                "X0745", Kind.lvShi.of3("四分律藏大小持戒犍度略釋", "明", "智旭"), // 明 智旭釋
                "X0746", Kind.lvShi.of3("四分律拾毗尼義鈔科", "宋", "元照"), // 宋 元照錄
                "X0747", Kind.lvShi.of3("四分律拾毗尼義鈔", "唐", "道宣"), // 唐 道宣撰
                "X0748", Kind.lvShi.of3("四分律拾毗尼義鈔輔要記", "宋", "允堪"), // 宋 允堪述
                "X0749", Kind.lvShi.of3("佛說齋經科註", "明", "智旭"), // 明 智旭科註

                "X0750", Kind.jinShi.of3("佛說目連五百問經略解", "明", "性祇"), // 明 性祇述
                "X0751", Kind.jinShi.of3("佛說目連五百問戒律中輕重事經釋", "明", "永海"), // 明 永海述

                "X0753", Kind.lunShi.of3("十地經論義記", "隋", "慧遠"), // 隋 慧遠撰
                "X0754", Kind.lunShi.of3("起信論一心二門大意", "陳", "智愷"), // 陳 智愷作
                "X0755", Kind.lunShi.of3("起信論義疏", "隋", "曇延"), // 隋 曇延撰
                "X0757", Kind.lunShi.of3("起信論疏記", "新羅", "元曉"), // 新羅 元曉疏並別記
                "X0759", Kind.lunShi.of3("起信論同異集", "唐", "見登"), // 唐 見登集
                "X0762", Kind.lunShi.of3("起信論纂註", "明", "真界"), // 明 真界纂註
                "X0763", Kind.lunShi.of3("起信論捷要", "明", "正遠"), // 明 正遠註
                "X0764", Kind.lunShi.of3("起信論續疏", "明", "通潤"), // 明 通潤述疏
                "X0765", Kind.lunShi.of4("大乘起信論疏略", new String[]{"唐", "明"}, "法藏", "德清"), // 唐 法藏造疏　明 德清纂略
                "X0766", Kind.lunShi.of3("起信論直解", "明", "德清"), // 明 德清述
                "X0767", Kind.lunShi.of2("起信論疏記會閱卷首"), //
                "X0768", Kind.lunShi.of3("起信論疏記會閱", "清", "續法"), // 清 續法會編
                "X0770", Kind.lunShi.of3("釋摩訶衍論記", "唐", "聖法"), // 唐 聖法鈔
                "X0771", Kind.lunShi.of3("釋摩訶衍論疏", "唐", "法敏"), // 唐 法敏集
                "X0772", Kind.lunShi.of3("釋摩訶衍論贊玄疏", "宋", "法悟"), // 宋 法悟撰
                "X0773", Kind.lunShi.of3("釋摩訶衍論科", "宋", "普觀"), // 宋 普觀治定
                "X0774", Kind.lunShi.of3("釋摩訶衍論記", "宋", "普觀"), // 宋 普觀述
                "X0775", Kind.lunShi.of3("釋摩訶衍論通玄鈔", "遼", "志福"), // 遼 志福撰
                "X0776", Kind.lunShi.of3("大宗地玄文本論略註", "清", "楊文會"), // 清 楊文會略註
                "X0777", Kind.lunShi.of3("金剛頂菩提心論略記", "唐", "遍滿"), // 唐 遍滿撰
                "X0784", Kind.lunShi.of3("大乘四論玄義", "唐", "均正"), // 唐 均正撰
                "X0786", Kind.lunShi.of3("大乘法界無差別論疏領要鈔科", "宋", "普觀"), // 宋 普觀錄
                "X0787", Kind.lunShi.of3("大乘法界無差別論疏領要鈔", "宋", "普觀"), // 宋 普觀述
                "X0788", Kind.lunShi.of2("掌珍論疏"), //
                "X0790", Kind.lunShi.of3("法華經論述記", "唐"), // 唐
                "X0791", Kind.lunShi.of3("大智度論疏", "南北朝", "慧影"), // 南北朝 慧影抄撰
                "X0794", Kind.lunShi.of3("瑜伽論劫章頌", "唐", "窺基"), // 唐 窺基撰
                "X0796", Kind.lunShi.of3("雜集論述記", "唐", "窺基"), // 唐 窺基撰
                "X0797", Kind.lunShi.of3("中邊分別論疏", "新羅", "元曉"), // 新羅 元曉撰
                "X0799", Kind.lunShi.of3("百法論顯幽鈔", "宋", "從芳"), // 宋 從芳述
                "X0802", Kind.lunShi.of3("百法明門論論義", "明", "德清"), // 明 德清述
                "X0803", Kind.lunShi.of3("百法明門論纂", "明", "廣益"), // 明 廣益纂釋
                "X0804", Kind.lunShi.of4("百法明門論贅言", new String[]{"唐", "明"}, "窺基", "明昱"), // 唐 窺基解　明 明昱贅言
                "X0805", Kind.lunShi.of3("百法明門論直解", "明", "智旭"), // 明 智旭解
                "X0806", Kind.lunShi.of3("成唯識論料簡", "唐", "窺基"), // 唐 窺基撰
                "X0808", Kind.lunShi.of3("成唯識論別抄", "唐", "窺基"), // 唐 窺基撰
                "X0810", Kind.lunShi.of3("成唯識論掌中樞要記", "唐", "智周"), // 唐 智周述
                "X0812", Kind.lunShi.of3("成唯識論了義燈記", "唐", "智周"), // 唐 智周撰
                "X0814", Kind.lunShi.of3("成唯識論義蘊", "唐", "道邑"), // 唐 道邑撰
                "X0815", Kind.lunShi.of3("成唯識論疏義演", "唐", "如理"), // 唐 如理集
                "X0816", Kind.lunShi.of3("成唯識論演秘釋", "唐", "如理"), // 唐 如理撰
                "X0817", Kind.lunShi.of2("註成唯識論"), //
                "X0818", Kind.lunShi.of3("成唯識論學記", "新羅", "太賢"), // 新羅 太賢集
                "X0819", Kind.lunShi.of3("成唯識論疏抄", "唐", "靈泰"), // 唐 靈泰撰
                "X0820", Kind.lunShi.of3("成唯識論俗詮", "明", "明昱"), // 明 明昱俗詮
                "X0821", Kind.lunShi.of3("成唯識論集解", "明", "通潤"), // 明 通潤集解
                "X0822", Kind.lunShi.of3("成唯識論證義", "明", "王肯堂"), // 明 王肯堂證義
                "X0823", Kind.lunShi.of3("成唯識論自攷", "明", "大惠"), // 明 大惠錄
                "X0824", Kind.lunShi.of3("成唯識論觀心法要", "明", "智旭"), // 明 智旭述
                "X0825", Kind.lunShi.of3("成唯識論音響補遺科", "清", "智素"), // 清 智素科
                "X0826", Kind.lunShi.of3("成唯識論音響補遺", "清", "智素"), // 清 智素補遺
                "X0827", Kind.lunShi.of3("唯識三十論約意", "明", "明昱"), // 明 明昱約意
                "X0828", Kind.lunShi.of3("唯識三十論直解", "明", "智旭"), // 明 智旭解
                "X0830", Kind.lunShi.of3("觀所緣緣論會釋", "明", "明昱"), // 明 明昱會釋
                "X0831", Kind.lunShi.of3("觀所緣緣論直解", "明", "智旭"), // 明 智旭解
                "X0832", Kind.lunShi.of3("觀所緣緣論釋記", "明", "明昱"), // 明 明昱錄記
                "X0833", Kind.lunShi.of3("觀所緣緣論釋直解", "明", "智旭"), // 明 智旭解
                "X0836", Kind.lunShi.of3("俱舍論疏", "唐", "神泰"), // 唐 神泰述
                "X0837", Kind.lunShi.of3("俱舍論法宗原", "唐", "普光"), // 唐 普光撰
                "X0838", Kind.lunShi.of3("俱舍論頌疏序記", "唐", "法盈"), // 唐 法盈修
                "X0839", Kind.lunShi.of3("俱舍論頌疏義鈔", "唐", "慧暉"), // 唐 慧暉述
                "X0841", Kind.lunShi.of3("俱舍論頌疏記", "唐", "遁麟"), // 唐 遁麟述
                "X0842", Kind.lunShi.of2("俱舍論頌疏", "某補"), // 某補作
                "X0843", Kind.lunShi.of3("順正理論述文記", "唐", "元瑜"), // 唐 元瑜述
                "X0844", Kind.lunShi.of3("異部宗輪論疏述記", "唐", "窺基"), // 唐 窺基記
                "X0845", Kind.lunShi.of3("遺教經論住法記", "宋", "元照"), // 宋 元照述
                "X0846", Kind.lunShi.of3("遺教經論記", "宋", "觀復"), // 宋 觀復述
                "X0847", Kind.lunShi.of3("因明入正理門論述記", "唐", "神泰"), // 唐 神泰述
                "X0848", Kind.lunShi.of3("因明入正理論疏", "唐", "文軌"), // 唐 文軌述
                "X0852", Kind.lunShi.of3("因明入正理論續疏", "唐", "慧沼"), // 唐 慧沼述
                "X0853", Kind.lunShi.of3("因明入正理論疏前記", "唐", "智周"), // 唐 智周撰
                "X0854", Kind.lunShi.of3("因明入正理論疏後記", "唐", "智周"), // 唐 智周撰
                "X0855", Kind.lunShi.of3("因明入正理論疏抄", "唐", "智周"), // 唐 智周撰
                "X0856", Kind.lunShi.of3("因明入正理論解", "明", "真界"), // 明 真界集解
                "X0857", Kind.lunShi.of3("因明入正理論集解", "明", "王肯堂"), // 明 王肯堂集釋
                "X0858", Kind.lunShi.of3("因明入正理論直疏", "明", "明昱"), // 明 明昱疏
                "X0859", Kind.lunShi.of3("因明入正理論直解", "明", "智旭"), // 明 智旭述

                "X0860", Kind.lun.of3("判比量論", "新羅", "元曉"), // 新羅 元曉述
                "X0861", Kind.lun.of4("三支比量義鈔", new String[]{"唐", "宋", "明"}, "玄奘", "延壽", "明昱"), // 唐 玄奘立　宋 延壽造　明 明昱鈔
                "X0862", Kind.lun.of3("真唯識量略解", "明", "智旭"), // 明 智旭略解
                "X0866", Kind.lun.of3("肇論疏", "晉", "惠達"), // 晉 惠達撰
                "X0868", Kind.lun.of3("肇論疏科", "宋", "遵式"), // 宋 遵式排定
                "X0869", Kind.lun.of3("夾科肇論序注", "宋", "曉月"), // 宋 曉月注
                "X0870", Kind.lun.of3("注肇論疏", "宋", "遵式"), // 宋 遵式述
                "X0872", Kind.lun.of3("肇論新疏游刃", "宋", "文才"), // 宋 文才述
                "X0873", Kind.lun.of3("肇論略註", "明", "德清"), // 明 德清述
                "X0876", Kind.lun.of3("三論略章", "隋", "吉藏"), // 隋 吉藏撰
                "X0878", Kind.lun.of3("物不遷正量證", "明", "道衡"), // 明 道衡述
                "X0879", Kind.lun.of3("物不遷正量論", "明", "鎮澄"), // 明 鎮澄著
                "X0880", Kind.lun.of3("物不遷論辯解", "明", "真界"), // 明 真界解
                "X0882", Kind.lun.of3("大乘法苑義林章補闕", "唐", "慧沼"), // 唐 慧沼撰
                "X0883", Kind.lun.of3("大乘法苑義林章決擇記", "唐", "智周"), // 唐 智周撰
                "X0884", Kind.lun.of3("表無表章栖翫記", "宋", "守千"), // 宋 守千述
                "X0888", Kind.lun.of3("唯識開蒙問答", "元", "雲峯"), // 元 雲峯集
                "X0890", Kind.lun.of3("八識規矩補註證義", "明", "明昱"), // 明 明昱證義
                "X0891", Kind.lun.of3("八識規矩略說", "明", "正誨"), // 明 正誨略說
                "X0892", Kind.lun.of3("八識規矩頌解", "明", "真可"), // 明 真可述
                "X0893", Kind.lun.of3("八識規矩通說", "明", "德清"), // 明 德清述
                "X0894", Kind.lun.of3("八識規矩纂釋", "明", "廣益"), // 明 廣益纂釋
                "X0895", Kind.lun.of3("八識規矩直解", "明", "智旭"), // 明 智旭解
                "X0896", Kind.lun.of3("八識規矩淺說", "清", "行舟"), // 清 行舟說
                "X0897", Kind.lun.of3("八識規矩頌注", "清", "行舟"), // 清 行舟註
                "X0898", Kind.lun.of3("八識規矩論義", "清", "性起", "善漳"), // 清 性起論釋　善漳等錄
                "X0899", Kind.lun.of3("相宗八要", "明", "洪恩"), // 明 洪恩輯
                "X0900", Kind.lun.of3("相宗八要解", "明", "明昱"), // 明 明昱著
                "X0901", Kind.lun.of3("相宗八要直解", "明", "智旭"), // 明 智旭解
                "X0902", Kind.lun.of3("一乘佛性究竟論", "唐", "法寶"), // 唐 法寶述
                "X0903", Kind.lun.of3("隨自意三昧", "隋", "慧思"), // 隋 慧思撰
                "X0904", Kind.lun.of3("大乘止觀法門宗圓記", "宋", "了然"), // 宋 了然述
                "X0905", Kind.lun.of3("大乘止觀法門釋要", "明", "智旭"), // 明 智旭述
                "X0907", Kind.lun.of3("禪門章", "隋", "智顗"), // 隋 智顗說
                "X0908", Kind.lun.of3("禪門要略", "隋", "智顗"), // 隋 智顗出
                "X0909", Kind.lun.of3("三觀義", "隋", "智顗"), // 隋 智顗撰
                "X0911", Kind.lun.of3("觀心食法", "隋", "智顗"), // 隋 智顗述
                "X0912", Kind.lun.of4("觀心誦經法記", new String[]{"隋", "唐"}, "智顗", "湛然"), // 隋 智顗說　唐 湛然述
                "X0913", Kind.lun.of3("天台智者大師發願文", "隋", "智顗"), // 隋 智顗撰
                "X0914", Kind.lun.of3("普賢菩薩發願文", "隋", "智顗"), // 隋 智顗撰
                "X0915", Kind.lun.of3("刪定止觀", "唐", "梁肅"), // 唐 梁肅述
                "X0916", Kind.lun.of3("天台智者大師傳論", "唐", "梁肅"), // 唐 梁肅述
                "X0917", Kind.lun.of3("止觀科節", "唐", "法藏"), // 唐 法藏撰
                "X0918", Kind.lun.of3("止觀記中異義", "唐", "道邃", "乾淑"), // 唐 道邃說　乾淑集
                "X0919", Kind.lun.of3("止觀輔行搜要記", "唐", "湛然"), // 唐 湛然述
                "X0920", Kind.lun.of3("止觀輔行助覽", "宋", "有嚴"), // 宋 有嚴注
                "X0921", Kind.lun.of3("摩訶止觀義例纂要", "宋", "從義"), // 宋 從義撰
                "X0922", Kind.lun.of3("摩訶止觀義例科", "宋", "從義"), // 宋 從義排
                "X0923", Kind.lun.of3("摩訶止觀義例隨釋", "宋", "處元"), // 宋 處元述
                "X0924", Kind.lun.of4("摩訶止觀貫義科", new String[]{"明", "清"}, "天溪", "靈耀"), // 明 天溪說　清 靈耀補定
                "X0925", Kind.lun.of3("十不二門義", "唐", "道邃"), // 唐 道邃錄出
                "X0926", Kind.lun.of3("法華十妙不二門示珠指", "宋", "源清"), // 宋 源清述
                "X0927", Kind.lun.of3("註法華本迹十不二門", "宋", "宗翌"), // 宋 宗翌述
                "X0928", Kind.lun.of3("十不二門文心解", "宋", "仁岳"), // 宋 仁岳述
                "X0929", Kind.lun.of3("法華玄記十不二門顯妙", "宋", "處謙"), // 宋 處謙述
                "X0930", Kind.lun.of3("十不二門樞要", "宋", "了然"), // 宋 了然述
                "X0931", Kind.lun.of4("十不二門指要鈔詳解", new String[]{"宋", "明"}, "可度", "正謐"), // 宋 可度詳解　明 正謐分會
                "X0932", Kind.lun.of4("金剛錍論私記", new String[]{"唐", "日本"}, "明曠", "辯才"), // 唐 明曠記　日本 辯才會
                "X0933", Kind.lun.of3("金剛錍科", "宋", "淨岳"), // 宋 仁岳撰
                "X0934", Kind.lun.of3("金剛錍科", "宋", "智圓"), // 宋 智圓集
                "X0935", Kind.lun.of3("金剛錍顯性錄", "宋", "智圓"), // 宋 智圓集
                "X0936", Kind.lun.of3("金剛錍論義解", "宋", "善月"), // 宋 善月述
                "X0937", Kind.lun.of4("金剛錍論釋文", new String[]{"宋", "明"}, "時舉", "海眼"), // 宋 時舉釋　明 海眼會
                "X0938", Kind.lun.of3("始終心要注", "宋", "從義"), // 宋 從義注
                "X0939", Kind.lun.of3("法華五百問論", "唐", "湛然"), // 唐 湛然述
                "X0940", Kind.lun.of3("學天台宗法門大意", "唐", "行滿"), // 唐 行滿述
                "X0941", Kind.lun.of3("六即義", "唐", "行滿"), // 唐 行滿述
                "X0942", Kind.lun.of4("天台宗未決（附釋疑）", new String[]{"日本", "唐"}, "最澄", "圓澄", "義真", "光定", "德圓", "道邃", "廣修", "維蠲", "宗頴"), // 日本 最澄．圓澄．義真．光定．德圓 問　唐 道邃．廣修．維蠲．宗頴 答
                "X0943", Kind.lun.of3("法華龍女成佛權實義", "宋", "源清"), // 宋 源清述
                "X0944", Kind.lun.of3("寶雲振祖集", "宋", "宗曉"), // 宋 宗曉編
                "X0946", Kind.lun.of3("螺溪振祖集", "宋", "元悟"), // 宋 元悟編
                "X0948", Kind.lun.of3("四明仁岳異說叢書", "宋", "繼忠"), // 宋 繼忠集
                "X0949", Kind.lun.of3("閑居編", "宋", "智圓"), // 宋 智圓著
                "X0950", Kind.lun.of3("金園集", "宋", "遵式", "慧觀"), // 宋 遵式述　慧觀重編
                "X0951", Kind.lun.of3("天竺別集", "宋", "遵式", "慧觀"), // 宋 遵式述　慧觀重編
                "X0952", Kind.lun.of3("重編天台諸文類集", "宋", "如吉"), // 宋 如吉編
                "X0953", Kind.lun.of3("別傳心法議", "宋", "戒珠"), // 宋 戒珠撰
                "X0954", Kind.lun.of3("三千有門頌略解", "明", "真覺"), // 明 真覺略解
                "X0955", Kind.lun.of3("復宗集", "宋", "與咸"), // 宋 與咸述
                "X0956", Kind.lun.of3("山家義苑", "宋", "可觀", "智增"), // 宋 可觀述　智增證
                "X0957", Kind.lun.of3("竹菴艸錄", "宋", "可觀"), // 宋 可觀撰
                "X0958", Kind.lun.of3("圓頓宗眼", "宋", "法登"), // 宋 法登述
                "X0959", Kind.lun.of3("議中興教觀", "宋", "法登"), // 宋 法登述
                "X0960", Kind.lun.of3("三教出興頌註", "宋", "宗曉"), // 宋 宗曉注
                "X0961", Kind.lun.of3("施食通覽", "宋", "宗曉"), // 宋 宗曉編
                "X0962", Kind.lun.of3("不可剎那無此君", "宋", "義銛"), // 宋 義銛述
                "X0963", Kind.lun.of3("北峯教義", "宋", "宗印"), // 宋 宗印撰
                "X0964", Kind.lun.of3("台宗十類因革論", "宋", "善月"), // 宋 善月述
                "X0965", Kind.lun.of3("山家緒餘集", "宋", "善月"), // 宋 善月述
                "X0966", Kind.lun.of3("台宗精英集", "宋", "普容"), // 宋 普容集
                "X0967", Kind.lun.of3("教觀撮要論", "宋"), // 宋
                "X0968", Kind.lun.of3("增修教苑清規", "元", "自慶"), // 元 自慶編述
                "X0969", Kind.lun.of3("天台傳佛心印記註", "明", "傳燈"), // 明 傳燈註
                "X0970", Kind.lun.of3("性善惡論", "明", "傳燈"), // 明 傳燈註
                "X0971", Kind.lun.of3("書", "明", "克勤"), // 明 克勤著
                "X0972", Kind.lun.of3("法界安立圖", "明", "仁潮"), // 明 仁潮錄
                "X0974", Kind.lun.of3("教觀綱宗釋義", "明", "智旭"), // 明 智旭述
                "X0975", Kind.lun.of3("隨緣集", "清", "靈耀"), // 清 靈耀著
                "X0976", Kind.lun.of3("四教儀集解", "宋", "從義"), // 宋 從義撰
                "X0977", Kind.lun.of3("四教儀備釋", "元", "元粹"), // 元 元粹述
                "X0978", Kind.lun.of3("四教儀集註科", "元", "蒙潤"), // 元 蒙潤排定
                "X0979", Kind.lun.of3("四教儀集註節義", "清", "靈耀"), // 清 靈耀節
                "X0980", Kind.lun.of3("四教儀註彙補輔宏記", "清", "性權"), // 清 性權記
                "X0985", Kind.lun.of3("華嚴融會一乘義章明宗記", "宋", "師會"), // 宋 師會述
                "X0991", Kind.lun.of3("華嚴經普賢觀行法門", "唐", "法藏"), // 唐 法藏撰
                "X0993", Kind.lun.of3("華嚴還源觀科", "宋", "淨源"), // 宋 淨源刊正
                "X0994", Kind.lun.of3("華嚴妄盡還源觀疏鈔補解", "宋", "淨源"), // 宋 淨源述
                "X0995", Kind.lun.of3("華嚴一乘教義分齊章義苑疏", "宋", "道亭"), // 宋 道亭述
                "X0996", Kind.lun.of3("華嚴一乘教義分齊章焚薪", "宋", "師會"), // 宋 師會錄
                "X0997", Kind.lun.of3("華嚴一乘教義分齊章科", "宋", "師會"), // 宋 師會述
                "X0998", Kind.lun.of3("華嚴一乘教義分齊章復古記", "宋", "師會", "善熹"), // 宋 師會．善熹述
                "X0999", Kind.lun.of3("五教章集成記", "宋", "希迪"), // 宋 希迪述
                "X1000", Kind.lun.of3("評復古記", "宋", "希迪"), // 宋 希迪錄
                "X1004", Kind.lun.of3("五蘊觀", "唐", "澄觀"), // 唐 澄觀述
                "X1005", Kind.lun.of3("華嚴心要法門註", "唐", "宗密"), // 唐 宗密述
                "X1007", Kind.lun.of3("註華嚴法界觀科文", "唐", "宗密"), // 唐 宗密述
                "X1008", Kind.lun.of3("註華嚴法界觀科文", "唐", "宗豫"), // 唐 宗豫述
                "X1010", Kind.lun.of3("勸發菩提心文", "唐", "裴休"), // 唐 裴休述
                "X1013", Kind.lun.of3("華嚴法相槃節", "宋", "道通"), // 宋 道通述
                "X1014", Kind.lun.of3("法界觀披雲集", "宋", "道通"), // 宋 道通述
                "X1015", Kind.lun.of3("圓宗文類", "高麗", "義天"), // 高麗 義天集
                "X1016", Kind.lun.of3("註華嚴同教一乘策", "宋", "師會", "希迪"), // 宋 師會述　希迪註
                "X1017", Kind.lun.of3("註同教問答", "宋", "師會", "善熹"), // 宋 師會述　善熹註
                "X1018", Kind.lun.of3("評金剛錍", "宋", "善熹"), // 宋 善熹述
                "X1019", Kind.lun.of3("辨非集", "宋", "善熹"), // 宋 善熹述
                "X1020", Kind.lun.of3("斥謬", "宋", "善熹"), // 宋 善熹書
                "X1022", Kind.lun.of3("五相智識頌", "宋", "佚名"), // 宋 佚名撰
                "X1023", Kind.lun.of3("華嚴大意", "明", "善堅"), // 明 善堅撰
                "X1024", Kind.lun.of3("賢首五教儀", "清", "續法"), // 清 續法集錄
                "X1025", Kind.lun.of3("賢首五教儀開蒙", "清", "續法"), // 清 續法集
                "X1026", Kind.lun.of3("賢首五教斷證三覺揀濫圖", "清", "續法"), // 清 續法集
                "X1027", Kind.lun.of3("法界宗蓮花章", "清", "續法"), // 清 續法集
                "X1028", Kind.lun.of3("華嚴鏡燈章", "清", "續法"), // 清 續法集
                "X1029", Kind.lun.of3("一乘決疑論", "清", "彭際清"), // 清 彭際清述
                "X1030", Kind.lun.of3("華嚴念佛三昧論", "清", "彭際清"), // 清 彭際清述
                "X1031", Kind.lun.of3("華嚴原人論發微錄", "宋", "淨源"), // 宋 淨源述
                "X1032", Kind.lun.of3("華嚴原人論解", "元", "圓覺"), // 元 圓覺解
                "X1033", Kind.lun.of4("華嚴原人論合解", new String[]{"元", "明"}, "圓覺", "楊嘉祚"), // 元 圓覺解　明 楊嘉祚刪合
                "X1043", Kind.lun.of3("看命一掌金", "唐", "一行"), // 唐 一行著

                "X1048", Kind.yiGui.of3("持咒仙人飛鉢儀軌", "唐", "不空"), // 唐 不空拔出

                "X1052", Kind.lun.of3("成就夢想法", "唐", "不空"), // 唐 不空述
                "X1054", Kind.lun.of3("多利心菩薩念誦法", "南天竺", "跋折羅菩提"), // 南天竺 跋折羅菩提集撰
                "X1069", Kind.lun.of3("釋迦牟尼如來拔除苦惱現大神變飛空大鉢法", "唐", "般若"), // 唐 般若傳
                "X1073", Kind.lun.of3("金胎兩界師資相承", "唐", "海雲"), // 唐 海雲集
                "X1074", Kind.lun.of3("胎金兩界血脈", "唐", "造玄"), // 唐 造玄增補
                "X1077", Kind.lun.of3("準提淨業", "明", "謝于教"), // 明 謝于教著
                "X1078", Kind.lun.of3("準提心要", "明", "施堯挺"), // 明 施堯挺撰
                "X1079", Kind.lun.of3("持誦準提真言法要", "清", "弘贊"), // 清 弘贊輯

                "X1080", Kind.yiGui.of3("瑜伽集要施食儀軌", "明", "袾宏"), // 明 袾宏重訂
                "X1081", Kind.yiGui.of3("修設瑜伽集要施食壇儀", "明", "袾宏"), // 明 袾宏補註
                "X1082", Kind.yiGui.of3("於密滲施食旨槩", "清", "法藏"), // 清 法藏著
                "X1083", Kind.yiGui.of3("修習瑜伽集要施食壇儀", "清", "法藏"), // 清 法藏著
                "X1084", Kind.yiGui.of3("瑜伽燄口註集纂要儀軌", "清", "寂暹"), // 清 寂暹纂

                "X1085", Kind.lvShi.of3("受菩薩戒儀", "陳", "慧思"), // 陳 慧思撰
                "X1086", Kind.lvShi.of3("授菩薩戒儀", "唐", "湛然"), // 唐 湛然述
                "X1087", Kind.lvShi.of3("略授三歸五八戒並菩薩戒", "唐", "澄照"), // 唐 澄照讚
                "X1088", Kind.lvShi.of3("受菩薩戒法", "宋", "延壽"), // 宋 延壽撰

                "X1094", Kind.lun.of3("釋門歸敬儀護法記", "宋", "彥起"), // 宋 彥起撰
                "X1095", Kind.lun.of4("釋門歸敬儀通真記", new String[]{"宋", "日本"}, "了然", "慧光"), // 宋 了然述　日本 慧光合
                "X1096", Kind.lun.of4("淨心誡觀法發真鈔", new String[]{"宋", "日本"}, "允堪", "慧光"), // 宋 允堪述　日本 慧光合
                "X1097", Kind.lun.of4("釋門章服儀應法記", new String[]{"宋", "日本"}, "元照", "良信"), // 宋 元照述　日本 良信合

                "X1098", Kind.lvShi.of3("衣鉢名義章", "宋", "允堪"), // 宋 允堪述
                "X1099", Kind.lvShi.of3("新受戒比丘六念五觀法", "宋", "允堪"), // 宋 允堪撰錄
                "X1100", Kind.lvShi.of3("道具賦", "宋", "元照"), // 宋 元照撰
                "X1102", Kind.lvShi.of3("佛制六物圖辯訛", "宋", "妙生"), // 宋 妙生述
                "X1103", Kind.lvShi.of3("三衣顯正圖", "宋", "妙生"), // 宋 妙生述
                "X1104", Kind.lvShi.of3("芝園遺編", "宋", "元照", "道詢"), // 宋 元照錄　道詢集
                "X1105", Kind.lvShi.of3("芝園集", "宋", "元照"), // 宋 元照作
                "X1106", Kind.lvShi.of3("補續芝園集", "宋", "元照"), // 宋 元照撰
                "X1107", Kind.lvShi.of3("律宗新學名句", "宋", "惟顯"), // 宋 惟顯編
                "X1108", Kind.lvShi.of4("律宗問答", new String[]{"日本", "宋"}, "俊芿", "了然", "智瑞", "妙音"), // 日本 俊艿問　宋 了然．智瑞．妙音答
                "X1109", Kind.lvShi.of3("終南家業", "宋", "守一", "行枝"), // 宋 守一述　行枝編
                "X1110", Kind.lvShi.of3("律宗會元", "宋", "守一"), // 宋 守一集
                "X1111", Kind.lvShi.of3("蓬折直辨", "宋", "妙蓮"), // 宋 妙蓮撰
                "X1112", Kind.lvShi.of3("蓬折箴", "宋", "妙蓮"), // 宋 妙蓮撰
                "X1113", Kind.lvShi.of3("律苑事規", "元", "省悟", "嗣良"), // 元 省悟編述　嗣良參訂
                "X1114", Kind.lvShi.of3("毗尼日用錄", "明", "性祇"), // 明 性祇述
                "X1115", Kind.lvShi.of3("毗尼日用切要", "清", "讀體"), // 清 讀體彙集
                "X1116", Kind.lvShi.of3("毗尼日用切要香乳記", "清", "書玉"), // 清 書玉箋記
                "X1117", Kind.lvShi.of3("沙門日用", "清", "弘贊"), // 清 弘贊編
                "X1118", Kind.lvShi.of3("沙彌律儀要略增註", "清", "弘贊"), // 清 弘贊註
                "X1119", Kind.lvShi.of3("沙彌律儀要略述義", "清", "書玉"), // 清 書玉科釋
                "X1120", Kind.lvShi.of3("沙彌律儀毗尼日用合參", "清", "戒顯", "濟岳"), // 清 戒顯訂閱　濟岳彙箋
                "X1121", Kind.lvShi.of3("沙彌十戒威儀錄要", "明", "智旭"), // 明 智旭重輯
                "X1122", Kind.lvShi.of3("沙彌尼律儀要略", "清", "讀體"), // 清 讀體輯集
                "X1123", Kind.lvShi.of4("在家律要廣集", new String[]{"明", "清"}, "智旭", "儀潤", "陳熙願"), // 明 智旭集　清 儀潤．陳熙願增訂
                "X1124", Kind.lvShi.of3("律要後集", "明", "智旭"), // 明 智旭集
                "X1125", Kind.lvShi.of3("律學發軔", "明", "元賢"), // 明 元賢述
                "X1126", Kind.lvShi.of3("弘戒法儀", "明", "法藏"), // 明 法藏輯
                "X1127", Kind.lvShi.of4("傳授三壇弘戒法儀", new String[]{"明", "清"}, "法藏", "超遠"), // 明 法藏撰集　清 超遠檢錄
                "X1128", Kind.lvShi.of3("傳戒正範", "清", "讀體"), // 清 讀體撰
                "X1129", Kind.lvShi.of3("歸戒要集", "清", "弘贊"), // 清 弘贊輯
                "X1130", Kind.lvShi.of3("八關齋法", "清", "弘贊"), // 清 弘贊輯
                "X1131", Kind.lvShi.of3("比丘受戒錄", "清", "弘贊"), // 清 弘贊述
                "X1132", Kind.lvShi.of3("比丘尼受戒錄", "清", "弘贊"), // 清 弘贊述
                "X1133", Kind.lvShi.of3("沙彌學戒儀軌頌註", "清", "弘贊"), // 清 弘贊述並註
                "X1134", Kind.lvShi.of3("二部僧授戒儀式", "清", "書玉"), // 清 書玉述
                "X1135", Kind.lvShi.of3("羯磨儀式", "清", "書玉"), // 清 書玉述
                "X1136", Kind.lvShi.of3("經律戒相布薩軌儀", "明", "如馨"), // 明 如馨纂要
                "X1137", Kind.lvShi.of3("梵網經懺悔行法", "明", "智旭"), // 明 智旭述
                "X1138", Kind.lvShi.of3("戒殺四十八問", "清", "周思仁"), // 清 周思仁述

                "X1139", Kind.lun.of3("體仁要術", "清", "彭紹升"), // 清 彭紹升著
                "X1145", Kind.lun.of2("西方要決科註"), //
                "X1149", Kind.lun.of3("注十疑論", "宋", "澄彧"), // 宋 澄彧註
                "X1154", Kind.lun.of3("淨土指歸集", "明", "大佑"), // 明 大佑集
                "X1155", Kind.lun.of3("淨土簡要錄", "明", "道衍"), // 明 道衍編
                "X1156", Kind.lun.of3("歸元直指集", "明", "宗本"), // 明 宗本集
                "X1157", Kind.lun.of3("淨土決", "明", "李贄"), // 明 李贄集
                "X1158", Kind.lun.of3("答四十八問", "明", "袾宏"), // 明 袾宏著
                "X1160", Kind.lun.of3("西方願文", "明", "袾宏"), // 明 袾宏著並釋
                "X1161", Kind.lun.of3("西方發願文註", "清", "實賢"), // 清 實賢註
                "X1162", Kind.lun.of3("淨土資糧全集", "明", "袾宏", "莊廣還"), // 明 袾宏校正　莊廣還輯
                "X1163", Kind.lun.of3("西方直指", "明", "一念"), // 明 一念編
                "X1164", Kind.lun.of3("淨土十要", "明", "成時"), // 明 成時(評點節要)
                "X1165", Kind.lun.of3("西方合論標註", "明", "明教"), // 明 明教標註
                "X1166", Kind.lun.of3("淨慈要語", "明", "元賢"), // 明 元賢述
                "X1167", Kind.lun.of3("淨土生無生論註", "明", "正寂"), // 明 正寂註
                "X1168", Kind.lun.of3("淨土生無生論親聞記", "明", "受教"), // 明 受教記
                "X1169", Kind.lun.of3("淨土生無生論會集", "清", "達默"), // 清 達默集
                "X1170", Kind.lun.of3("雲棲淨土彙語", "清", "虞執西", "嚴培西"), // 清 虞執西．嚴培西同錄
                "X1171", Kind.lun.of3("淨土旨訣", "清", "道霑"), // 清 道霑撰
                "X1172", Kind.lun.of3("淨土晨鐘", "清", "周克復"), // 清 周克復纂
                "X1173", Kind.lun.of3("西歸直指", "清", "周夢顏"), // 清 周夢顏彙集
                "X1174", Kind.lun.of3("淨土警語", "清", "行策"), // 清 行策著
                "X1175", Kind.lun.of3("起一心精進念佛七期規式", "清", "行策"), // 清 行策定
                "X1176", Kind.lun.of3("淨土全書", "清", "俞行敏"), // 清 俞行敏重輯
                "X1177", Kind.lun.of3("角虎集", "清", "濟能"), // 清 濟能纂輯
                "X1178", Kind.lun.of3("東海若解", "清", "實賢"), // 清 實賢解
                "X1179", Kind.lun.of3("省菴法師語錄", "清", "彭際清"), // 清 彭際清重訂
                "X1180", Kind.lun.of3("重訂西方公據", "清", "彭際清"), // 清 彭際清集
                "X1181", Kind.lun.of3("念佛警策", "清", "彭際清"), // 清 彭際清纂
                "X1182", Kind.lun.of3("徹悟禪師語錄", "清", "了亮"), // 清 了亮等集
                "X1183", Kind.lun.of3("淨業知津", "清", "悟開"), // 清 悟開述
                "X1184", Kind.lun.of3("念佛百問", "清", "悟開"), // 清 悟開著
                "X1185", Kind.lun.of3("徑中徑又徑", "清", "張師誠"), // 清 張師誠著
                "X1186", Kind.lun.of3("勸修淨土切要", "清", "真益願"), // 清 真益願纂述
                "X1187", Kind.lun.of3("淨土隨學", "清", "古崑"), // 清 古崑編
                "X1188", Kind.lun.of3("淨土必求", "清", "古崑"), // 清 古崑集
                "X1189", Kind.lun.of3("淨土承恩集", "清", "芳慧"), // 清 芳慧編
                "X1190", Kind.lun.of2("念佛三昧", "金聖歎"), // 瑞聖歎註
                "X1191", Kind.lun.of3("西方確指", "清", "覺明菩薩", "常攝"), // 清 覺明菩薩說　常攝集
                "X1192", Kind.lun.of3("清珠集", "清", "治兆"), // 清 治兆輯
                "X1193", Kind.lun.of3("蓮邦消息", "清", "妙空子"), // 清 妙空子述
                "X1194", Kind.lun.of3("淨土極信錄", "清", "戒香"), // 清 戒香述
                "X1195", Kind.lun.of3("念佛起緣彌陀觀偈直解", "清", "張淵"), // 清 張淵述
                "X1196", Kind.lun.of3("淨土證心集", "清", "卍蓮"), // 清 卍蓮述
                "X1197", Kind.lun.of3("蓮宗必讀", "清", "古崑"), // 清 古崑集
                "X1198", Kind.lun.of3("淨土神珠", "清", "古崑"), // 清 古崑集
                "X1199", Kind.lun.of3("淨業痛策", "清", "照瑩"), // 清 照瑩集
                "X1200", Kind.lun.of3("時時好念佛", "清", "果能"), // 清 果能述
                "X1201", Kind.lun.of3("啟信雜說", "清", "周思仁"), // 清 周思仁輯
                "X1202", Kind.lun.of3("淨土紺珠", "清", "德真"), // 清 德真輯
                "X1203", Kind.lun.of3("修西輯要", "清", "信菴"), // 清 信菴輯
                "X1204", Kind.lun.of3("蓮修起信錄", "清", "程兆鸞"), // 清 程兆鸞錄存
                "X1205", Kind.lun.of3("報恩論", "清", "沈善登"), // 清 沈善登述
                "X1206", Kind.lun.of3("持名四十八法", "清", "鄭韋庵"), // 清 鄭韋庵述
                "X1207", Kind.lun.of3("蓮邦詩選", "明", "廣貴"), // 明 廣貴輯
                "X1208", Kind.lun.of3("唯心集", "清", "乘戒"), // 清 乘戒著
                "X1209", Kind.lun.of3("影響集", "清", "量海"), // 清 尼量海著
                "X1210", Kind.lun.of3("二林唱和詩", "清", "彭紹升"), // 清 彭紹升集
                "X1211", Kind.lun.of3("觀河集節鈔", "清", "彭紹升"), // 清 彭紹升著　弟子節鈔
                "X1212", Kind.lun.of3("測海集節鈔", "清", "彭紹升"), // 清 彭紹升著　弟子節鈔
                "X1213", Kind.lun.of3("瓊樓吟稿節鈔", "清", "陶善"), // 清 陶善著　弟子節鈔
                "X1214", Kind.lun.of3("蓮修必讀", "清", "觀如"), // 清 觀如輯
                "X1215", Kind.lun.of3("普能嵩禪師淨土詩", "清", "德潤"), // 清 德潤錄
                "X1216", Kind.lun.of3("淨土救生船詩", "清", "寬量"), // 清 寬量集
                "X1217", Kind.lun.of3("菩提達磨大師略辨大乘入道四行觀", "梁", "菩提達磨"), // 梁 菩提達磨說
                "X1218", Kind.lun.of3("達磨大師血脉論", "梁", "菩提達磨"), // 梁 菩提達磨述
                "X1219", Kind.lun.of3("達磨大師悟性論", "梁", "菩提達磨"), // 梁 菩提達磨述
                "X1220", Kind.lun.of3("達磨大師破相論", "梁", "菩提達磨"), // 梁 菩提達磨述
                "X1222", Kind.lun.of4("修禪要訣", new String[]{"北天竺", "唐"}, "覺愛", "明恂", "慧智"), // 北天竺 覺愛略說　唐 明恂隨錄　慧智傳譯
                "X1223", Kind.lun.of3("頓悟入道要門論", "唐", "慧海"), // 唐 慧海撰
                "X1224", Kind.lun.of3("諸方門人參問語錄", "唐", "慧海"), // 唐 慧海撰
                "X1225", Kind.lun.of3("中華傳心地禪門師資承襲圖", "唐", "裴休", "宗密"), // 唐 裴休問　宗密答
                "X1226", Kind.lun.of3("宗門十規論", "唐", "文益"), // 唐 文益撰
                "X1229", Kind.lun.of3("定慧相資歌", "宋", "延壽"), // 宋 延壽撰
                "X1230", Kind.lun.of3("警世", "宋", "延壽"), // 宋 延壽撰
                "X1231", Kind.lun.of3("心賦注", "宋", "延壽"), // 宋 延壽述
                "X1232", Kind.lun.of3("智覺禪師自行錄", "宋", "文冲"), // 宋 文冲(重校編集)
                "X1233", Kind.lun.of3("祇園正儀", "宋", "道楷"), // 宋 道楷撰
                "X1234", Kind.lun.of3("臨濟宗旨", "宋", "慧洪"), // 宋 慧洪撰
                "X1235", Kind.lun.of3("智證傳", "宋", "慧洪", "覺慈"), // 宋 慧洪撰　覺慈編
                "X1236", Kind.lun.of3("(重編)曹洞五位顯訣", "宋", "慧霞", "廣輝"), // 宋 慧霞編　廣輝釋
                "X1237", Kind.lun.of3("寶鏡三昧本義", "清", "行策"), // 清 行策述
                "X1238", Kind.lun.of3("寶鏡三昧原宗辨謬說", "清", "淨訥"), // 清 淨訥述
                "X1239", Kind.lun.of3("溈山警策註", "宋", "守遂"), // 宋 守遂註
                "X1240", Kind.lun.of3("溈山警策句釋記", "明", "弘贊", "開詗"), // 明 弘贊註　開詗記
                "X1241", Kind.lun.of3("證道歌註", "宋", "彥琪"), // 宋 彥琪註
                "X1242", Kind.lun.of3("永嘉禪宗集註", "明", "傳燈"), // 明 傳燈重編並註
                "X1244", Kind.lun.of3("百丈清規證義記", "清", "儀潤"), // 清 儀潤證義
                "X1245", Kind.lun.of3("(重雕補註)禪苑清規", "宋", "宗賾"), // 宋 宗賾集
                "X1246", Kind.lun.of3("入眾日用", "宋", "宗壽"), // 宋 宗壽集
                "X1247", Kind.lun.of2("入眾須知"), //
                "X1248", Kind.lun.of3("幻住庵清規", "元", "明本"), // 元 明本著
                "X1249", Kind.lun.of3("叢林校定清規總要", "宋", "惟勉"), // 宋 惟勉編次
                "X1250", Kind.lun.of3("禪林備用清規", "元", "弌咸"), // 元 弋咸編
                "X1251", Kind.lun.of3("叢林兩序須知", "明", "通容"), // 明 通容述
                "X1252", Kind.lun.of3("禪林疏語考證", "明", "元賢"), // 明 元賢集
                "X1253", Kind.lun.of3("初學記", "元", "清覺", "道安"), // 元 清覺述　道安注
                "X1254", Kind.lun.of3("正行集", "元", "清覺"), // 元 清覺述
                "X1255", Kind.lun.of3("禪家龜鑑", "朝鮮", "退隱"), // 朝鮮 退隱述
                "X1256", Kind.lun.of3("宗門玄鑑圖", "明", "虗一"), // 明 虗一撰
                "X1257", Kind.lun.of3("博山禪警語", "明", "元來", "成正"), // 明 元來說　成正集
                "X1258", Kind.lun.of3("禪宗直指", "明", "石成金"), // 明 石成金著
                "X1259", Kind.lun.of3("禪門鍛鍊說", "明", "戒顯"), // 明 戒顯著
                "X1260", Kind.lun.of3("列祖提綱錄", "清", "行悅"), // 清 行悅集
                "X1261", Kind.lun.of3("祖庭事苑", "宋", "善卿"), // 宋 善卿編正

                "X1262", Kind.yinYi.of3("禪林寶訓音義", "明", "大建"), // 明 大建較

                "X1263", Kind.lun.of3("禪林寶訓合註", "清", "張文嘉", "張文憲"), // 清 張文嘉較定　張文憲參閱
                "X1264", Kind.lun.of3("禪林寶訓拈頌", "清", "行盛", "超記"), // 清 行盛著　超記錄
                "X1265", Kind.lun.of3("禪林寶訓順硃", "清", "德玉"), // 清 德玉順硃
                "X1266", Kind.lun.of3("禪林寶訓筆說", "清", "智祥"), // 清 智祥述
                "X1268", Kind.lun.of3("叢林公論", "宋", "惠彬"), // 宋 惠彬述
                "X1269", Kind.lun.of3("十牛圖頌", "宋", "師遠"), // 宋 師遠述
                "X1270", Kind.lun.of3("十牛圖頌", "明", "胡文煥"), // 明 胡文煥著
                "X1271", Kind.lun.of2("十牛圖和頌"), //
                "X1276", Kind.lun.of3("禪門寶藏錄", "高麗", "天頙"), // 高麗 天頙撰

                "X1277", Kind.yuLu.of3("高峰龍泉院因師集賢語錄", "元", "如瑛"), // 元 如瑛編

                "X1278", Kind.lun.of3("禪宗雜毒海", "清", "性音"), // 清 性音重編
                "X1279", Kind.lun.of3("五宗原", "明", "法藏"), // 明 法藏著
                "X1280", Kind.lun.of3("闢妄救略說", "明", "圓悟", "真啟"), // 明 圓悟著　真啟編
                "X1281", Kind.lun.of3("御製揀魔辨異錄", "清", "清世宗皇帝"), // 清 世宗皇帝製
                "X1282", Kind.lun.of3("五家宗旨纂要", "清", "性統"), // 清 性統編
                "X1283", Kind.lun.of3("宗範", "清", "錢伊庵"), // 清 錢伊庵編緝
                "X1285", Kind.lun.of3("慨古錄", "明", "圓澄"), // 明 圓澄著
                "X1286", Kind.lun.of3("祖庭鉗鎚錄", "明", "通容"), // 明 通容輯著
                "X1287", Kind.lun.of3("千松筆記", "明", "大韶"), // 明 大韶著
                "X1288", Kind.lun.of3("萬法歸心錄", "清", "超溟"), // 清 超溟著
                "X1289", Kind.lun.of3("禪宗指掌", "清", "行海"), // 清 行海述
                "X1290", Kind.lun.of3("觀心玄樞", "宋", "延壽"), // 宋 延壽撰
                "X1291", Kind.lun.of3("證道歌頌", "宋", "法泉"), // 宋 法泉繼頌
                "X1292", Kind.lun.of3("證道歌註", "宋", "知訥"), // 宋 知訥述
                "X1293", Kind.lun.of3("證道歌註", "元", "永盛", "德弘"), // 元 永盛述　德弘編
                "X1294", Kind.lun.of3("溈山警策註", "明", "大香"), // 明 大香註
                "X1295", Kind.lun.of4("禪宗頌古聯珠通集", new String[]{"宋", "元"}, "法應", "普會"), // 宋 法應集　元 普會續集
                "X1296", Kind.lun.of3("宗門拈古彙集", "清", "淨符"), // 清 淨符彙集
                "X1297", Kind.lun.of3("宗鑑法林", "清", "集雲堂"), // 清 集雲堂編
                "X1298", Kind.lun.of3("禪門諸祖師偈頌", "宋", "子昇", "如祐"), // 宋 子昇錄　如祐錄
                "X1299", Kind.lun.of3("禪林類聚", "元", "道泰"), // 元 道泰集
                "X1301", Kind.lun.of3("佛果擊節錄", "宋", "重顯", "克勤"), // 宋 重顯拈古　克勤擊節
                "X1302", Kind.lun.of3("焭絕老人天奇直註雪竇顯和尚頌古", "明", "本瑞", "道霖", "性福"), // 明 本瑞直註　道霖．性福編集
                "X1303", Kind.lun.of4("林泉老人評唱投子青和尚頌古空谷集", new String[]{"宋", "元"}, "義青", "從倫"), // 宋 義青頌古　元 從倫評唱
                "X1304", Kind.lun.of4("林泉老人評唱丹霞淳禪師頌古虗堂集", new String[]{"宋", "元"}, "子淳", "從倫"), // 宋 子淳頌古　元 從倫評唱
                "X1306", Kind.lun.of3("焭絕老人天奇直註天童覺和尚頌古", "明", "本瑞", "性福"), // 明 本瑞直註　性福編集
                "X1307", Kind.lun.of4("萬松老人評唱天童覺和尚拈古請益錄", new String[]{"宋", "元"}, "正覺", "行秀"), // 宋 正覺拈古　元 行秀評唱
                "X1308", Kind.lun.of3("徑石滴乳集", "清", "真在", "機雲"), // 清 真在編　機雲重續
                "X1309", Kind.lun.of3("正法眼藏", "宋", "宗杲"), // 宋 宗杲集並著語
                "X1310", Kind.lun.of3("拈八方珠玉集", "宋", "祖慶"), // 宋 祖慶重編
                "X1312", Kind.lun.of3("通玄百問", "元", "圓通", "行秀"), // 元 圓通設問　行秀仰答
                "X1313", Kind.lun.of3("青州百問", "元", "一辯", "覺和尚"), // 元 一辯問　覺答

                "X1314", Kind.muLu.of3("古尊宿語錄目錄", "日本", "道忠"), // 日本 道忠編

                "X1315", Kind.yuLu.of3("古尊宿語錄", "宋", "賾藏主"), // 宋 賾藏主集

                "X1316", Kind.muLu.of3("古尊宿語要目錄", "日本", "道忠"), // 日本 道忠編
                "X1317", Kind.muLu.of3("續古尊宿語要目錄", "日本", "道忠"), // 日本 道忠編

                "X1318", Kind.yuLu.of3("續古尊宿語要", "宋", "師明"), // 宋 師明集
                "X1319", Kind.yuLu.of3("御選語錄", "清", "清世宗皇帝"), // 清 世宗皇帝御選
                "X1320", Kind.yuLu.of2("四家語錄（序．引．跋）"), //
                "X1321", Kind.yuLu.of2("馬祖道一禪師廣錄（四家語錄卷一）"), //
                "X1322", Kind.yuLu.of2("百丈懷海禪師語錄（四家語錄卷二）"), //
                "X1323", Kind.yuLu.of2("百丈懷海禪師廣錄（四家語錄卷三）"), //
                "X1326", Kind.yuLu.of3("五家語錄（序）", "明", "圓信", "郭凝之"), // 明 圓信．郭凝之 編集
                "X1333", Kind.yuLu.of3("雪峰義存禪師語錄（真覺禪師語錄）", "明", "林弘衍"), // 明 林弘衍編次
                "X1335", Kind.yuLu.of3("善慧大士語錄", "唐", "樓頴"), // 唐 樓頴錄
                "X1336", Kind.yuLu.of3("龐居士語錄", "唐", "于頔"), // 唐 于頔編集
                "X1338", Kind.yuLu.of2("石霜楚圓禪師語錄", "慧南"), // (小師)慧南重編
                "X1339", Kind.yuLu.of2("瑯琊慧覺禪師語錄（序）", "用孫"), // (參學)用孫序
                "X1340", Kind.yuLu.of3("黃龍四家錄（序）", "宋", "秀人錢密"), // 宋 秀人錢密序
                "X1342", Kind.yuLu.of2("雲菴克文禪師語錄（敘．疏．附錄）"), //
                "X1343", Kind.yuLu.of2("寶覺祖心禪師語錄（黃龍四家錄第二）", "子和", "仲介"), // (侍者)子和錄　(門人)仲介重編
                "X1344", Kind.yuLu.of2("死心悟新禪師語錄（黃龍四家錄第三）"), //
                "X1345", Kind.yuLu.of2("超宗慧方禪師語錄（黃龍四家錄第四）"), //
                "X1346", Kind.yuLu.of2("雪峰慧空禪師語錄", "慧弼"), // (嗣法)慧弼編
                "X1347", Kind.yuLu.of2("長靈守卓禪師語錄", "介諶"), // (嗣法)介諶編
                "X1348", Kind.yuLu.of2("雪菴從瑾禪師頌古"), //
                "X1350", Kind.yuLu.of2("保寧仁勇禪師語錄", "道勝", "圓淨"), // (參學門人)道勝．圓淨 錄
                "X1351", Kind.yuLu.of2("白雲守端禪師語錄"), //
                "X1352", Kind.yuLu.of2("白雲守端禪師廣錄", "處凝", "智本", "智華", "法演", "海譚"), // (參學小師)處凝．智本．智華．法演 編集、海譚錄
                "X1353", Kind.yuLu.of2("開福道寧禪師語錄", "善果"), // (嗣法小師)善果集
                "X1354", Kind.yuLu.of2("月林師觀禪師語錄", "法寶", "法璹", "慶會", "法清", "有宗", "惟珪", "道果", "慧開", "德秀"), // (侍者)法寶．法璹．慶會．法清．有宗．惟珪．道果．慧開．德秀 編
                "X1355", Kind.yuLu.of2("無門慧開禪師語錄", "普敬", "普通", "了心", "普禮", "法孜", "普巖", "普覺", "光祖", "一見"), // (侍者)普敬．普通．了心．普禮．法孜．普巖．普覺．光祖．一見 錄
                "X1356", Kind.yuLu.of2("普菴印肅禪師語錄"), //
                "X1357", Kind.yuLu.of2("佛果克勤禪師心要", "子文"), // (嗣法)子文編
                "X1358", Kind.yuLu.of2("虎丘紹隆禪師語錄", "嗣端"), // (參學)嗣端 等編
                "X1359", Kind.yuLu.of2("應菴曇華禪師語錄", "守詮"), // (嗣法)守詮 等編
                "X1360", Kind.yuLu.of2("瞎堂慧遠禪師廣錄", "齊己", "如本", "祖淳", "法慧"), // (參學)齊己．如本．祖淳．法慧 編
                "X1361", Kind.yuLu.of3("濟顛道濟禪師語錄", "宋", "沈孟柈"), // 宋 沈孟柈敘述
                "X1362", Kind.yuLu.of2("普覺宗杲禪師語錄", "法宏", "道謙"), // (參學)法宏．道謙 編
                "X1363", Kind.yuLu.of2("西山亮禪師語錄", "覺心", "志清"), // (侍者)覺心．志清 編
                "X1364", Kind.yuLu.of2("率菴梵琮禪師語錄", "了見", "文郁", "本空"), // (小師)了見、(侍者)文郁．本空 編
                "X1365", Kind.yuLu.of2("北磵居簡禪師語錄", "大觀"), // (參學)大觀編
                "X1366", Kind.yuLu.of2("物初大觀禪師語錄", "德溥"), // (門人)德溥 等編校
                "X1367", Kind.yuLu.of2("笑隱大訢禪師語錄", "延俊", "慧曇", "中孚", "崇裕"), // (門人)延俊．慧曇．中孚．崇裕 等編
                "X1368", Kind.yuLu.of2("偃溪廣聞禪師語錄", "元清", "淨志", "普暉", "元偉", "光從", "道鑑", "道隆", "惟實", "妙高"), // (侍者門人)元清．淨志．普暉．元偉．光從．道鑑．道隆．惟實．妙高 編
                "X1369", Kind.yuLu.of2("大川普濟禪師語錄", "元愷"), // (門人)元愷編
                "X1370", Kind.yuLu.of2("淮海原肇禪師語錄", "實仁", "宗文", "法奇", "守愿", "行佑", "了元", "善之", "淨證", "法從", "紹熏", "普璋", "文煥", "淨伏", "慧行", "文謙", "正因", "法恩", "德紀", "可能", "持志", "覺孫", "惟康", "宗和", "如止", "有智", "慧雲", "若舟"), // (侍者門人)實仁．宗文．法奇．守愿．行佑．了元．善之．淨證．法從．紹熏．普璋．文煥．淨伏．慧行．文謙．正因．法恩．德紀．可能．持志．覺孫．惟康．宗和．如止．有智．慧雲．若舟 編
                "X1371", Kind.yuLu.of2("介石智朋禪師語錄", "正賢", "宗坦", "延輝", "淨球", "智瑾", "志諶", "祖誾"), // (參學侍者)正賢．宗坦．延輝．淨球．智瑾．志諶．祖誾 編
                "X1372", Kind.yuLu.of2("無文道燦禪師語錄", "惟康"), // (小師)惟康編
                "X1374", Kind.yuLu.of2("龍源介清禪師語錄", "士洵", "德高", "懷珠"), // (侍者)士洵．德高．懷珠 編
                "X1375", Kind.yuLu.of2("曹源道生禪師語錄", "道冲"), // (侍者)道冲編
                "X1376", Kind.yuLu.of2("痴絕道冲禪師語錄", "智沂", "悟開", "行彌", "紹甄", "智圓", "元省", "元樞"), // (嗣法門人)智沂．悟開．行彌．紹甄．智圓．元省．元樞 編
                "X1377", Kind.yuLu.of2("松源崇嶽禪師語錄", "善開", "光睦", "普巖", "師肇", "道巖", "了能"), // (參學)善開．光睦．普巖．師肇．道巖．了能 等錄
                "X1378", Kind.yuLu.of2("無明慧性禪師語錄", "妙儼", "圓澄", "妙全", "道隆", "圓照", "法洪", "唯道"), // (侍者)妙儼．圓澄．妙全．道隆．圓照．法洪．唯道 編
                "X1379", Kind.yuLu.of2("運菴普巖禪師語錄", "元靖", "智能", "惟衍"), // (侍者)元靖．智能．惟衍 編
                "X1381", Kind.yuLu.of2("破菴祖先禪師語錄", "圓照"), // (參學)圓照等編
                "X1382", Kind.yuLu.of2("無準師範禪師語錄", "宗會", "智折", "覺圓", "如海", "妙倫", "惟一", "了禪", "了心", "普明", "了南", "紹曇", "了覺", "師坦", "妙因", "至慧"), // (侍者)宗會．智折．覺圓．如海．妙倫．惟一．了禪．了心．普明．了南．紹曇．了覺．師坦．妙因．至慧 編
                "X1383", Kind.yuLu.of2("無準和尚奏對語錄", "了南", "了垠"), // (侍者)了南．了垠 編
                "X1384", Kind.yuLu.of2("絕岸可湘禪師語錄", "妙恩", "正從", "自永", "守靜", "慈證", "宗永"), // (嗣法門人)妙恩．正從．自永．守靜．慈證．宗永 等編
                "X1385", Kind.yuLu.of2("樵隱悟逸禪師語錄", "正定"), // (侍者)正定編
                "X1386", Kind.yuLu.of2("石田法薰禪師語錄", "了覺", "師坦"), // (門人)了覺．師坦 等編
                "X1387", Kind.yuLu.of2("劍關子益禪師語錄", "善珙", "德修", "慧澄", "銳彰", "心寧", "慧恭"), // (侍者)善珙．德修．慧澄．銳彰．心寧．慧恭 編
                "X1388", Kind.yuLu.of2("環溪惟一禪師語錄", "覺此"), // (參學)覺此編
                "X1389", Kind.yuLu.of2("希叟紹曇禪師語錄", "自悟", "了舜", "妙恩", "普和", "惠洇", "希革", "彌紹", "道信", "宗壽", "道亨"), // (侍者)自悟．了舜．妙恩．普和．惠洇．希革．彌紹．道信．宗壽．道亨 編
                "X1390", Kind.yuLu.of2("希叟紹曇禪師廣錄", "法澄", "了舜", "普和", "希革", "惠洇", "彌紹", "道亨", "宗壽"), // (侍者)法澄．了舜．普和．希革．惠洇．彌紹．道亨．宗壽 編
                "X1391", Kind.yuLu.of2("西巖了慧禪師語錄", "修義", "景元", "宗清", "繼燖", "宗應"), // (門人侍者)修義．景元．宗清．繼燖．宗應 編
                "X1392", Kind.yuLu.of2("月磵禪師語錄", "妙寅", "法嚴", "德圓", "覺靜", "永仁", "宗煥"), // (嗣法)妙寅、(侍者)法嚴．德圓．覺靜．永仁．宗煥 等編
                "X1393", Kind.yuLu.of2("平石如砥禪師語錄", "文才", "子昶", "了因", "彌安", "元勗", "師楷", "文斌", "汝均", "處林", "雲岑"), // (嗣法門人)文才．子昶．了因．彌安．元勗．師楷．文斌．汝均．處林．雲岑 等編
                "X1394", Kind.yuLu.of2("斷橋妙倫禪師語錄", "文寶", "善靖"), // (侍者)文寶．善靖 編
                "X1395", Kind.yuLu.of2("方山文寶禪師語錄", "先覩", "祖燈", "機雲"), // (嗣法)先覩．祖燈 等錄　(法孫)機雲編
                "X1396", Kind.yuLu.of2("無見先覩禪師語錄", "智度"), // (嗣法門人)智度等編
                "X1397", Kind.yuLu.of2("雪巖祖欽禪師語錄", "昭如", "希陵"), // (嗣法門人)昭如．希陵 等編
                "X1398", Kind.yuLu.of2("海印昭如禪師語錄", "行純", "道彰", "從心"), // (門人)行純．道彰．從心 集
                "X1399", Kind.yuLu.of2("石屋清洪禪師語錄", "至柔"), // (參學門人)至柔等編
                "X1400", Kind.yuLu.of2("高峰原妙禪師語錄", "參學門人"), // (參學門人)編
                "X1401", Kind.yuLu.of2("高峰原妙禪師禪要", "持正", "洪喬祖"), // (侍者)持正錄　(參學)洪喬祖編
                "X1402", Kind.yuLu.of2("天目明本禪師雜錄"), //
                "X1403", Kind.yuLu.of2("天如惟則禪師語錄", "善遇"), // (小師)善遇編
                "X1404", Kind.yuLu.of2("兀菴普寧禪師語錄", "淨韻", "清澤", "道昭", "景用", "禪了"), // (侍者)淨韻．清澤．道昭．景用．禪了 編
                "X1405", Kind.yuLu.of2("石溪心月禪師語錄", "住顯", "宗煥", "祖定", "宗茙", "光玉", "仁安", "應儼", "永珍", "祖森"), // (侍者)住顯．宗煥．祖定．宗茙．光玉．仁安．應儼．永珍．祖森 編
                "X1406", Kind.yuLu.of2("石溪心月禪師雜錄"), //
                "X1407", Kind.yuLu.of2("虛舟普度禪師語錄", "淨伏", "行佑", "德珍", "瓊林"), // (嗣法)淨伏、(門人)行佑．德珍．瓊林 等編
                "X1408", Kind.yuLu.of3("即休契了禪師拾遺集", "日本", "及藏主"), // 日本 及藏主集錄
                "X1409", Kind.yuLu.of2("月江正印禪師語錄", "居簡", "妙心", "大機", "慧忠", "可橖", "祖安", "具德", "宗滿", "自然", "慧觀", "壽椿", "德粹", "思敬", "良圭", "景行", "本真", "紹宗", "文闡", "寶生", "文藻", "自成"), // (門人)居簡．妙心．大機．慧忠．可橖．祖安．具德．宗滿．自然．慧觀．壽椿．德粹．思敬．良圭．景行．本真．紹宗．文闡．寶生．文藻．自成 編
                "X1410", Kind.yuLu.of2("曇芳守忠禪師語錄", "繼祖"), // (嗣法)繼祖等編
                "X1411", Kind.yuLu.of2("橫川行珙禪師語錄", "本光"), // (門人)本光等編
                "X1412", Kind.yuLu.of2("古林清茂禪師語錄", "元浩", "清欲", "應槐"), // (小師)元浩．清欲．應槐 編
                "X1413", Kind.yuLu.of3("古林清茂禪師拾遺偈頌", "日本", "海壽"), // 日本 海壽編次
                "X1414", Kind.yuLu.of2("了菴清欲禪師語錄", "一志", "元皓", "可興", "文康", "祖運", "志道", "祖杲", "得度", "文煥", "克明", "宗成", "宗胤", "起宗", "汝現", "元寶", "慧朗", "景毅", "大圓", "海壽", "祖灊"), // (參學)一志．元皓．可興．文康．祖運．志道．祖杲．得度．文煥．克明．宗成．宗胤．起宗．汝現．元寶．慧朗．景毅．大圓．海壽．祖灊 等編
                "X1415", Kind.yuLu.of2("穆菴文康禪師語錄", "清逸", "智辯", "寶日"), // (嗣法參學)清逸．智辯．寶日 等編
                "X1416", Kind.yuLu.of2("恕中無慍禪師語錄", "宗黼", "道瑄", "宗亘", "居頂", "惟寂", "宗寄", "慧浩", "清歲"), // (嗣法參學)宗黼．道瑄．宗亘．居頂．惟寂．宗寄．慧浩．清歲 等編
                "X1417", Kind.yuLu.of2("了堂惟一禪師語錄", "宗義", "有端", "思齊", "思靜", "妙淨", "無我", "文暐", "雲澹", "思謙", "普莊", "宗遠", "思廉", "文度", "文朗"), // (門人)宗義．有端．思齊．思靜．妙淨．無我．文暐．雲澹．思謙．普莊．宗遠．思廉．文度．文朗 等編
                "X1418", Kind.yuLu.of2("呆菴普莊禪師語錄", "慧啟", "智粵", "智勝", "德琇", "曇頓", "道哲"), // (門人)慧啟．智粵．智勝．德琇．曇頓．道哲 等編
                "X1419", Kind.yuLu.of2("元叟行端禪師語錄", "法林", "曇噩", "祖銘", "梵琦"), // (門人)法林．曇噩．祖銘．梵琦 等編
                "X1420", Kind.yuLu.of2("楚石梵琦禪師語錄", "祖光", "文玹", "曇紹", "祖灊", "景瓛", "良彥", "應訢", "明遠", "胤丘", "文晟", "正隆", "善成", "文斌", "中端", "正參"), // (門人)祖光．文玹．曇紹．祖灊．景瓛．良彥．應訢．明遠．胤丘．文晟．正隆．善成．文斌．中端．正參 等編
                "X1421", Kind.yuLu.of2("愚菴智及禪師語錄", "觀通", "溥震", "正除", "希顏", "忻悟", "寶盈", "至寶", "慧鏡", "護位", "道彝"), // (門人)觀通．溥震．正除．希顏．忻悟．寶盈．至寶．慧鏡．護位．道彝 等編
                "X1422", Kind.yuLu.of2("南石文琇禪師語錄", "宗謐", "妙門", "復初", "廷璨", "良玓"), // (門人)宗謐．妙門．復初．廷璨．良玓 等編
                "X1423", Kind.yuLu.of2("投子義青禪師語錄", "自覺"), // (傳法)自覺重編
                "X1424", Kind.yuLu.of2("投子義青禪師語錄", "道楷"), // (嗣法)道楷編
                "X1425", Kind.yuLu.of2("丹霞子淳禪師語錄", "慶預"), // (嗣法小師)慶預校勘
                "X1426", Kind.yuLu.of2("真歇清了禪師語錄", "德初", "義初"), // (侍者)德初．義初 等編
                "X1428", Kind.yuLu.of2("淨慈慧暉禪師語錄", "明總", "了廣"), // (弟子)明總下語寄言、了廣編
                "X1431", Kind.yuLu.of2("雲外雲岫禪師語錄", "士慘"), // (小師)士慘編
                "X1432", Kind.yuLu.of2("無明慧經禪師語錄", "元賢"), // (嗣法)元賢重編
                "X1433", Kind.yuLu.of2("晦臺元鏡禪師語錄", "道盛"), // (嗣法)道盛集
                "X1434", Kind.yuLu.of2("見如元謐禪師語錄", "道璞"), // (門人)道璞集
                "X1435", Kind.yuLu.of2("無異元來禪師廣錄", "弘瀚", "弘裕"), // (法孫)弘瀚彙編、弘裕同集
                "X1436", Kind.yuLu.of2("博山無異大禪語錄集要", "成正"), // (首座)成正錄
                "X1437", Kind.yuLu.of2("永覺元賢禪師廣錄", "道霈"), // (嗣法)道霈重編
                "X1438", Kind.yuLu.of2("為霖道霈禪師秉拂語錄", "太靖"), // (書記)太靖錄
                "X1439", Kind.yuLu.of2("為霖道霈禪師餐香錄", "太泉"), // (書記)太泉錄
                "X1440", Kind.yuLu.of2("為霖道霈禪師還山錄", "興燈", "心亮", "法雲", "性朗"), // (侍者)興燈．心亮．法雲．性朗 錄
                "X1441", Kind.yuLu.of2("為霖禪師雲山法會錄", "謝大材", "潘道靖", "黃大廣"), // (弟子)謝大材．潘道靖．黃大廣 同錄
                "X1442", Kind.yuLu.of2("為霖禪師旅泊菴稿", "太泉", "等純", "興燈", "心亮", "淨煥"), // (弟子)太泉．等純．興燈．心亮．淨煥 錄
                "X1443", Kind.yuLu.of2("宗寶道獨禪師語錄", "今釋"), // (法孫)今釋重編
                "X1444", Kind.yuLu.of2("湛然圓澄禪師語錄", "明凡", "丁元公", "祁駿隹"), // (門人)明凡錄　丁元公．祁駿隹 編
                "X1445", Kind.yuLu.of2("玄沙師備禪師廣錄", "智嚴"), // (參學)智嚴集
                "X1446", Kind.yuLu.of2("玄沙師備禪師語錄", "明", "林弘衍"), // 明 林弘衍編次
                "X1447", Kind.yuLu.of2("薦福承古禪師語錄", "文智"), // (門人)文智編
                "X1448", Kind.yuLu.of2("法昌倚遇禪師語錄", "宗密"), // (小師)宗密錄
                "X1449", Kind.yuLu.of2("吳山淨端禪師語錄", "師皎"), // (法孫)師皎重編
                "X1450", Kind.yuLu.of2("慧林宗本禪師別錄", "慧辯"), // (嗣法)慧辯錄
                "X1451", Kind.yuLu.of2("慈受懷深禪師廣錄", "善清", "善隨", "宗先", "普紹"), // (侍者)善清．善隨．宗先．普紹 編

                "X1452", Kind.lun.of3("紫柏尊者全集", "明", "德清"), // 明 德清閱
                "X1453", Kind.lun.of3("紫柏尊者別集", "明", "錢謙益"), // 明 錢謙益纂閱

                "X1454", Kind.yuLu.of2("雲谷和尚語錄", "宗敬", "道傑", "惟能", "宗㞧", "祖祿"), // (參學)宗敬．道傑．惟能．宗㞧．祖祿 編

                "X1455", Kind.lun.of3("聖箭堂述古", "清", "道霈"), // 清 道霈述
                "X1456", Kind.lun.of2("憨山老人夢遊集", "福善", "通炯"), // (侍者)福善日錄 (門人)通炯編輯
                "X1457", Kind.lun.of3("雲門麥浪懷禪師宗門設難", "明", "許元釗"), // 明 許元釗錄
                "X1458", Kind.lun.of3("宗門寶積錄（序．凡例．目錄）", "清", "本晳"), // 清 本晳輯
                "X1464", Kind.lun.of3("三時繫念佛事", "宋", "延壽"), // 宋 延壽述
                "X1465", Kind.lun.of3("三時繫念儀範", "宋", "延壽"), // 宋 延壽述
                "X1466", Kind.lun.of3("無量壽佛讚註", "宋", "元照", "戒度"), // 宋 元照撰　戒度注
                "X1467", Kind.lun.of3("禮念彌陀道場懺法", "元", "王子成"), // 元 王子成集
                "X1468", Kind.lun.of3("西歸行儀", "清", "古崑"), // 清 古崑錄輯
                "X1469", Kind.lun.of2("華嚴經海印道場九會請佛儀"), //
                "X1470", Kind.lun.of4("華嚴經海印道場懺儀", new String[]{"唐", "宋", "明"}, "一行慧覺", "普瑞", "讀徹", "木增", "正止"), // 唐 一行慧覺依經錄　宋 普瑞補註　明 讀徹參閱　明 木增訂正　明 正止治定
                "X1471", Kind.lun.of3("華嚴清涼國師禮讚文", "宋", "智肱"), // 宋 智肱述
                "X1472", Kind.lun.of3("華嚴普賢行願修證儀", "宋", "淨源"), // 宋 淨源集
                "X1473", Kind.lun.of3("華嚴普賢行願修證儀", "宋", "淨源"), // 宋 淨源集
                "X1474", Kind.lun.of3("華嚴道場起止大略", "明"), // 明
                "X1475", Kind.lun.of3("圓覺經道場修證儀", "唐", "宗密"), // 唐 宗密述
                "X1476", Kind.lun.of3("圓覺經道場略本修證儀", "宋", "淨源"), // 宋 淨源錄
                "X1477", Kind.lun.of3("首楞嚴壇場修證儀", "宋", "淨源"), // 宋 淨源編敘
                "X1478", Kind.lun.of3("依楞嚴究竟事懺", "明", "禪修"), // 明 禪修述
                "X1479", Kind.lun.of3("佛母孔雀尊經科式", "明"), // 明
                "X1480", Kind.lun.of4("千手千眼大悲心咒行法", new String[]{"宋", "清"}, "知禮", "讀體"), // 宋 知禮始集　清 讀體重纂
                "X1481", Kind.lun.of3("准提三昧行法", "明", "受登"), // 明 受登集
                "X1482", Kind.lun.of3("准提焚修悉地懺悔玄文", "清", "夏道人"), // 清 夏道人集
                "X1483", Kind.lun.of3("藥師三昧行法", "明", "受登"), // 明 受登集
                "X1484", Kind.lun.of3("慈悲藥師寶懺", "清"), // 清
                "X1485", Kind.lun.of3("占察善惡業報經行法", "明", "智旭"), // 明 智旭集
                "X1486", Kind.lun.of3("讚禮地藏菩薩懺願儀", "明", "智旭"), // 明 智旭述
                "X1487", Kind.lun.of3("慈悲地藏菩薩懺法", "清"), // 清
                "X1488", Kind.lun.of3("得遇龍華修證懺儀", "明", "如惺"), // 明 如惺撰
                "X1489", Kind.lun.of3("吳中石佛相好懺儀", "明", "傳燈"), // 明 傳燈集
                "X1490", Kind.lun.of3("舍利懺法", "清", "繼僧"), // 清 繼僧著
                "X1491", Kind.lun.of3("禮舍利塔儀式", "清", "弘贊"), // 清 弘贊編
                "X1492", Kind.lun.of3("禮佛儀式", "清", "弘贊"), // 清 弘贊編
                "X1493", Kind.lun.of3("供諸天科儀", "清", "弘贊"), // 清 弘贊集
                "X1494", Kind.lun.of3("金剛經科儀", "清", "建基"), // 清 建基錄
                "X1495", Kind.lun.of3("慈悲道場水懺法隨聞錄", "清", "智證"), // 清 智證錄
                "X1496", Kind.lun.of3("慈悲道場水懺法科註", "清", "西宗"), // 清 西宗集註

                "X1497", Kind.yiGui.of4("法界聖凡水陸勝會修齋儀軌", new String[]{"宋", "明"}, "志磐", "袾宏"), // 宋 志磐謹撰　明 袾宏重訂

                "X1498", Kind.lun.of3("法界聖凡水陸大齋普利道場性相通論", "清", "咫觀"), // 清 咫觀述
                "X1499", Kind.lun.of3("法界聖凡水陸大齋法輪寶懺", "清", "咫觀"), // 清 咫觀記
                "X1500", Kind.lun.of3("蘭盆獻供儀", "宋", "元照"), // 宋 元照重集
                "X1501", Kind.lun.of3("釋迦如來降生禮讚文", "宋", "仁岳"), // 宋 仁岳撰
                "X1504", Kind.lun.of3("南山祖師禮讚文", "宋", "智圓"), // 宋 智圓述
                "X1505", Kind.lun.of3("南山祖師禮讚文", "宋", "仁岳"), // 宋 仁岳述
                "X1506", Kind.lun.of3("南山祖師禮讚文", "宋", "允堪"), // 宋 允堪述
                "X1507", Kind.lun.of3("大智律師禮讚文", "宋", "則安"), // 宋 則安述

                "X1508", Kind.zhuanJi.of3("釋迦如來成道記", "唐", "王勃"), // 唐 王勃撰

                "X1509", Kind.lun.of3("釋迦如來成道記註", "唐", "道誠"), // 唐 道誠註
                "X1510", Kind.lun.of3("釋迦如來行蹟頌", "元", "無寄"), // 元 無寄撰集
                "X1511", Kind.lun.of3("釋迦如來應化錄", "明", "寶成"), // 明 寶成編集
                "X1512", Kind.lun.of3("隆興編年通論", "宋", "祖琇"), // 宋 祖琇撰

                "X1513", Kind.shi.of3("釋門正統", "宋", "宗鑑"), // 宋 宗鑑集
                "X1515", Kind.shi.of2("續佛祖統紀"), //
                "X1516", Kind.shi.of3("釋氏通鑑", "宋", "本覺"), // 宋 本覺編集
                "X1517", Kind.shi.of3("歷朝釋氏資鑑", "元", "熙仲"), // 元 熙仲集
                "X1521", Kind.shi.of2("(古今圖書集成)釋教部彙考"), //

                "X1522", Kind.zhuanJi.of3("新修科分六學僧傳", "元", "曇噩"), // 元 曇噩述
                "X1523", Kind.zhuanJi.of3("名僧傳抄", "梁", "寶唱"), // 梁 寶唱撰
                "X1524", Kind.zhuanJi.of3("補續高僧傳", "明", "明河"), // 明 明河撰
                "X1526", Kind.zhuanJi.of3("武林西湖高僧事略", "宋", "元敬", "元復"), // 宋 元敬．元復同述
                "X1527", Kind.zhuanJi.of3("續武林西湖高僧事略", "明", "袾宏"), // 明 袾宏輯
                "X1530", Kind.zhuanJi.of3("法界宗五祖略記", "清", "續法"), // 清 續法輯
                "X1532", Kind.zhuanJi.of3("華嚴經感應略記", "明", "袾宏"), // 明 袾宏輯錄
                "X1533", Kind.zhuanJi.of3("華嚴感應緣起傳", "清", "弘璧"), // 清 弘璧輯
                "X1534", Kind.zhuanJi.of3("華嚴經持驗記", "清", "周克復"), // 清 周克復纂
                "X1535", Kind.zhuanJi.of3("智者大師別傳註", "宋", "曇照"), // 宋 曇照註
                "X1539", Kind.zhuanJi.of3("法華靈驗傳", "明", "了圓"), // 明 了圓錄
                "X1540", Kind.zhuanJi.of3("法華經顯應錄", "宋", "宗曉"), // 宋 宗曉編
                "X1541", Kind.zhuanJi.of3("法華經持驗記", "清", "周克復"), // 清 周克復纂
                "X1542", Kind.zhuanJi.of3("觀音經持驗記", "清", "周克復"), // 清 周克復集
                "X1543", Kind.zhuanJi.of2("東林十八高賢傳"), //
                "X1546", Kind.zhuanJi.of3("新修往生傳", "宋", "王古"), // 宋 王古輯撰
                "X1547", Kind.zhuanJi.of3("諸上善人詠", "明", "道衍"), // 明 道衍撰
                "X1549", Kind.zhuanJi.of3("淨土聖賢錄", "清", "彭希涑"), // 清 彭希涑述
                "X1550", Kind.zhuanJi.of3("淨土聖賢錄續編", "清", "胡珽"), // 清 胡𤥻述
                "X1551", Kind.zhuanJi.of3("西舫彙征", "清", "瑞璋"), // 清 瑞璋輯
                "X1552", Kind.zhuanJi.of3("修西聞見錄", "清", "咫觀"), // 清 咫觀輯
                "X1553", Kind.zhuanJi.of3("天聖廣燈錄", "宋", "李遵勗"), // 宋 李遵勗勅編
                "X1554", Kind.zhuanJi.of3("五家正宗贊", "宋", "紹曇"), // 宋 紹曇記

                "X1555", Kind.muLu.of3("建中靖國續燈錄目錄", "宋", "惟白"), // 宋 惟白集

                "X1556", Kind.lun.of3("建中靖國續燈錄", "宋", "惟白"), // 宋 惟白集
                "X1557", Kind.lun.of3("聯燈會要", "宋", "悟明"), // 宋 悟明集

                "X1558", Kind.muLu.of3("嘉泰普燈錄總目錄", "宋", "正受"), // 宋 正受編

                "X1559", Kind.lun.of3("嘉泰普燈錄", "宋", "正受"), // 宋 正受編

                "X1560", Kind.zhuanJi.of3("禪林僧寶傳", "宋", "惠洪"), // 宋 惠洪撰
                "X1561", Kind.zhuanJi.of3("僧寶正續傳", "宋", "祖琇"), // 宋 祖琇撰
                "X1562", Kind.zhuanJi.of3("南宋元明禪林僧寶傳", "清", "自融", "性磊"), // 清 自融撰　性磊補輯

                "X1563", Kind.lun.of3("大光明藏", "宋", "寶曇"), // 宋 寶曇述

                "X1564", Kind.muLu.of3("五燈會元目錄", "宋", "普濟"), // 宋 普濟集

                "X1565", Kind.lun.of3("五燈會元", "宋", "普濟"), // 宋 普濟集
                "X1566", Kind.lun.of3("五燈會元續略", "明", "淨柱"), // 明 淨柱輯

                "X1567", Kind.muLu.of3("五燈嚴統目錄", "明", "通容"), // 明 通容集

                "X1568", Kind.lun.of3("五燈嚴統", "明", "通容"), // 明 通容集
                "X1569", Kind.lun.of3("五燈嚴統解惑編", "明", "通容"), // 明 通容述

                "X1570", Kind.muLu.of3("五燈全書目錄", "清", "超永"), // 清 超永編輯

                "X1571", Kind.lun.of3("五燈全書", "清", "超永"), // 清 超永編輯

                "X1572", Kind.muLu.of2("續傳燈錄目錄"), //

                "X1574", Kind.lun.of3("增集續傳燈錄", "明", "文琇"), // 明 文琇集
                "X1576", Kind.lun.of3("雪堂行拾遺錄", "宋", "道行"), // 宋 道行編
                "X1577", Kind.lun.of3("羅湖野錄", "宋", "曉瑩"), // 宋 曉瑩集
                "X1578", Kind.lun.of3("指月錄", "明", "瞿汝稷"), // 明 瞿汝稷集
                "X1579", Kind.lun.of3("續指月錄", "清", "聶先"), // 清 聶先編輯
                "X1580", Kind.lun.of3("教外別傳", "明", "黎眉"), // 明 黎眉等編
                "X1581", Kind.lun.of3("皇明名僧輯略", "明", "袾宏"), // 明 袾宏輯

                "X1582", Kind.muLu.of3("續燈正統目錄", "清", "性統"), // 清 性統編集

                "X1583", Kind.lun.of3("續燈正統", "清", "性統"), // 清 性統編集

                "X1584", Kind.muLu.of2("續燈存稿目錄"), //

                "X1585", Kind.lun.of3("續燈存稿", "明", "通問", "施沛"), // 明 通問編定　施沛彙集

                "X1586", Kind.muLu.of2("正源略集目錄"), //

                "X1587", Kind.lun.of3("正源略集", "清", "際源", "了貞", "達珍"), // 清 際源．了貞輯　達珍編
                "X1588", Kind.lun.of3("正源略集補遺", "清", "達珍"), // 清 達珍編

                "X1589", Kind.muLu.of3("錦江禪燈目錄", "清", "通醉"), // 清 通醉輯

                "X1590", Kind.lun.of3("錦江禪燈", "清", "通醉"), // 清 通醉輯
                "X1591", Kind.lun.of3("黔南會燈錄", "清", "如純"), // 清 如純輯
                "X1592", Kind.lun.of3("揞黑豆集", "清", "心圓", "火蓮"), // 清 心圓拈別　火蓮集梓
                "X1593", Kind.lun.of3("禪宗正脉", "明", "如巹"), // 明 如巹集
                "X1594", Kind.lun.of3("佛祖綱目", "明", "朱時恩"), // 明 朱時恩著
                "X1595", Kind.lun.of3("佛祖正傳古今捷錄", "清", "果性"), // 清 果性集
                "X1596", Kind.lun.of3("南嶽單傳記", "清", "弘儲"), // 清 弘儲表

                "X1597", Kind.zhuanJi.of2("定應大師布袋和尚傳", "曇噩"), // 曇噩撰
                "X1598", Kind.zhuanJi.of2("曹溪大師別傳"), //

                "X1599", Kind.lun.of3("永明道蹟", "明", "大壑"), // 明 大壑輯
                "X1600", Kind.lun.of3("宗統編年", "清", "紀蔭"), // 清 紀蔭編纂
                "X1601", Kind.lun.of3("禪燈世譜", "明", "道忞", "吳侗"), // 明 道忞編修　吳侗集
                "X1602", Kind.lun.of3("佛祖宗派世譜", "清", "悟進"), // 清 悟進編輯
                "X1603", Kind.lun.of3("緇門世譜", "清", "明喜"), // 清 明喜撰輯
                "X1604", Kind.lun.of3("法門鋤宄", "清", "淨符"), // 清 淨符著
                "X1605", Kind.lun.of3("繼燈錄", "明", "元賢"), // 明 元賢輯
                "X1606", Kind.lun.of3("建州弘釋錄", "明", "元賢"), // 明 元賢集
                "X1607", Kind.lun.of3("居士分燈錄", "明", "朱時恩"), // 明 朱時恩輯
                "X1608", Kind.lun.of3("八十八祖道影傳贊", "明", "德清", "高承埏"), // 明 德清述　高承埏補
                "X1609", Kind.lun.of3("普陀列祖錄", "清", "通旭"), // 清 通旭集
                "X1610", Kind.lun.of3("雲臥紀譚", "宋", "曉瑩"), // 宋 曉瑩錄
                "X1611", Kind.lun.of3("叢林盛事", "宋", "道融"), // 宋 道融撰
                "X1612", Kind.lun.of3("人天寶鑑", "宋", "曇秀"), // 宋 曇秀輯
                "X1613", Kind.lun.of3("枯崖漫錄", "宋", "圓悟"), // 宋 圓悟錄
                "X1614", Kind.lun.of4("禪苑蒙求瑤林", new String[]{"金", "元"}, "志明", "德諫"), // 金 志明撰　元 德諫注
                "X1615", Kind.lun.of2("禪苑蒙求拾遺"), //
                "X1616", Kind.lun.of3("山菴雜錄", "明", "無慍"), // 明 無溫錄
                "X1617", Kind.lun.of3("正宗心印後續聯芳", "明", "善燦"), // 明 善燦著
                "X1618", Kind.lun.of3("祖庭指南", "清", "徐昌治"), // 清 徐昌治編述
                "X1619", Kind.lun.of3("先覺集", "明", "陶明潛"), // 明 陶明潛輯
                "X1620", Kind.lun.of3("先覺宗乘", "清", "圓信", "郭凝之"), // 清 圓信較定　郭凝之彙編
                "X1621", Kind.lun.of3("優婆夷志", "清", "圓信", "郭凝之"), // 清 圓信較定　郭凝之彙編
                "X1622", Kind.lun.of3("朝鮮禪教考", "朝鮮", "朴永善"), // 朝鮮 朴永善輯
                "X1623", Kind.lun.of2("釋氏蒙求", "靈操"), // 靈操撰
                "X1624", Kind.lun.of3("林間錄", "宋", "慧洪"), // 宋 慧洪集
                "X1625", Kind.lun.of3("林間錄後集", "宋", "慧洪"), // 宋 慧洪集
                "X1626", Kind.lun.of3("高僧摘要", "清", "徐昌治"), // 清 徐昌治編輯
                "X1627", Kind.lun.of3("緇門崇行錄", "明", "袾宏"), // 明 袾宏輯
                "X1628", Kind.lun.of3("佛法金湯編", "明", "心泰"), // 明 心泰編
                "X1629", Kind.lun.of3("金剛般若經集驗記", "唐", "孟獻忠"), // 唐 孟獻忠撰
                "X1630", Kind.lun.of3("金剛經鳩異", "唐", "段成式"), // 唐 段成式撰
                "X1631", Kind.lun.of2("金剛經受持感應錄"), //
                "X1632", Kind.lun.of2("金剛經感應傳"), //
                "X1633", Kind.lun.of3("金剛經新異錄", "明", "王起隆"), // 明 王起隆輯著
                "X1634", Kind.lun.of3("金剛經靈驗傳", "日本", "淨慧"), // 日本 淨慧集
                "X1635", Kind.lun.of3("金剛經持驗記", "清", "周克復"), // 清 周克復纂
                "X1636", Kind.lun.of3("金剛經感應分類輯要", "清", "王澤泩"), // 清 王澤泩編集
                "X1638", Kind.lun.of3("地藏菩薩像靈驗記", "宋", "常謹"), // 宋 常謹集
                "X1640", Kind.lun.of3("心性罪福因緣集", "宋", "智覺"), // 宋 智覺注
                "X1641", Kind.lun.of3("見聞錄", "明", "智旭"), // 明 智旭隨筆
                "X1642", Kind.lun.of3("現果隨錄", "明", "戒顯"), // 明 戒顯筆記
                "X1643", Kind.lun.of3("兜率龜鏡集", "清", "弘贊"), // 清 弘贊輯
                "X1644", Kind.lun.of3("觀音慈林集", "清", "弘贊"), // 清 弘贊輯
                "X1645", Kind.lun.of3("六道集", "清", "弘贊"), // 清 弘贊輯

                "X1646", Kind.zhuanJi.of3("居士傳", "清", "彭際清"), // 清 彭際清述

                "X1648", Kind.lun.of3("冥報記輯書", "日本", "佐佐木憲德"), // 日本 佐佐木憲德輯
                "X1649", Kind.lun.of3("名公法喜志", "明", "夏樹芳"), // 明 夏樹芳輯
                "X1651", Kind.lun.of3("玄奘三藏師資傳叢書", "日本", "佐伯定胤", "中野達慧"), // 日本 佐伯定胤．中野達慧共編
                "X1654", Kind.lun.of2("惠果和尚行狀"), //
                "X1655", Kind.lun.of3("得依釋序文緣起", "日本", "慧堅"), // 日本 慧堅撰
                "X1656", Kind.lun.of2("伯亭大師傳記總帙"), //

                "X1657", Kind.zhuanJi.of3("善女人傳", "清", "彭際清"), // 清 彭際清述
                "X1658", Kind.zhuanJi.of3("重編諸天傳", "宋", "行霆"), // 宋 行霆述

                "X1660", Kind.lun.of2("(古今圖書集成)神異典二氏部彙考"), //
                "X1661", Kind.lun.of2("(古今圖書集成)神異典釋教部紀事"), //
                "X1666", Kind.lun.of2("佛祖心燈"), //
                "X1667", Kind.lun.of3("宗教律諸宗演派", "清", "守一"), // 清 守一重編
                "X1668", Kind.lun.of3("西藏剌麻溯源", "清", "守一"), // 清 守一編輯

                "X1671", Kind.zhuanJi.of2("東國僧尼錄") //
        );
    }

    private static void addY() {
        add(
                "Y0001", Kind.lun.of3("般若經講記", "民國", "釋印順"), // 民國 釋印順著
                "Y0002", Kind.lun.of3("寶積經講記", "民國", "釋印順"), // 民國 釋印順著
                "Y0003", Kind.lun.of3("勝鬘經講記", "民國", "釋印順"), // 民國 釋印順著
                "Y0004", Kind.lun.of3("藥師經講記", "民國", "釋印順"), // 民國 釋印順著
                "Y0005", Kind.lun.of3("中觀論頌講記", "民國", "釋印順"), // 民國 釋印順著
                "Y0006", Kind.lun.of3("攝大乘論講記", "民國", "釋印順"), // 民國 釋印順著
                "Y0007", Kind.lun.of3("大乘起信論講記", "民國", "釋印順"), // 民國 釋印順著
                "Y0008", Kind.lun.of3("佛法概論", "民國", "釋印順"), // 民國 釋印順著
                "Y0009", Kind.lun.of3("中觀今論", "民國", "釋印順"), // 民國 釋印順著
                "Y0010", Kind.lun.of3("唯識學探源", "民國", "釋印順"), // 民國 釋印順著
                "Y0011", Kind.lun.of3("性空學探源", "民國", "釋印順"), // 民國 釋印順著
                "Y0012", Kind.lun.of3("成佛之道", "民國", "釋印順"), // 民國 釋印順著
                "Y0013", Kind.lun.of3("太虛大師年譜", "民國", "釋印順"), // 民國 釋印順著
                "Y0014", Kind.lun.of3("佛在人間", "民國", "釋印順"), // 民國 釋印順著
                "Y0015", Kind.lun.of3("學佛三要", "民國", "釋印順"), // 民國 釋印順著
                "Y0016", Kind.lun.of3("以佛法研究佛法", "民國", "釋印順"), // 民國 釋印順著
                "Y0017", Kind.lun.of3("淨土與禪", "民國", "釋印順"), // 民國 釋印順著
                "Y0018", Kind.lun.of3("青年的佛教", "民國", "釋印順"), // 民國 釋印順著
                "Y0019", Kind.lun.of3("我之宗教觀", "民國", "釋印順"), // 民國 釋印順著
                "Y0020", Kind.lun.of3("無諍之辯", "民國", "釋印順"), // 民國 釋印順著
                "Y0021", Kind.lun.of3("教制教典與教學", "民國", "釋印順"), // 民國 釋印順著
                "Y0022", Kind.lun.of3("佛教史地考論", "民國", "釋印順"), // 民國 釋印順著
                "Y0023", Kind.lun.of3("華雨香雲", "民國", "釋印順"), // 民國 釋印順著
                "Y0024", Kind.lun.of3("佛法是救世之光", "民國", "釋印順"), // 民國 釋印順著
                "Y0025", Kind.lun.of3("華雨集（一）", "民國", "釋印順"), // 民國 釋印順著
                "Y0026", Kind.lun.of3("華雨集（二）", "民國", "釋印順"), // 民國 釋印順著
                "Y0027", Kind.lun.of3("華雨集（三）", "民國", "釋印順"), // 民國 釋印順著
                "Y0028", Kind.lun.of3("華雨集（四）", "民國", "釋印順"), // 民國 釋印順著
                "Y0029", Kind.lun.of3("華雨集（五）", "民國", "釋印順"), // 民國 釋印順著
                "Y0030", Kind.lun.of3("雜阿含經論會編（上）", "民國", "釋印順"), // 民國 釋印順著
                "Y0031", Kind.lun.of3("印度之佛教", "民國", "釋印順"), // 民國 釋印順著

                "Y0032", Kind.shi.of3("印度佛教思想史", "民國", "釋印順"), // 民國 釋印順著

                "Y0033", Kind.lun.of3("原始佛教聖典之集成", "民國", "釋印順"), // 民國 釋印順著
                "Y0034", Kind.lun.of3("說一切有部為主的論書與論師之研究", "民國", "釋印順"), // 民國 釋印順著
                "Y0035", Kind.lun.of3("初期大乘佛教之起源與開展", "民國", "釋印順"), // 民國 釋印順著
                "Y0036", Kind.lun.of3("空之探究", "民國", "釋印順"), // 民國 釋印順著
                "Y0037", Kind.lun.of3("如來藏之研究", "民國", "釋印順"), // 民國 釋印順著

                "Y0038", Kind.shi.of3("中國禪宗史", "民國", "釋印順"), // 民國 釋印順著

                "Y0039", Kind.lun.of3("平凡的一生（重訂本）", "民國", "釋印順"), // 民國 釋印順著
                "Y0040", Kind.lun.of3("成佛之道（增注本）", "民國", "釋印順"), // 民國 釋印順著
                "Y0041", Kind.lun.of3("永光集", "民國", "釋印順"), // 民國 釋印順著
                "Y0042", Kind.lun.of3("大乘廣五蘊論講記", "民國", "釋印順") // 民國 釋印順著
        );
    }

    private static void addZ() {
        add(
                "ZS0001", Kind.wenXian.of3("正史佛教資料類編", "现代", "杜斗城"), // 杜斗城輯編
                "ZW0001", Kind.wenXian.of3("天竺國菩提達摩禪師論", "现代", "方廣錩"), // 方廣錩整理
                "ZW0002", Kind.wenXian.of3("禪策問答", "现代", "方廣錩"), // 方廣錩整理
                "ZW0003", Kind.wenXian.of4("息諍論", new String[]{"南梁", "现代"}, "達摩禪師", "方廣錩"), // 達摩禪師作　方廣錩整理
                "ZW0004", Kind.wenXian.of3("八種粗重犯墮", "现代", "馬鳴菩薩", "方廣錩"), // 馬鳴菩薩造　方廣錩整理
                "ZW0005", Kind.wenXian.of3("天請問經疏", "现代", "文軌", "李際寧"), // 沙門文軌撰　李際寧整理
                "ZW0006", Kind.wenXian.of4("《行事鈔》中分門圖錄", new String[]{"唐", "现代"}, "道宣", "蘇軍"), // 沙門道宣述　蘇軍整理
                "ZW0007", Kind.wenXian.of3("《阿毗達磨俱舍論實義疏》", "现代", "尊者安惠", "蘇軍"), // 尊者安惠造　蘇軍整理
                "ZW0008", Kind.wenXian.of3("佛為心王菩薩說頭陀經（附註疏）", "现代", "惠辯禪師", "方廣錩"), // 惠辯禪師註　方廣錩整理
                "ZW0009", Kind.wenXian.of3("佛說孝順子修行成佛經", "现代", "方廣錩"), // 方廣錩整理
                "ZW0010", Kind.wenXian.of3("最妙勝定經", "现代", "方廣錩"), // 方廣錩整理
                "ZW0011", Kind.wenXian.of3("佛說水月光觀音菩薩經", "现代", "方廣錩"), // 方廣錩整理
                "ZW0012", Kind.wenXian.of3("佛說金剛經纂", "现代", "方廣錩"), // 方廣錩整理
                "ZW0013", Kind.wenXian.of3("大方廣華嚴十惡品經", "现代", "徐紹強"), // 徐紹強整理
                "ZW0014a", Kind.wenXian.of3("天公經", "现代", "方廣錩"), // 方廣錩整理
                "ZW0014b", Kind.wenXian.of3("佛說天公經", "现代", "方廣錩"), // 方廣錩整理
                "ZW0014c", Kind.wenXian.of3("天公經", "现代", "方廣錩"), // 方廣錩整理
                "ZW0015a", Kind.wenXian.of3("大般涅槃摩耶夫人品經", "现代", "大德安法師", "李際寧"), // 大德安法師譯　李際寧整理
                "ZW0015b", Kind.wenXian.of3("大般涅槃經佛母品", "现代", "李際寧"), // 李際寧整理
                "ZW0015c", Kind.wenXian.of3("大般涅槃經佛母品", "现代", "李際寧"), // 李際寧整理
                "ZW0015d", Kind.wenXian.of3("大般涅槃經佛為摩耶夫人說偈品經", "现代", "李際寧"), // 李際寧整理
                "ZW0016", Kind.wenXian.of3("關於《禪藏》與敦煌禪籍的若干問題", "现代", "方廣錩"), // 方廣錩
                "ZW0017", Kind.wenXian.of3("七祖法寶記下卷", "现代", "華方田"), // 華方田整理
                "ZW0018a", Kind.wenXian.of3("天竺國菩提達摩禪師論", "现代", "方廣錩"), // 方廣錩整理
                "ZW0018b", Kind.wenXian.of3("天竺國菩提達摩禪師論", "现代", "方廣錩"), // 方廣錩整理
                "ZW0019", Kind.wenXian.of3("淨名經集解關中疏卷上", "现代", "沙門道液", "黎明"), // 沙門道液集　黎明整理
                "ZW0020", Kind.wenXian.of3("法華經文外義", "现代", "李際寧", "張曉娟"), // 李際寧．張曉娟整理
                "ZW0021", Kind.wenXian.of4("諦義證得經", new String[]{"古印度", "现代"}, "烏瑪斯伐蒂", "方廣錩"), // 古印度 烏瑪斯伐蒂著　方廣錩譯註
                "ZW0022", Kind.wenXian.of3("《瑜伽師地論》披尋記敘", "现代", "韓清淨", "程恭讓"), // 韓清淨著　程恭讓整理
                "ZW0023", Kind.wenXian.of3("菩薩總持法", "现代", "上山大峻", "袁德領"), // 上山大峻．袁德領整理
                "ZW0024", Kind.wenXian.of3("大乘起世論", "现代", "方廣錩"), // 方廣錩整理
                "ZW0025", Kind.wenXian.of3("淨名經集解關中疏卷下", "现代", "道液", "黎明"), // 沙門道液述　黎明整理
                "ZW0026", Kind.wenXian.of3("因緣心論頌", "现代", "龍猛菩薩", "華方田"), // 龍猛菩薩作　華方田整理
                "ZW0027", Kind.wenXian.of3("因緣心論釋", "现代", "龍猛菩薩", "華方田"), // 龍猛菩薩造　華方田整理
                "ZW0028", Kind.wenXian.of3("因緣心釋論開決記", "现代", "華方田"), // 華方田整理
                "ZW0029", Kind.wenXian.of3("金剛般若經疏", "现代", "華方田"), // 華方田整理
                "ZW0030", Kind.wenXian.of3("瑜伽論卷第十四手記", "现代", "徐紹強"), // 徐紹強整理
                "ZW0031a", Kind.wenXian.of3("佛說觀佛三昧海經本行品第八", "现代", "黃霞"), // 黃霞整理
                "ZW0031b", Kind.wenXian.of3("佛說相好經", "现代", "黃霞"), // 黃霞整理
                "ZW0031c", Kind.wenXian.of3("佛說觀佛三昧海藏經本行品第八", "现代", "黃霞"), // 黃霞整理
                "ZW0031d", Kind.wenXian.of3("佛說相好經", "现代", "黃霞"), // 黃霞整理
                "ZW0031e", Kind.wenXian.of3("觀佛三昧海經本行品第八", "现代", "黃霞"), // 黃霞整理
                "ZW0032", Kind.wenXian.of2("《金藏》新資料考", "李際寧"), // 李際寧
                "ZW0033", Kind.wenXian.of2("入菩薩行論廣解", "寂天菩薩", "傑操大師", "隆蓮法師"), // 寂天菩薩造頌　傑操大師註解　隆蓮法師譯
                "ZW0034", Kind.wenXian.of3("大藏佛說守護大千國土經", "现代", "陳明光"), // 陳明光整理
                "ZW0035", Kind.wenXian.of3("六道輪迴圖偈頌", "现代", "陳明光"), // 陳明光整理
                "ZW0036", Kind.wenXian.of3("父母恩重經變經文偈頌", "现代", "陳明光"), // 陳明光整理
                "ZW0037", Kind.wenXian.of3("大方便佛報恩經變經文偈頌", "现代", "陳明光"), // 陳明光整理
                "ZW0038", Kind.wenXian.of3("三聖御制佛牙贊", "北宋", "宋太宗", "宋真宗", "宋仁宗", "陳明光"), // 北宋 太宗．真宗．仁宗撰　陳明光整理
                "ZW0039", Kind.wenXian.of3("觀經變像經文偈頌", "现代", "陳明光"), // 陳明光整理
                "ZW0040", Kind.wenXian.of3("地獄變經文偈頌", "现代", "陳明光"), // 陳明光整理
                "ZW0041", Kind.wenXian.of3("佛性問答", "现代", "業露華"), // 業露華整理
                "ZW0042", Kind.wenXian.of3("大乘無盡藏法", "现代", "信行", "方廣錩"), // 信行撰　方廣錩整理
                "ZW0043a", Kind.wenXian.of3("佛在金棺上囑累經", "现代", "侯旭東"), // 侯旭東整理
                "ZW0043b", Kind.wenXian.of3("如來在金棺囑累清淨莊嚴敬福經", "现代", "侯旭東"), // 侯旭東整理
                "ZW0044", Kind.wenXian.of2("傳善無畏所譯三部密教儀軌出處及年代考", "陳金華"), // 陳金華
                "ZW0045", Kind.wenXian.of2("小誦", "鄧殿臣"), // 鄧殿臣譯
                "ZW0046", Kind.wenXian.of2("即興自說", "鄧殿臣"), // 鄧殿臣譯
                "ZW0047", Kind.wenXian.of2("大隧道本生", "鄧殿臣"), // 鄧殿臣譯
                "ZW0048", Kind.wenXian.of2("大念處經", "鄧殿臣", "趙桐"), // 鄧殿臣．趙桐譯
                "ZW0049", Kind.wenXian.of3("瑜伽師地開釋分門記", "现代", "徐紹強"), // 徐紹強整理
                "ZW0050", Kind.wenXian.of3("天台教典入藏考", "现代", "方廣錩"), // 方廣錩
                "ZW0051", Kind.wenXian.of3("楞嚴解冤釋結道場儀", "宋", "釋祖照", "趙文煥", "侯沖"), // 宋 釋祖照集　趙文煥．侯沖整理
                "ZW0052", Kind.wenXian.of3("地藏慈悲救苦薦福利生道場儀", "宋", "釋元照", "趙文煥", "侯沖"), // 宋 釋元照集　趙文煥．侯沖整理
                "ZW0053", Kind.wenXian.of3("銷釋金剛經科儀", "宋", "釋宗鏡", "侯沖"), // 宋 釋宗鏡述　侯沖整理
                "ZW0054", Kind.wenXian.of3("廣施無遮道場儀", "现代", "侯沖"), // 侯沖整理
                "ZW0055", Kind.wenXian.of3("大黑天神道場儀", "现代", "侯沖"), // 侯沖整理
                "ZW0056", Kind.wenXian.of3("進新譯大方廣佛花嚴經表", "现代", "弘景", "方廣錩"), // 弘景撰　方廣錩整理
                "ZW0057", Kind.wenXian.of2("雲南阿吒力教經典及其在中國佛教研究中的價值", "侯沖"), // 侯沖
                "ZW0058", Kind.wenXian.of3("注心要法門", "唐", "宗密", "方廣錩"), // 唐 宗密注　方廣錩整理
                "ZW0059a", Kind.wenXian.of2("姚和上金剛五禮一本", "姚和尚", "達照"), // 姚和尚撰　達照整理
                "ZW0059b", Kind.wenXian.of2("金剛五禮", "姚和尚", "達照"), // 姚和尚撰　達照整理
                "ZW0060", Kind.wenXian.of3("金剛禮", "遼", "通理大師", "達照"), // 遼 通理大師集　達照整理
                "ZW0061", Kind.wenXian.of2("護國司南抄", "玄鑒", "侯沖"), // 沙門玄鑒集　侯沖整理
                "ZW0062", Kind.wenXian.of2("佛說消災延壽藥師灌頂章句儀", "若愚", "侯沖"), // 沙門若愚述　侯沖整理
                "ZW0063", Kind.wenXian.of3("淨度三昧經", "日本", "大內文雄", "齊藤隆信"), // 大內文雄．齊藤隆信整理
                "ZW0064a", Kind.wenXian.of3("地藏菩薩十齋日", "现代", "張總"), // 張總整理
                "ZW0064b", Kind.wenXian.of3("地藏菩薩十齋日", "现代", "張總"), // 張總整理
                "ZW0064c", Kind.wenXian.of3("地藏菩薩十齋日", "现代", "張總"), // 張總整理
                "ZW0064d", Kind.wenXian.of3("地藏菩薩十齋日", "现代", "張總"), // 張總整理
                "ZW0064e", Kind.wenXian.of3("地藏菩薩十齋日", "现代", "張總"), // 張總整理
                "ZW0064f", Kind.wenXian.of3("地藏菩薩十齋日", "现代", "張總"), // 張總整理
                "ZW0064g", Kind.wenXian.of3("地藏菩薩十齋日", "现代", "張總"), // 張總整理
                "ZW0064h", Kind.wenXian.of3("地藏菩薩十齋日", "现代", "張總"), // 張總整理
                "ZW0065", Kind.wenXian.of3("寧夏西夏方塔出土漢文佛典敘錄", "现代", "方廣錩"), // 方廣錩
                "ZW0066", Kind.wenXian.of2("日本佛教目錄學的形成——以《東域傳燈錄》為中心", "末木文美士"), // 末木文美士
                "ZW0067", Kind.wenXian.of2("華嚴略疏卷第一", "悟緣"), // 悟緣　整理
                "ZW0068", Kind.wenXian.of3("如來廣孝十種報恩道場儀", "南宋", "思覺", "趙文煥", "侯沖"), // 南宋 思覺集　趙文煥．侯沖整理
                "ZW0069", Kind.wenXian.of2("二曜金剛合璧", "通源"), // 通源整理
                "ZW0070", Kind.wenXian.of3("敦煌寺院所藏大藏經概貌", "现代", "方廣錩"), // 方廣錩
                "ZW0071", Kind.wenXian.of3("《慧琳音義》與唐代大藏經", "现代", "方廣錩"), // 方廣錩
                "ZW0072", Kind.wenXian.of2("佛性觀修善法", "信行", "西本照真"), // 信行撰　西本照真整理
                "ZW0073a", Kind.wenXian.of3("金剛經讚集", "现代", "達照"), // 達照整理
                "ZW0073b", Kind.wenXian.of3("金剛經讚集（擬）", "现代", "達照"), // 達照整理
                "ZW0073c", Kind.wenXian.of3("金剛經讚集（擬）", "现代", "達照"), // 達照整理
                "ZW0073d", Kind.wenXian.of3("金剛經注頌釋", "现代", "達照"), // 達照整理
                "ZW0073e", Kind.wenXian.of3("金剛經頌（擬）", "现代", "達照"), // 達照整理
                "ZW0073f", Kind.wenXian.of3("梁朝傅大士頌金剛經", "现代", "達照"), // 達照整理
                "ZW0073g", Kind.wenXian.of3("梁朝傅大士頌金剛經", "现代", "達照"), // 達照整理
                "ZW0073h", Kind.wenXian.of3("梁朝傅大士夾頌金剛經", "现代", "達照"), // 達照整理
                "ZW0074", Kind.wenXian.of2("寶髻大王菩薩本緣", "任遠"), // 任遠譯
                "ZW0075", Kind.wenXian.of2("寶髻本緣", "克什曼德拉", "任遠"), // 克什曼德拉原著　任遠譯
                "ZW0076", Kind.wenXian.of2("三階教文獻綜述", "西本照真"), // 西本照真
                "ZW0077", Kind.wenXian.of3("關於江泌女子僧法誦出經", "现代", "方廣錩"), // 方廣錩
                "ZW0078", Kind.wenXian.of3("三自性論", "印度", "世親", "金克木"), // 印度 世親著　金克木譯
                "ZW0079", Kind.wenXian.of3("因相輪抉擇", "印度", "陳那", "韓鏡清", "釋剛曉"), // 印度 陳那著　韓鏡清初譯　釋剛曉校訂註釋
                "ZW0080", Kind.wenXian.of3("諸經佛名卷上", "现代", "章光池"), // 章光池整理
                "ZW0081", Kind.wenXian.of3("御注金剛般若經", "唐", "李隆基", "衣川賢次"), // 唐 李隆基著　衣川賢次整理
                "ZW0082", Kind.wenXian.of3("文殊師利所說般若波羅蜜經序偈釋", "现代", "曹淩"), // 曹淩整理
                "ZW0083", Kind.wenXian.of3("法華七禮文", "现代", "汪娟"), // 汪娟整理
                "ZW0084", Kind.wenXian.of3("照明菩薩經", "现代", "林敏"), // 林敏整理
                "ZW0085", Kind.wenXian.of3("佛說佛名經（二十卷本）", "现代", "張麗", "張磊"), // 張麗．張磊整理
                "ZW0086", Kind.wenXian.of3("敦煌本《壇經》校釋疏義（標題章、第一章、第二章）", "现代", "方廣錩"), // 方廣錩
                "ZW0087", Kind.wenXian.of3("敦煌本《壇經》錄校三題", "现代", "方廣錩"), // 方廣錩
                "ZW0088", Kind.wenXian.of3("明初的兩部南藏", "日本", "野澤佳美"), // 日 立正大學教授 野澤佳美
                "ZW0089", Kind.wenXian.of2("讚禮地藏菩薩懺悔發願法", "張曉麗"), // 張曉麗整理
                "ZW0090", Kind.wenXian.of3("如來九觀（擬）", "现代", "方廣錩"), // 方廣錩整理
                "ZW0091", Kind.wenXian.of2("金剛峻經金剛頂一切如來深妙秘密金剛界大三昧耶修行四十二種壇法經作用威儀法則　大毘盧遮那佛金剛心地法門密法戒壇法儀則", "侯沖"), // 侯沖整理
                "ZW0092", Kind.wenXian.of2("金剛峻經金剛頂一切如來深妙秘密金剛界大三昧耶修行四十九種壇法經作用威儀法則　大毘盧遮那佛金剛心地法門密法戒壇法儀則", "侯沖"), // 侯沖整理
                "ZW0093", Kind.wenXian.of2("佛說佛名經（二十卷本——卷第五～卷第七）", "張麗", "張磊"), // 張麗．張磊整理
                "ZW0094", Kind.wenXian.of2("敦煌本《壇經》校釋疏義（第三章～第五章）", "張磊", "王侃", "李鐵華"), // 張磊．王侃．李鐵華執筆　研讀班集體討論
                "ZW0095", Kind.wenXian.of3("日本的漢文大藏經收藏及其特色——以刻本大藏經為中心", "日本", "梶浦晉"), // 日本 京都大學人文所 梶浦晉
                "ZW0096", Kind.wenXian.of3("論《高麗再雕藏》中所見的《契丹藏》", "韓國", "柳富鉉"), // 韓國 大真大學校教授 柳富鉉
                "ZW0097", Kind.wenXian.of3("金剛般若經義疏卷二", "现代", "方廣錩"), // 方廣錩整理
                "ZW0098", Kind.wenXian.of3("圓通三慧大齋道場儀", "宋", "侯溥", "侯沖"), // 宋 侯溥作　侯沖整理
                "ZW0099", Kind.wenXian.of2("佛說佛名經（二十卷本——卷第八～卷第十）", "張麗", "張磊"), // 張麗．張磊整理
                "ZW0100", Kind.wenXian.of2("敦煌本《壇經》校釋疏義（第六章～第八章）", "曹淩", "周芳", "曾曉紅"), // 曹淩．周芳．曾曉紅執筆　研讀班集體討論
                "ZW0101", Kind.wenXian.of3("關於《佛說孝順子修行成佛經》的若干新資料", "现代", "方廣錩"), // 方廣錩
                "ZW0102", Kind.wenXian.of3("關於宮內廳書陵部所藏福州版大藏經中的混合冊與印章", "日本", "中村一紀"), // 日本 宮內廳書陵部 中村一紀
                "ZW0103", Kind.wenXian.of2("漢文大藏經研究要重視文獻價值的判別", "熊國禎"), // 熊國禎
                "ZWa001", Kind.wenXian.of3("緣起", "现代", "方廣錩"), // 方廣錩
                "ZWa002", Kind.wenXian.of3("卷首語", "现代", "方廣錩"), // 方廣錩
                "ZWa003", Kind.wenXian.of2("目錄"), //
                "ZWa004", Kind.wenXian.of2("錄文校勘體例"), //
                "ZWa005", Kind.wenXian.of2("徵稿啟事"), //
                "ZWa006", Kind.wenXian.of2("《藏外佛教文獻》編委會啟事"), //
                "ZWa007", Kind.wenXian.of3("卷首語", "现代", "方廣錩"), // 方廣錩
                "ZWa008", Kind.wenXian.of2("目錄"), //
                "ZWa009", Kind.wenXian.of2("錄文校勘體例"), //
                "ZWa010", Kind.wenXian.of2("大藏經編纂及電腦化研討會論文特集"), //
                "ZWa011", Kind.wenXian.of2("徵稿啟事"), //
                "ZWa012", Kind.wenXian.of2("徵訂啟事"), //
                "ZWa013", Kind.wenXian.of3("卷首語", "现代", "方廣錩"), // 方廣錩
                "ZWa014", Kind.wenXian.of2("目錄"), //
                "ZWa015", Kind.wenXian.of2("錄文校勘體例"), //
                "ZWa016", Kind.wenXian.of2("《藏外佛教文獻》第一輯、第二輯要目"), //
                "ZWa017", Kind.wenXian.of2("徵稿啟事"), //
                "ZWa018", Kind.wenXian.of2("編委會名單"), //
                "ZWa019", Kind.wenXian.of2("鳴謝"), //
                "ZWa020", Kind.wenXian.of3("卷首語", "现代", "方廣錩"), // 方廣錩
                "ZWa021", Kind.wenXian.of2("目錄"), //
                "ZWa022", Kind.wenXian.of2("錄文校勘體例"), //
                "ZWa023", Kind.wenXian.of2("「中國社會科學院佛教研究中心成立暨佛教研究與新時期的文化建設研討會」紀要"), //
                "ZWa024", Kind.wenXian.of2("《藏外佛教文獻》第一～六輯要目"), //
                "ZWa025", Kind.wenXian.of2("徵稿啟事"), //
                "ZWa026", Kind.wenXian.of2("編委會名單"), //
                "ZWa027", Kind.wenXian.of3("卷首語", "现代", "方廣錩"), // 方廣錩
                "ZWa028", Kind.wenXian.of2("目錄"), //
                "ZWa029", Kind.wenXian.of2("錄文校勘體例"), //
                "ZWa030", Kind.wenXian.of2("《藏外佛教文獻》第一～六輯要目"), //
                "ZWa031", Kind.wenXian.of2("徵稿啟事"), //
                "ZWa032", Kind.wenXian.of2("編委會名單"), //
                "ZWa033", Kind.wenXian.of3("卷首語", "现代", "方廣錩"), // 方廣錩
                "ZWa034", Kind.wenXian.of2("目錄"), //
                "ZWa035", Kind.wenXian.of2("錄文校勘體例"), //
                "ZWa036", Kind.wenXian.of2("《藏外佛教文獻》第一～六輯要目"), //
                "ZWa037", Kind.wenXian.of2("徵稿啟事"), //
                "ZWa038", Kind.wenXian.of2("編委會名單"), //
                "ZWa039", Kind.wenXian.of3("卷首語", "现代", "方廣錩"), // 方廣錩
                "ZWa040", Kind.wenXian.of2("目錄"), //
                "ZWa041", Kind.wenXian.of2("錄文校勘體例"), //
                "ZWa042", Kind.wenXian.of2("《藏外佛教文獻》要目"), //
                "ZWa043", Kind.wenXian.of2("徵稿啟事"), //
                "ZWa044", Kind.wenXian.of3("卷首語", "现代", "方廣錩"), // 方廣錩
                "ZWa045", Kind.wenXian.of2("目錄"), //
                "ZWa046", Kind.wenXian.of2("錄文校勘體例"), //
                "ZWa047", Kind.wenXian.of2("《藏外佛教文獻》要目"), //
                "ZWa048", Kind.wenXian.of2("徵稿啟事"), //
                "ZWa049", Kind.wenXian.of2("鳴謝"), //
                "ZWa050", Kind.wenXian.of3("卷首語", "现代", "方廣錩"), // 方廣錩
                "ZWa051", Kind.wenXian.of2("目錄"), //
                "ZWa052", Kind.wenXian.of2("錄文校勘體例"), //
                "ZWa053", Kind.wenXian.of2("談當前數字圖書館的幾個問題"), //
                "ZWa054", Kind.wenXian.of2("《藏外佛教文獻》要目"), //
                "ZWa055", Kind.wenXian.of2("徵稿啟事"), //
                "ZWa056", Kind.wenXian.of2("鳴謝"), //
                "ZWa057", Kind.wenXian.of2("目錄"), //
                "ZWa058", Kind.wenXian.of3("卷首語", "现代", "方廣錩"), // 方廣錩
                "ZWa059", Kind.wenXian.of2("錄文校勘體例"), //
                "ZWa060", Kind.wenXian.of2("徵稿啟事"), //
                "ZWa061", Kind.wenXian.of2("《藏外佛教文獻》總目錄（第一輯～第十二輯）"), //
                "ZWa062", Kind.wenXian.of2("鳴謝"), //
                "ZWa063", Kind.wenXian.of2("目錄"), //
                "ZWa064", Kind.wenXian.of3("卷首語", "现代", "方廣錩"), // 方廣錩
                "ZWa065", Kind.wenXian.of2("錄文校勘體例"), //
                "ZWa066", Kind.wenXian.of2("徵稿啟事"), //
                "ZWa067", Kind.wenXian.of2("《藏外佛教文獻》總目錄（第一輯～第十二輯）"), //
                "ZWa068", Kind.wenXian.of2("鳴謝"), //
                "ZWa069", Kind.wenXian.of2("目錄"), //
                "ZWa070", Kind.wenXian.of3("卷首語", "现代", "方廣錩"), // 方廣錩
                "ZWa071", Kind.wenXian.of2("錄文校勘體例"), //
                "ZWa072", Kind.wenXian.of2("徵稿啟事"), //
                "ZWa073", Kind.wenXian.of2("《藏外佛教文獻》總目錄（第一輯～第十二輯）")//
        );
    }

    public final Kind kind;
    public final String title;
    public final String[] periods, authors;

    public BookInfo(Kind kind, String title, String[] periods, String... authors) {
        this.kind = kind;
        this.title = title;
        this.periods = periods;
        this.authors = authors;
    }
}
